import 'package:flutter/material.dart';
import 'package:sco_v1/resources/app_colors.dart';
import 'package:sco_v1/resources/widgets/subTitle_widget.dart';
import 'package:sco_v1/view/apply_scholarship/form_view_Utils.dart';
import 'package:sco_v1/view/main_view/scholarship_in_uae/bachelor_inside_uae/bachelor_inside_uae.dart';

import '../../../../resources/widgets/bullet_text_widget.dart';

getDdsOverView(context) {
  return Column(crossAxisAlignment: CrossAxisAlignment.start, children: [
    sectionTitle(title: "نبذة عن بعثة صاحب السمو رئيس الدولة للأطباء المتميزين"),
    kSmallSpace,
    const Text('''
          يسعى مكتب البعثات الدراسية إلى إتاحة الفرصة أمام الأطباء المواطنين المتميزين، لاستكمال دراستهم، وتدريبهم السريري، للحصول على أعلى الدرجات والشهادات في مختلف التخصصات الطبية والصحية. وذلك في إطار الحرص على تنمية وتطوير العنصر البشري في قطاع الرعاية الصحية في دولة الإمارات العربية المتحدة، والذي يعتبر من أهم القطاعات الاقتصادية الخدمية.

كما تهدف البعثة التي تأسست عام 2015 إلى تأهيل جيل قيادي من أبناء وبنات الإمارات، قادر على مواجهة تحديات المستقبل، وذلك من أجل رفد الدولة بكوادر وطاقات متميزة، تحمل على عاتقها مهمة تعزيز وتطوير عملية التنمية الشاملة التي وضع أسسها المغفور له بإذن الله الشيخ زايد بن سلطان آل نهيان، ويسير على خطاها بكل حكمة واقتدار صاحب السمو الشيخ محمد بن زايد آل نهيان رئيس الدولة حفظه الله.
          '''),
    kSmallSpace,
    TappableImage(
      imagePath: "https://www.sco.ae/documents/20126/35273/DQrns2jX0AEL0l0+%281%29.png/22d48737-fa41-f911-868f-e250396ab9d2?t=1561469186310",
      isNetwork: true,
    ),
    kSmallSpace,
    subTitle("الرؤية:", AppColors.scoButtonColor),
    Text('أن نكون جهة الابتعاث الرائدة لقادة المستقبل.'),
    kSmallSpace,
    subTitle("الرسالة:", AppColors.scoButtonColor),
    Text('تقديم بعثات دراسية رائدة إلى الطلبة المتميّزين في أرقى الجامعات المحلية والعالمية، للمساهمة في إعداد جيل واعد، يواكب جهود التنمية والتطلعات المستقبلية للدولة.'),
    kSmallSpace,
    subTitle("أهداف البعثة:", AppColors.scoButtonColor),
    Text('''
1. اختيار نخبة من الأطباء المتميزين، وإيفادهم للدراسة والتدريب في المراكز الطبية العالمية المتميزة والجامعات المرموقة.
2. رفد الدولة بكوادر طبية وطنية مؤهلة في مختلف التخصصات الطبية، بهدف تنمية وتطوير العنصر البشري في قطاع الرعاية الصحية بالدولة، من خلال اكتساب أحدث المعارف وأفضل الخبرات.
'''),
    kSmallSpace,
    subTitle("برامج البعثة"),
    kSmallSpace,
    getBulletText("برامج طلبة كليات الطب"),
    Text('''
أولًا: برنامج التحضير للجزء الأول من امتحان التراخيص الأمريكية USMLE1 

     ثانيًا: منحة اجتياز الجزء الأول USMLE1 

     ثالثًا: برنامج التدريب الاختياري لطلبة الطب Electives

     رابعًا: برنامج سنة الامتياز لطلاب كلية الطب (السنة الأخيرة)
'''),
    kSmallSpace,
    getBulletText("برامج الأطباء الخريجين"),
    Text('''ولًا: برنامج أطباء الامتياز 

     ثانيًا: برامج التجسير 

     ثالثًا: برنامج التدريب القصير 
          ''')
  ]);
}

geetDdsMedicalCollegeProgram(context) {
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      sectionTitle(title: "برامج طلبة كليات الطب"),
      kSmallSpace,
      subTitle("برامج طلبة كليات الطب", AppColors.scoButtonColor),
      getBulletText('أولًا: برنامج التحضير للجزء الأول من امتحان التراخيص الأمريكية USMLE1'),
      getBulletText('ثانيًا: منحة اجتياز الجزء الأول USMLE1'),
      getBulletText('ثالثًا: برنامج التدريب الاختياري لطلبة الطب Electives'),
      getBulletText('رابعًا: برنامج سنة الامتياز لطلاب كلية الطب (السنة الأخيرة)'),
      kSmallSpace,
      subTitle('أولًا: برنامج التحضير للجزء الأول من امتحان التراخيص الأمريكية USMLE1', AppColors.scoButtonColor),
      Text('برنامج مخصص لطلبة كليات الطب المتميزين، يهدف إلى تحضيرهم لاجتياز الجزء الأول من امتحان التراخيص الطبية الأمريكية USMLE1'),
      kSmallSpace,
      subTitle("الشروط العامة لبرنامج التحضير للجزء الأول من امتحان USMLE1:", AppColors.scoButtonColor),
      getBulletText('أن يكون الطالب من مواطني دولة الإمارات العربية المتحدة.'),
      getBulletText('أن يكون الطالب يدرس حاليا في إحدى كليات الطب داخل أو خارج الدولة.'),
      getBulletText('أن يكون حاصلا على معدل تراكمي 3.0 على الأقل أو ما يعادلها خلال سنوات الدراسة.'),
      getBulletText('توقيع تعهد بالالتزام بكافة شروط وقواعد البرنامج.'),
      subTitle("* تعطى الأولوية للطلبة الحاصلين على علامات متميزة نظرا لمحدودية المقاعد."),
      kSmallSpace,
      kSmallSpace,
      subTitle("امتيازات برنامج التحضير لامتحان الجزء الأول USMLE1:", Colors.black),
      getBulletText('توفير الدعم الإداري والإرشاد الأكاديمي للطالب خلال الالتحاق البرنامج.'),
      getBulletText('مخصصات مالية للكتب والمراجع للجزء الأول، تصرف مرة واحدة.'),
      getBulletText('الإلحاق بدورات تحضيرية للجزء الأول من الامتحان.'),
      getBulletText('تسديد رسوم امتحان USMLE1.'),
      subTitle('رابعًا: برنامج سنة الامتياز لطلاب كلية الطب (السنة الأخيرة)', AppColors.scoButtonColor),
      getBulletText(
          'يهدف هذا البرنامج إلى إلحاق طلبة السنة الأخيرة بكليات الطب داخل الدولة، وقبل التخرج، بكليات الطب في الولايات المتحدة لمدة عام، ومعادلة هذه الفترة كمقابل لسنة الامتياز، بشرط موافقة جهات التراخيص الطبية في الدولة.'),
      kSmallSpace,
      subTitle('شروط الالتحاق بالبرنامج:', AppColors.scoButtonColor),
      getBulletText('أن يكون الطالب من مواطني دولة الإمارات العربية المتحدة.'),
      getBulletText('أن يكون الطالب في السنة الأخيرة من الدراسة بإحدى كليات الطب داخل أو خارج الدولة.'),
      getBulletText('أن يكون حاصلا على معدل تراكمي 3.5 على الأقل خلال سنوات الدراسة.'),
      getBulletText('اجتياز الجزء الأول USMLE1 والجزء الثاني USMLE2.'),
      getBulletText('الحصول على قبول في برنامج يعادل سنة الامتياز في إحدى المستشفيات العالمية المعتمدة في الولايات المتحدة الأمريكية.'),
      kSmallSpace,
      subTitle('امتيازات البرنامج:', AppColors.scoButtonColor),
      getBulletText('تغطية كافة الرسوم الدراسية أو مصاريف التدريب.'),
      getBulletText('مكافأة شهرية مجزية.'),
      getBulletText('بدل تذاكر سفر.'),
      getBulletText('تأمين صحي للمبتعث.'),
      kSmallSpace,
      subTitle('التزامات الطالب:', AppColors.scoButtonColor),
      getBulletText('الحفاظ على معدل تراكمي 3.0 على الأقل خلال سنوات الدراسة.'),
      getBulletText('الانتظام في حضور الدورات التدريبية.'),
      getBulletText(
          'بعد اجتياز جميع أجزاء الامتحان، واستيفاء باقي الشروط، يلتزم الطالب بالتقديم على رخصة مزاولة المهنة في الولايات المتحدة ECFMG Certificate، والتقديم على برامج الأطباء المقيمين في التخصص من خلال نظام ERAS.'),
      getBulletText('الحرص على تحصيل العلم وبذل أقصى الجهد في الدراسة، والتقديم للامتحانات المطلوبة واستيفاء كافة المتطلبات.'),
      getBulletText('التقيد بأنظمة الإشراف الإداري والمتابعة الأكاديمية وبالتوجيهات الصادرة عن المكتب.'),
      getBulletText(
          'الالتزام برد جميع النفقات المالية التي صرفت للطالب في حالة انسحابه من البرنامج، أو إلغاء التحاق الطالب بالبرنامج لسبب عائد له، أو مخالفة ضوابط المكتب، أو لأي من الأسباب وفقا للأحكام النافذة.'),
      kSmallSpace,
      subTitle('الوثائق والمستندات المطلوبة لبرامج طلبة كليات الطب:', AppColors.scoButtonColor),
      getBulletText('صورة شخصية حديثة بالزي الوطني.'),
      getBulletText('صورة عن جواز السفر متضمنة صفحة الرقم الموحد.'),
      getBulletText('صورة عن بطاقة الهوية مصورة من الجهتين على صفحة واحدة.'),
      getBulletText('صورة كاملة عن خلاصة القيد تشمل جميع أفراد الأسرة.'),
      getBulletText('صورة عن السجل الدراسي لجميع السنوات الدراسية السابقة.'),
      getBulletText('صورة من امتحان USMLE1 للمتقدمين لبرنامج منحة اجتياز الجزء الأول.'),
      getBulletText('نتيجة امتحان IFOM إن وجدت.'),
      kSmallSpace,
      subTitle('مستندات إضافية للمتقدمين لبرنامج سنة الامتياز:', AppColors.scoButtonColor),
      getBulletText('رسالة القبول من المستشفى خارج الدولة.'),
      getBulletText('صور من امتحان الجزء الأول USMLE1 والجزء الثاني USMLE2 .'),
      kSmallSpace,
      subTitle('بعد الحصول على المنحة أو البعثة تستكمل المستندات التالية:', AppColors.scoButtonColor),
      getBulletText('شهادة حسن السير والسلوك.'),
      getBulletText('توقيع تعهد بالالتزام بشروط وقواعد الإيفاد.'),
      kSmallSpace,
      subTitle('إجراءات التقديم للبعثة:', AppColors.scoButtonColor),
      getBulletText('يجب على الطالب الراغب بالتقديم للبعثة والمستوفي لكافة الشروط اتباع الإجراءات التالية:'),
      getBulletText('تقديم طلب البعثة عن طريق الموقع الإلكتروني للمكتب'),
      getBulletText('تحميل المستندات والوثائق المطلوبة'),
      kSmallSpace,
      getBulletText('ملاحظة: التقديم للبعثة لا يعني ضمان الحصول على البعثة، ويخضع الطلب للشروط والأحكام وتوفر المقاعد الدراسية.'),
    ],
  );
}

getDdsGraduationPhycian(context) {
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      sectionTitle(title: 'برامج الأطباء الخريجين'),
      kSmallSpace,
      subTitle('برامج الأطباء الخريجين', AppColors.scoButtonColor),
      kMinorSpace,
      getBulletText('برنامج أطباء الامتياز'),
      getBulletText('برنامج التجسير'),
      getBulletText('برنامج التدريب القصير'),
      getBulletText('برنامج الأطباء المقيمين والزمالة'),
      kMinorSpace,
      Text(
        'أولًا: برنامج أطباء الامتياز',
        style: TextStyle(fontWeight: FontWeight.w500),
      ),
      Text('يهدف هذا البرنامج إلى منح الفرصة لخريجي كلية الطب لقضاء سنة الامتياز خارج الدولة في إحدى المستشفيات العالمية في دول الابتعاث المعتمدة.'),
      Text(
        'ثانيًا: برنامج التجسير',
        style: TextStyle(fontWeight: FontWeight.w500),
      ),
      Text('يهدف هذا البرنامج إلى تحضير وتأهيل الأطباء الذين اجتازوا امتحان USMLE للالتحاق ببرامج الأطباء المقيمين في إحدى المستشفيات العالمية في الولايات المتحدة.'),
      Text(
        'ثالثًا: برنامج التدريب القصير',
        style: TextStyle(fontWeight: FontWeight.w500),
      ),
      Text('يختص هذا البرنامج بابتعاث الأطباء في برامج التدريب قصيرة المدى، لمدة تتراوح بين أسبوعين وثلاثة أشهر، بهدف اكتساب مهارات تخصصية دقيقة.'),
      Text(
        'رابعًا: برنامج الأطباء المقيمين والزمالة',
        style: TextStyle(fontWeight: FontWeight.w500),
      ),
      Text('يهدف هذا البرنامج إلى إلحاق الأطباء المتميزين ببرامج الإقامة والزمالة في إحدى المستشفيات العالمية في دول الابتعاث المعتمدة.'),
      Text(
        'الشروط العامة للقبول في برامج بعثة الأطباء المتميزين:',
        style: TextStyle(fontWeight: FontWeight.w500),
      ),
      getBulletText("أن يكون المتقدم من مواطني دولة الإمارات العربية المتحدة."),
      getBulletText("أن يكون حاصلا على شهادة جامعية، في إحدى التخصصات الطبية أو الصحية التي تتوافق مع أهداف البعثة، ومن إحدى الجامعات المعترف بها داخل أو خارج الدولة."),
      getBulletText("أن يكون حاصلا على معدل 3.0 أو ما يعادله على الأقل عند التخرج."),
      getBulletText("ألا يكون حاصلا على بعثة أو منحة أو مساعدة دراسية من جهة أخرى."),
      getBulletText("أن يجتاز اختبارات اللغة وامتحانات التراخيص الطبية في بلد الابتعاث، حسب المعدلات المنصوص عليها في الجدول المرفق."),
      getBulletText("أن يحصل على خطاب قبول رسمي في برنامج التدريب في إحدى المستشفيات العالمية في دول الابتعاث المعتمدة لدى المكتب."),
      getBulletText("أن يجتاز المقابلة الشخصية."),
      getBulletText("أن يقدم ما يفيد من إدارة التعليم الطبي بجهة العمل عن حاجة المنشأة لهذا النوع من التدريب، وأن يقدم إجازة دراسية تعادل مدة البرنامج بعد الحصول على البعثة."),
      getBulletText("أن يكون حسن السيرة والسلوك، وألا يكون قد سبق الحكم عليه بعقوبة جنائية أو في جريمة من الجرائم المخلة بالشرف أو الأمانة."),
      getBulletText("أن يوقع تعهداً بالالتزام بكافة وشروط وقواعد الإيفاد بعد الحصول على البعثة."),
      kSmallSpace,
      Text('المستندات العامة للتقديم على برامج بعثة الأطباء المتميزين:',style: TextStyle(fontWeight: FontWeight.w500),),
      getBulletText("صورة شخصية حديثة بالزي الوطني."),
      getBulletText("صورة عن جواز السفر متضمنة صفحة الرقم الموحد."),
      getBulletText("صورة كاملة عن خلاصة القيد تشمل جميع أفراد الأسرة."),
      getBulletText("صورة عن بطاقة الهوية مصورة من الجهتين."),
      getBulletText("سيرة ذاتية."),
      getBulletText("صورة عن السجل الكامل للعلامات الدراسية."),
      getBulletText("صورة من شهادة البكالوريوس مبين بها التقدير العام أو المعدل التراكمي عند التخرج."),
      getBulletText("صورة عن شهادة الامتياز بالنسبة للأطباء ومن في حكمهم، ويستثنى المتقدمون لبرامج سنة الامتياز والتجسير."),
      getBulletText("صور عن شهادات البورد، والماجستير، والدكتوراه، وأي شهادات أخرى، إن وجدت."),
      getBulletText("شهادة اجتياز امتحانات اللغة والتراخيص الطبية حسب دولة الابتعاث."),
      getBulletText("خطاب القبول من المستشفى أو الجامعة، يوضح تاريخ بداية ونهاية البرنامج، والتخصص، والراتب."),
      kMinorSpace,
      Text('* يجب أن تكون الشهادات الدراسية والوثائق صادرة عن جهة الاختصاص بالدولة، ومصدقة حسب الأصول.'),
      Text('بعد الحصول على البعثة تستكمل المستندات التالية:'),
      getBulletText("إجازة دراسية تعادل مدة البرنامج."),
      getBulletText("شهادة حسن السير والسلوك."),
      getBulletText("شهادة تأجيل أو إتمام الخدمة الوطنية للذكور."),
      getBulletText("توقيع تعهد بالالتزام بشروط وقواعد الإيفاد."),
      kSmallSpace,
      Text('الحد الأدنى للمعدلات المطلوبة في امتحان التراخيص الطبية',style: TextStyle(fontWeight: FontWeight.w500),),
      kSmallSpace,
      Text('امتيازات برامج بعثة الأطباء المتميزين:',style: TextStyle(fontWeight: FontWeight.w500),),
      getBulletText("تغطية كافة الرسوم الدراسية أو مصاريف التدريب."),
      getBulletText("مكافأة شهرية مجزية أو نصف المكافأة إذا ما كان المبتعث موظفا يستلم راتبا من جهة عمله."),
      getBulletText("توفير مخصصات مالية سنوية للكتب الدراسية (لا تصرف للمبتعثين في برامج التدريب القصير)."),
      getBulletText("بدل استعداد للسفر تصرف مرة واحدة (للمبتعثين في برامج الأطباء المقيمين والزمالة فقط)."),
      getBulletText("بدل تذاكر سفر."),
      getBulletText("تأمين صحي للمبتعث."),
      subTitle('* المخصصات المالية المذكورة أعلاه تمنح للمبتعثين للولايات المتحدة، وتختلف المخصصات المالية حسب بلد الابتعاث.'),
      kSmallSpace,
      getBulletText('إذا ما كان المبتعث متزوجاً (برامج الأطباء المقيمين والزمالة فقط) يمنح ما يلي:'),
      getBulletText("علاوة إضافية على الراتب الشهري."),
      getBulletText("بدل تذاكر سفر، للزوجة أو الزوج، وثلاثة من الأبناء المعالين."),
      getBulletText("التأمين الصحي ونفقات العلاج للزوجة أو الزوج، وثلاثة من الأبناء المعالين."),
      getBulletText("الرسوم الدراسية لثلاثة من الأبناء في بلد الإيفاد، من تتراوح أعمارهم بين 4 إلى 18 سنة."),
      subTitle('* بشرط اصطحاب الزوجة/الزوج والأولاد لدولة الابتعاث.'),
      kSmallSpace,
      Text('التزامات الطبيب المبتعث:',style: TextStyle(fontWeight: FontWeight.w500),),
      kSmallSpace,
      getBulletText("التواجد في بلد الإيفاد خلال مدة البرنامج."),
      getBulletText("أن يكون الطبيب خير ممثل لدولة الإمارات العربية المتحدة وأن ينقل صورة مشرفة عن دولته."),
      getBulletText("التواصل الدائم مع المكتب، والرد على أية استفسارات أو طلبات ترد من المرشد الأكاديمي."),
      getBulletText("اتباع كافة القوانين والنظم واللوائح المعمول بها في المستشفى التي يتدرب بها الطبيب."),
      getBulletText("التقيد التام بجميع التوجيهات الصادرة من قبل المكتب، والالتزام بقواعد وشروط الإيفاد، وعدم مخالفتها، واتباع التعليمات التي تشمل اختيار المستشفيات والتخصصات الطبية التي سيدرسها الطبيب."),
      getBulletText("يجب على المبتعث المحافظة على مستوى أداء متميز خلال فترة الابتعاث، وفي حال ضعف أداء المبتعث عن المستوى المتوقع سيتم عرضه إلى لجنة بعثة رئيس الدولة للأطباء المتميزين لاتخاذ الاجراءات."),
      getBulletText("يجب على المبتعث بعد استكمال الدراسة أن يستأنف مهامه الوظيفية في جهة عمله، أو أي جهة حكومية، لفترة زمنية تماثل فترة الابتعاث. عدم الامتثال لذلك سيغرم المبتعث بتسديد تكلفة المنحة الدراسية."),
      getBulletText("يجب على المبتعث تقديم كافة المستندات المطلوبة وشهادات المعادلة للمكتب عند الانتهاء من فترة الابتعاث."),
      getBulletText("الالتزام بضوابط قرار التحاقه بالبرنامج الدراسي ومن أهمها (الجامعة، المستشفى، البلد، التخصص، المدة الدراسية)."),
      getBulletText("الانتظام في الدراسة أو البرنامج، والحرص على تحصيل العلم والتدريب وبذل أقصى الجهود في الدراسة والأبحاث لما هو مطلوب، والالتزام التام بعدم الغياب."),
      kSmallSpace,
      Text('موافاة المكتب بنسخة من سجل العلامات الدراسية أو تقارير التقييم، موضحاً بها المعدلات التي حصل عليها، وأي تقرير علمي أو دراسي يطلبه المكتب.')
    ],
  );
}

getDdsMedicalLicenseTest(context) {
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      sectionTitle(title: 'اختبارات التراخيص الطبية')
    ],
  );
}

getDdsTrainingProgramForHealthProfessionals(context) {
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      sectionTitle(title: 'برنامج التدريب للمهن الصحية'),
      kSmallSpace,
      Text('يسعى "مكتب البعثات الدراسية" إلى إتاحة الفرصة أمام الكوادر الإماراتية في مجال المهن الصحية، لاستكمال التدريب السريري خارج الدولة، والحصول على شهادات في مختلف التخصّصات الصحية.'),
      kSmallSpace,
      subTitle('أهداف البرنامج:'),
      getBulletText("تلبية الاحتياجات المتزايدة للرعاية الصحية في المجتمع، عبر تخريج كوادر إماراتية مؤهلة وقادرة على تقديم الرعاية للمرضى بصورة مهنية وفعّالة."),
      getBulletText("تنمية القدرات والمهارات التقنية والمهنية للكوادر الإماراتية لمواكبة التطورات الحديثة في مجال الرعاية الصحية."),
      subTitle('مدة البرنامج:'),
      getBulletText("التمريض: سنتان كاملتان."),
      getBulletText("المهن المساندة: سنة كاملة."),
      kSmallSpace,
      subTitle('شروط الالتحاق بالبرنامج:'),
      getBulletText("أن يكون المتقدم من مواطني دولة الإمارات العربية المتحدة."),
      getBulletText("اجتياز اختبارات اللغة واختبارات التراخيص في بلد الابتعاث بالمعدلات المطلوبة."),
      getBulletText("الحصول على معدل لا يقل عن 2.5 للبكالوريوس و3.0 للماجستير."),
      getBulletText("الحصول على درجة لا تقل عن 6 في اختبار (IELTS)."),
      getBulletText("الحصول على قبول في برنامج تدريب إكلينيكي من إحدى الجامعات أو المستشفيات الدولية المعتمدة، يؤهله لنيل شهادة تخصصية."),
      getBulletText("الحصول على موافقة جهة العمل إذا كان موظفًا."),
      getBulletText("الحصول على تقييم أداء وظيفي لا يقلّ عن جيد."),
      getBulletText("اجتياز المقابلة الشخصية."),
      getBulletText("توقيع تعهد بالالتزام بجميع شروط ومعايير البرنامج."),
      getBulletText("تزويد المكتب بالمستندات المطلوبة."),
      kSmallSpace,
      subTitle('امتيازات البرنامج (خلال مدة التدريب):'),
      getBulletText("تقديم الدعم والإرشاد الأكاديمي."),
      getBulletText("تخصيص مكافأة مالية شهرية."),
      getBulletText("تغطية جميع الرسوم."),
      getBulletText("تقديم الإرشاد للالتحاق بدورات تحضيرية لـ\"اختبار الترخيص الطبي الأمريكي\"."),
      getBulletText("صرف بدل الكتب والمراجع."),
      getBulletText("صرف بدل تذاكر السفر مرة واحدة خلال السنة."),
      getBulletText("صرف بدل ما قبل السفر."),
      getBulletText("توفير التأمين الصحي."),
      kSmallSpace,
      subTitle('التزامات المبتعث:'),
      getBulletText("الانتظام في الدراسة والالتزام بالتدريب."),
      getBulletText("التواجد في بلد الابتعاث خلال مدة البرنامج."),
      getBulletText("تمثيل الدولة بصورة مشرفة."),
      getBulletText("التواصل مع المكتب، والالتزام بتعليمات المرشد الأكاديمي."),
      getBulletText("اتّباع القوانين والنُظم واللوائح المعمول بها في مقرّ التدريب."),
      getBulletText("الالتزام بتوجيهات المكتب وشروط الابتعاث، وتتضمّن اختيار المستشفيات والتخصّص."),
      getBulletText("المحافظة على مستوى أداء متميّز."),
      getBulletText("بعد استكمال التدريب؛ استئناف المهام الوظيفية في جهة العمل مدة زمنية تُماثل مدة الابتعاث."),
      getBulletText("تقديم جميع المستندات المطلوبة للمكتب بعد إتمام التدريب."),
      getBulletText("موافاة المكتب بنسخة عن تقارير التقييم السنوية."),
      kSmallSpace,
      subTitle('إرشادات القبول في البرنامج:'),
      getBulletText("اختيار أحد التخصّصات المعتمدة لدى المكتب."),
      getBulletText("التسجيل في اختبار الترخيص الطبي مبكرًا."),
      getBulletText("تقديم طلب التدريب في المستشفيات وفق المواعيد المحددة."),
      getBulletText("الاهتمام بكتابة السيرة الذاتية وخطابات التوصية."),
      getBulletText("المشاركة في الدراسات والبحوث."),
      getBulletText("استكمال المستندات قبل تقديم الطلب."),
      getBulletText("التحضير للمقابلة الشخصية في المنشأة المراد التدريب فيها."),
      getBulletText("التواصل مع المكتب بعد تقديم الطلب لتوفير الدعم والإرشاد."),
      kSmallSpace,
      subTitle('الوثائق والمستندات المطلوبة:'),
      getBulletText("صورة شخصية حديثة بالزي الوطني."),
      getBulletText("نسخة إلكترونية عن جواز السفر."),
      getBulletText("نسخة إلكترونية عن بطاقة الهوية."),
      getBulletText("نسخة إلكترونية عن بيانات أفراد الأسرة."),
      getBulletText("نسخة عن الشهادة الجامعية مع السجل الدراسي."),
      getBulletText("شهادة حسن السيرة والسلوك."),
      getBulletText("توقيع تعهد بالالتزام بشروط ومعايير الابتعاث."),
      kSmallSpace,
      subTitle('إجراءات التقديم على البرنامج:'),
      getBulletText("تقديم طلب عن طريق الموقع الإلكتروني لـ\"مكتب البعثات الدراسية\"."),
      getBulletText("تحميل المستندات والوثائق المطلوبة."),
      getBulletText("تحديد التخصص المطلوب."),
      kSmallSpace,
      Text('* يخضع التقديم على البعثة للشروط والأحكام، وتوفر المقاعد التدريبية.',style: TextStyle(color: AppColors.scoThemeColor),),
      kSmallSpace,
      kSmallSpace,
      subTitle('أسماء الجامعات والمستشفيات:'),
    ],
  );
}
