
import 'package:flutter/cupertino.dart';
import 'package:sco_v1/resources/widgets/subtitle_widget.dart';
import 'package:sco_v1/view/apply_scholarship/form_view_Utils.dart';
import 'package:sco_v1/view/main_view/scholarship_in_uae/bachelor_inside_uae/bachelor_inside_uae.dart';

import '../../../../resources/widgets/bullet_text_widget.dart';

getDoctorAboutTheProgramExternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [

      sectionTitle(title: "نبذه عن برنامج دكتور فى الطب"),
      kSmallSpace,
      const Text(
        '''في إطار حرص مكتب البعثات الدراسية بتوفير فرص الابتعاث في التخصصات الطبية المرموقة، يطرح المكتب برنامج “دكتور في الطب”
(Doctor of Medicine MD)  كأحد برامج الدراسات العليا المعتمدة.
يُعتبر برنامج دكتور في الطب درجة طبية متقدمة تُمنح من قبل كليات طبية عالمية مرموقة وتحظى باعتراف دولي واسع. في بعض الدول، مثل الولايات المتحدة وكندا، تُعد هذه الدرجة المؤهل الأساسي لممارسة مهنة الطب، مما يجعلها خطوة محورية في المسار المهني للأطباء. كما تفتح هذه الدرجة آفاقًا واسعة للتطور الوظيفي، وتوفر فرصًا متميزة للإقامة والتدريب في أرقى المستشفيات العالمية، مما يعزز كفاءة الأطباء ويؤهلهم لمستقبل مهني ناجح على المستوى الدولي.
يتطلب القبول في برنامج “دكتور في الطب” استيفاء مجموعة من الشروط الأكاديمية والمهنية، حيث يشترط حصول المتقدم على درجة البكالوريوس في تخصص ذي صلة، مثل العلوم الصحية أو الأحياء، بالإضافة إلى استيفاء المتطلبات المحددة من قبل الجامعات الطبية العالمية، والتي قد تشمل اجتياز اختبارات القبول مثل MCAT، وإثبات الكفاءة في اللغة الإنجليزية. كما أن القبول في هذا البرنامج يخضع لمعايير تنافسية، نظرًا لمحدودية المقاعد وتزايد الطلب على التخصص.'''
      )

    ]
  );
}
getDoctorTermsAndConditionsExternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [

      sectionTitle(title: "شروط ومتطلبات القبول فى البعثة"),
      kSmallSpace,
      const Text(
          '''
1. صور شخصية حديثة للطالب بالزي الوطني، وخلفية بيضاء، بصيغة (JPG) أو (PNG) (أبعاد الصورة 4.5 / 3.5).
2. صورة عن جواز سفر الطالب متضمّنة صفحة الرقم الموحّد.
3. صورة من بطاقة الهوية (من الجهتيْن).
4. خطاب موافقة مبدئية على الإيفاد من جهة العمل للمتقدمين للبعثات الخارجية فقط إذا كان المتقدّم للبعثة موظفًا على أن يتضمّن الخطاب البيانات الوظيفية للموظف (الاسم، الوظيفة، ....).
5. إفادة لا يعمل من الجهة المختصة للمتقدمين لبرنامج المنح الدراسية داخل الدولة.
6. السجل الدراسي للطلبة المنتظمين بالدراسة في الجامعة.
7. صورة مصدّقة عن شهادة البكالوريوس مع كشف الدرجات (في حال التقديم للماجستير).
8. صورة مصدّقة عن شهادة الماجستير مع كشف الدرجات (في حال التقديم للدكتوراه).
9. صورة عن شهادة المعادلة من وزارة التعليم العالي للطلبة الدارسين بجامعات خارج الدولة.
10. صورة من إفادة وزارة التربية والتعليم بالموافقة على البرنامج الدراسي حسب القبول الجامعي للطلبة المتقدمين للبعثات الخارجية.
11. صورة عن رسالة القبول الجامعي (القبول النهائي) من الجامعات والتخصصات المعتمدة لدى المكتب.
12. صورة عن نتائج الاختبارات المطلوبة للالتحاق بالدراسات العليا (إن وجدت).''')


    ]
  );
}
getDoctorAdmissionCriteriaExternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [

      sectionTitle(title: "معايير القبول في الجامعات العالمية"),
      kSmallSpace,
      getBulletText('الحصول على درجة بكالوريوس "ما قبل الطب" بتقدير "امتياز " في احدى التخصصات الصحية او الطبية مثل الهندسة طبية والحيوية أو العلوم الصحية أو علوم الأحياء الدقيقة أو علوم الأعصاب او غيرها من التخصصات ذو العلاقة'),
      getBulletText('اجتياز اختبار MCAT.'),
      getBulletText('الحصول على (7.0) فما فوق في اختبار الآيلتس او 9.0 في التوفل.'),
      getBulletText('اجتياز المقابلة الشخصية بنجاح مع الجامعة، وتعتبر من أهم معايير قبول الطلبة في الجامعة.'),
    ]
  );
}
getDoctorAccreditedUniversitiesExternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [

      sectionTitle(title: "الجامعات المعتمدة"),
      kSmallSpace,
    ]
  );
}