

import 'package:flutter/material.dart';
import 'package:sco_v1/view/apply_scholarship/form_view_Utils.dart';
import 'package:sco_v1/view/main_view/scholarship_in_uae/bachelor_inside_uae/bachelor_inside_uae.dart';

import '../../../../resources/app_colors.dart';
import '../../../../resources/widgets/widget.dart';


getBachelorTermsAndConditionsExternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
    sectionTitle(title: 'شروط ومتطلبات التقديم لبعثة صاحب السمو رئيس الدولة للطلبة المتميزين علميًا - درجة البكالوريوس'),
       const CustomRichText(spans: [
         TextSpan(text: '1. أن يكون المتقدّم للبعثة من مواطني دولة الإمارات العربية المتحدة.\n'),
         TextSpan(text: '2. أن يكون حسن السيرة والسلوك.\n'),
         TextSpan(text: '3. ألا يكون قد مضى على تخرّج الطالب من الصف الثاني عشر أو ما يعادلها مدة تزيد عن سنتين.\n'),
        TextSpan(
          children: [
             TextSpan(
              text:
              '4. أن يكون حاصلاً على نسبة مئوية، لا تقلّ عن ',
            ),
            TextSpan(
              text: '(90%)',
              style: TextStyle(color: Colors.red),
            ),
             TextSpan(
              text:
              ' في شهادة الصف الثاني عشر أو ما يعادلها، علمًا بأن هذه النسبة قابلة للتغيير من سنة إلى أخرى، تبعًا لمعطيات الميدان التربوي، مثل: معدلات نجاح طلبة الصف الثاني عشر، ودرجاتهم، ومؤشرات نتائج الثاني عشر، وقد كان شرط الحصول على البعثة الدراسية لخريجي الصف الثاني عشر بالأعوام السابقة، هو تحقيق نسبة ',
            ),
            TextSpan(
              text: '(98%)',
              style: TextStyle(color: Colors.red),
            ),
             TextSpan(text: ' فأعلى.\n'),
          ],
        ),
         TextSpan(text: '5. ألا يكون قد سبق إيفاده على بعثة دراسية أخرى أو انتهت بعثته بالإلغاء.\n'),
         TextSpan(text: '6. أن يكون حاصلاً على القبول من إحدى الجامعات المُعترف بها من المكتب، والواردة في قائمة الجامعات في الموقع الإلكتروني للمكتب.\n'),
         TextSpan(text: '7. أن يجتاز الطالب المقابلة الشخصية مع مجلس الإدارة بنجاح.\n'),
         TextSpan(text: '8. أن يتعهّد الطالب بالالتزام باللوائح والأنظمة والتعليمات الصادرة عن السلطة المختصة، طبقًا لأحكام البعثة.\n'),
         TextSpan(text: '9. أن يلتزم الطالب بالتخصّص والدراسة في الجامعة وفق البعثة الدراسية التي حصل عليها، وألا يغيّر تخصصه أو جامعته إلا بموافقة خطية من المكتب.\n'),
         TextSpan(text: '10. ألا يكون حاصلاً على بعثة دراسية من جهة أخرى.'),
      ]),
       const Text('11. الحصول على الدرجات والشروط العامة المطلوبة كما هو موضح في الجدول أدناه:'),
      getBulletText('الحصول على الدرجة المطلوبة في إحدى الاختبارات المعيارية للغة الإنجليزية (الآيلتس او التوفل).',squareBullet: true),
      getBulletText('''الحصول على الدرجة المطلوبة للاختبار المعياري الرياضيات (سات SAT ) أو ما يعادله للطلبة الملتحقين في الدراسة بالمنهاج (الخاص الأجنبي).''',squareBullet: true),
      getBulletText(''' الحصول على الدرجة المطلوبة في المواد الدراسية العلمية للصف الثاني عشر، وذلك حسب التخصص المراد دراسته المرتبط مباشرة بالتخصص كالأتي:''',squareBullet: true),
      getBulletText('''بالنسبة للطلبة المتقدمين لتخصص (الطب والعلوم الصحية): الحصول على النسبة المطلوبة أو ما يعادلها في الصف الثاني عشر في مادتين من المواد العلمية (الأحياء أو الكيمياء أو الفيزياء).'''),
      getBulletText('''بالنسبة للطلبة المتقدمين لتخصص (الهندسة): الحصول على النسبة المطلوبة أو ما يعادلها في الصف الثاني عشر في المواد العلمية (الفيزياء) ومادة واحدة من المواد العلمية (الاحياء أو الكيمياء أو الكمبيوتر).'''),
      getBulletText('''بالنسبة للطلبة المتقدمين لتخصص (علوم الحاسوب): الحصول على النسبة المطلوبة أو ما يعادلها في الصف الثاني عشر في المواد العلمية (الفيزياء والكمبيوتر).'''),
      getBulletText('''بالنسبة للطلبة المتقدمين لتخصص (العلوم): الحصول على النسبة المطلوبة أو ما يعادلها في الصف الثاني عشر في مادة واحدة من المواد العلمية المرتبطة بالتخصص (الأحياء أو الكيمياء أو الفيزياء).'''),
      getBulletText('''بالنسبة للطلبة المتقدمين لتخصص (العلوم الاجتماعية والإدارية والقانون والعلوم الإنسانية والرياضيات والاحصاء والعلوم الاكتوارية): الحصول على النسبة المطلوبة أو ما يعادلها في الصف الثاني عشر في (مادة الرياضيات).'''),
      getBulletText('''الحصول على قبول جامعي من إحدى الجامعات والتخصصات المعتمدة لدى المكتب، وتعطى الأولوية للطلبة الحاصلين على علامات متميزة.''',squareBullet: true),
       const TappableImage(imagePath: "https://sco.ae/documents/20126/51507/UGRDEXT25.png/a1446b96-9c14-e524-f88a-50ad1407a626?t=1735876079409"),
      subTitle('''شروط إضافية لطلبة الجامعات (الراغبين بالتحويل للبعثة):'''),
      getBulletText('''ألاَ يتجاوز الطالب العام الثاني من دراسته الجامعية.''', squareBullet: true),
      getBulletText('''ألاَ يقل معدّل الطالب التراكمي عن (3.5) من (4.0) حسب نظام احتساب الدرجات في الجامعات الأمريكية لبعثة صاحب السمو رئيس الدولة للطلبة المتميزين علميًا.''', squareBullet: true),
      getBulletText('''أن يكون الطالب ملتحقًا أو حاصلاً على قبول جامعي من إحدى الجامعات المتميزة والمعتمدة من مكتب البعثات الدراسية.''', squareBullet: true),
      subTitle('''عملية اختيار الطلبة'''),
      getBulletText('''عدد المقاعد محدودة للطلبة، واستيفاء الطالب للشروط لا يعني القبول، وإنما يخضع لأسس ومعايير التنافس المعتمدة لدى المكتب للطلبة النخبة والمتميزين.''', squareBullet: true),
      getBulletText('''تعتبر الشروط المذكورة الحد الأدنى المطلوب للتأهل لتقديم طلب البعثة الدراسية.''', squareBullet: true),
      getBulletText('''يتم اختيار المتقدمين بناء على عملية تفاضلية تأخذ في الاعتبار مجموعة متنوعة من العوامل، تشمل الأداء الأكاديمي السابق للمتقدم في الصف العاشر والحادي عشر ونسبة الفصل الأول والنهائي للصف الثاني عشر، الاختبارات القياسية والمركزية، القبول الجامعي، واجتياز المقابلة الشخصية.''', squareBullet: true),
    ],
  );
}
getBachelorApprovedUniversitiesExternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      sectionTitle(title: "قائمة الجامعات المعتمدة لدى المكتب - درجة البكالوريوس - خارج الدولة"),
    ],
  );
}
getBachelorApprovedMajorsExternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      sectionTitle(title: "قائمة التخصّصات المعتمدة لدى المكتب - درجة البكالوريوس - خارج الدولة"),
    ],
  );
}
getBachelorScholarshipPrivilegesExternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      sectionTitle(title: "امتيازات بعثة صاحب السمو رئيس الدولة للطلبة المتميزين علميًا - درجة البكالوريوس"),
      kSmallSpace,
      subTitle("النفقات الدراسية التي يتحمّلها مكتب البعثات الدراسية:"),
      kMinorSpace,
      const CustomRichText(spans: [
        
          TextSpan(text: '1. راتب شهري مجزي للطالب.\n'),
          TextSpan(text: '2. الرسوم الدراسية السنوية.\n'),
          TextSpan(text: '3. رسوم الكتب الدراسية.\n'),
          TextSpan(text: '4. بدل تذكرة سفر بالطائرة ذهاباً وإياباً مرتين سنوياً، من دولة الإمارات العربية المتحدة إلي بلد الإيفاد.\n'),
          TextSpan(text: '5. توفير التأمين الصحي للطالب الموفد.\n'),
          TextSpan(text: '6. تقديم مكافآت تشجيعية للطلبة الذين يظهرون تميزًا أكاديميًا.\n'),
          TextSpan(text: '7. بدل نقدي للاستعداد للسفر.\n'),
        TextSpan(
          children: [
            TextSpan(text: '8. بدل تذكرة سفر وبدل نقدي لمدة '),
            TextSpan(
              text: '45',
              style: TextStyle(color: Colors.red),
            ),
            TextSpan(text: ' يوما لمرافق الطالبة وذوي الهمم.\n'),
          ],
        ),
          TextSpan(
            children: [
              TextSpan(text: '9. يحصل الطالب على مكافأة التخرج وتساوي '),
              TextSpan(
                text: '(15%)',
                style: TextStyle(color: Colors.red),
              ),
              TextSpan(text: ' من إجمالي المخصصات الشهرية التي يحصل عليها طوال فترة الدراسة.'),
            ],
          ),
        
      ]),
      kSmallSpace,
      subTitle("إذا كان الطالب متزوجاً:"),
      kMinorSpace,
      const CustomRichText(spans: [
        TextSpan(
          text: '\nيمنح الامتيازات الآتية بالإضافة إلى ما تقدّم، بشرط اصطحاب الزوجة أو الزوج والأبناء المُعاليين مرتين سنوياً.\n',
        ),
        TextSpan(
          text: '1. بدل تذكرة سفر سنوية بالدرجة السياحية ذهابًا وإيابًا للزوجة أو الزوج والأبناء المُعاليين مرتين سنوياً.\n',
        ),
        TextSpan(
          text: '2. رسوم نفقات دراسة الأبناء في بلد الإيفاء على أن تتراوح أعمارهم بين 4 إلى 18 سنة.\n',
        ),
        TextSpan(
          text: '3. نفقة التأمين الصحي ونفقات العلاج للزوجة أو الزوج والأبناء.\n',
        ),
        TextSpan(
          text: '4. صرف علاوة المتزوج للطالب على الراتب الشهري.\n',
        ),

      ])


    ],
  );
}
getBachelorStudentObligationsExternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      sectionTitle(title: "التزامات الطالب لبعثة صاحب السمو رئيس الدولة للطلبة المتميزين علميًا - درجة البكالوريوس"),
      kSmallSpace,
      subTitle("التزامات الطالب الموفد:"),
      kMinorSpace,
      getBulletText("التقيّد بأنظمة الإشراف العلمي والإداري والمتابعة الأكاديمية، وجميع التوجيهات الصادرة إليه، فيما يتعلّق بمسار البرنامج الدراسي من الجانب الأكاديمي، وحتى انتهاء دراسته."),
      getBulletText("الالتزام بضوابط قرار التحاقه بالبرنامج الدراسي ومن أهمّها (الجامعة، البلد، التخصّص، المدة الدراسية، إلخ)."),
      getBulletText("الانتظام في الدراسة والاهتمام بمتابعة الدروس، وعدم التغيب عن الحصص الدراسية حسب نظام الحضور والانصراف المعمول به في الجامعة."),
      getBulletText("موافاة المكتب بنسخة من السجل الدراسي وأي تقرير علمي أو دراسي يطلبه المكتب بشكل دوري."),
      getBulletText("الالتزام بالتسجيل بالعدد المقرر من الساعات الدراسية لكلّ فصل دراسي."),
      getBulletText("التعهّد بعدم المطالبة بأيّ تعويضات ونحوها أيا كانت صفتها أو نوعها، في حال صدور قرار التحاقه بالبرنامج الدراسي الذي سبقت الموافقة عليه، أيًّا كان سبب الإلغاء وفي أيّ حال كان عليه."),
      getBulletText("الالتزام بقيم ومبادئ الأخلاق الفاضلة، وأن يكون حسن السيرة والسلوك، وأن يحترم قوانين الدولة الموفد إليها، كما يتجنّب إتيان بأيّ سلوك يخلّ باعتبارات الشرف والأمانة ويسيء إليه أو إلى سمعة الدولة."),
      getBulletText("عدم الزواج من أجنبية/أجنبي طيلة فترة الدراسة وحتى تخرّجه من الجامعة."),
      getBulletText("يجب على الطالب تزويد وتحديث بياناته الشخصية (أرقام الهواتف، البريد الإلكتروني، عنوان السكن في بلد الإيفاد، رقم وليّ الأمر، جواز السفر، تأشيرة السفر وبطاقة الهوية) وبشكل دوري."),
      getBulletText("يجب على الطالب التواصل الدائم مع المرشد الأكاديمي والمرشد الإجتماعي بالمكتب."),
      getBulletText("عدم مغادرة مقر الجامعة في أيّ حال من الأحوال إلا في الأوقات المحدّدة لذلك، وبموافقة مسبقة من المكتب."),

    ],
  );
}
getBachelorApplyingProcedureExternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      sectionTitle(title: "إجراءات التقديم لبعثة صاحب السمو رئيس الدولة للطلبة المتميزين علميًا - درجة البكالوريوس"),
      kSmallSpace,
      subTitle("يجب على الطالب الراغب بالتقديم للبعثة والمستوفي للشروط كافة اتباع الإجراءات الآتية:",AppColors.scoButtonColor),
      kMinorSpace,
      subTitle("أولاً:"),
      kMinorSpace,
      const Text(
          '''
1. تجهيز جميع الوثائق المطلوبة وعمل نسخة رقمية للمستندات والوثائق الآتية:
2. صورة شخصية حديثة للطالب بالزيّ الوطني، وخلفية بيضاء، بصيغة JPG أو PNG (أبعاد الصورة 4.5 / 3.5).
3. صورة عن جواز سفر الطالب متضمّنة صفحة الرقم الموحّد.
4. صورة عن جواز سفر وليّ أمر الطالب متضمّنة صفحة الرقم الموحّد.
5. صورة عن بطاقة الهوية من الجهتيْن.
6. صورة عن خلاصة القيد كاملة.
7. صورة مصدّقة عن الشهادة النهائية للصف العاشر.
8. صورة مصدّقة عن الشهادة النهائية للصف الحادي عشر.
9. صورة مصدّقة عن شهادة الفصل الدراسي الأول للصف الثاني عشر (في حال التقديم للبعثة بعد ظهور درجات الفصل الدراسي الأول).
10. صورة مصدّقة عن شهادة الفصل الدراسي الثاني للصف الثاني عشر (في حال التقديم للبعثة بعد ظهور درجات الفصل الدراسي الثاني).
11. صورة مصدّقة عن الشهادة النهائية للصف الثاني عشر (في حال التقديم بعد ظهور الدرجات النهائية).
12. تقرير درجات اختبار الإمسات أوالتوفل أو الآيلتس والقبول الجامعي إن وجد.
13. تقرير درجات إمتحان السات 1.
14. السجل الدراسي للطلبة المُنتظمين بالدراسة في الجامعة.'''),
      kSmallSpace,
      subTitle("ثانياً:"),
      kMinorSpace,
      getBulletText("تعبئة طلب التقديم عن طريق الدخول إلى الموقع الإلكتروني."),
      kSmallSpace,
      subTitle("ثالثاُ:"),
      kMinorSpace,
      getBulletText("تحميل المستندات والوثائق بعد تعبئة الطلب واتباع الإرشادات الخاصة بتحميل المرفقات."),
      kSmallSpace,
      subTitle("ملاحظات:"),
      kMinorSpace,
      getBulletText("لا تقبل الطلبات التي ترسل عن طريق الفاكس أو تسلم باليد."),
      getBulletText("يرجى الاتصال بمكتب البعثات الدراسية لطلب المساعدة في حال واجهتكم أيّ صعوبات خلال عملية التقديم عن طريق الموقع (اتصل بنا)."),
      getBulletText("يتم استقبال الطلبات خلال فترات التقديم المعتمدة، والتي تظهر في صفحة التقديم الإلكتروني على الموقع الإلكتروني للمكتب."),
    ],
  );
}

