

import 'package:flutter/material.dart';
import 'package:sco_v1/view/apply_scholarship/form_view_Utils.dart';

import '../../../../resources/widgets/widget.dart';


getTermsAndConditions(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
    sectionTitle(title: 'شروط ومتطلبات التقديم لبعثة صاحب السمو رئيس الدولة للطلبة المتميزين علميًا - درجة البكالوريوس'),
      const Text('1. أن يكون المتقدّم للبعثة من مواطني دولة الإمارات العربية المتحدة.'),
      const Text('2. أن يكون حسن السيرة والسلوك.'),
      const Text('3. ألا يكون قد مضى على تخرّج الطالب من الصف الثاني عشر أو ما يعادلها مدة تزيد عن سنتين.'),
      const Text('4. أن يكون حاصلاً على نسبة مئوية، لا تقلّ عن (90%) في شهادة الصف الثاني عشر أو ما يعادلها، علمًا بأن هذه النسبة قابلة للتغيير من سنة إلى أخرى، تبعًا لمعطيات الميدان التربوي، مثل: معدلات نجاح طلبة الصف الثاني عشر، ودرجاتهم، ومؤشرات نتائج الثاني عشر، وقد كان شرط الحصول على البعثة الدراسية لخريجي الصف الثاني عشر بالأعوام السابقة، هو تحقيق نسبة (98%) فأعلى.'),
      const Text('5. ألا يكون قد سبق إيفاده على بعثة دراسية أخرى أو انتهت بعثته بالإلغاء.'),
      const Text('6. أن يكون حاصلاً على القبول من إحدى الجامعات المُعترف بها من المكتب، والواردة في قائمة الجامعات في الموقع الإلكتروني للمكتب.'),
      const Text('7. أن يجتاز الطالب المقابلة الشخصية مع مجلس الإدارة بنجاح.'),
      const Text('8. أن يتعهّد الطالب بالالتزام باللوائح والأنظمة والتعليمات الصادرة عن السلطة المختصة، طبقًا لأحكام البعثة.'),
      const Text('9. أن يلتزم الطالب بالتخصّص والدراسة في الجامعة وفق البعثة الدراسية التي حصل عليها، وألا يغيّر تخصصه أو جامعته إلا بموافقة خطية من المكتب.'),
      const Text('10. ألا يكون حاصلاً على بعثة دراسية من جهة أخرى.'),
      const Text('11. الحصول على الدرجات والشروط العامة المطلوبة كما هو موضح في الجدول أدناه:'),
      getBulletText('الحصول على الدرجة المطلوبة في إحدى الاختبارات المعيارية للغة الإنجليزية (الآيلتس او التوفل).',squareBullet: true),
      getBulletText('''الحصول على الدرجة المطلوبة للاختبار المعياري الرياضيات (سات SAT ) أو ما يعادله للطلبة الملتحقين في الدراسة بالمنهاج (الخاص الأجنبي).''',squareBullet: true),
      getBulletText(''' الحصول على الدرجة المطلوبة في المواد الدراسية العلمية للصف الثاني عشر، وذلك حسب التخصص المراد دراسته المرتبط مباشرة بالتخصص كالأتي:''',squareBullet: true),
      getBulletText('''بالنسبة للطلبة المتقدمين لتخصص (الطب والعلوم الصحية): الحصول على النسبة المطلوبة أو ما يعادلها في الصف الثاني عشر في مادتين من المواد العلمية (الأحياء أو الكيمياء أو الفيزياء).'''),
      getBulletText('''بالنسبة للطلبة المتقدمين لتخصص (الهندسة): الحصول على النسبة المطلوبة أو ما يعادلها في الصف الثاني عشر في المواد العلمية (الفيزياء) ومادة واحدة من المواد العلمية (الاحياء أو الكيمياء أو الكمبيوتر).'''),
      getBulletText('''بالنسبة للطلبة المتقدمين لتخصص (علوم الحاسوب): الحصول على النسبة المطلوبة أو ما يعادلها في الصف الثاني عشر في المواد العلمية (الفيزياء والكمبيوتر).'''),
      getBulletText('''بالنسبة للطلبة المتقدمين لتخصص (العلوم): الحصول على النسبة المطلوبة أو ما يعادلها في الصف الثاني عشر في مادة واحدة من المواد العلمية المرتبطة بالتخصص (الأحياء أو الكيمياء أو الفيزياء).'''),
      getBulletText('''بالنسبة للطلبة المتقدمين لتخصص (العلوم الاجتماعية والإدارية والقانون والعلوم الإنسانية والرياضيات والاحصاء والعلوم الاكتوارية): الحصول على النسبة المطلوبة أو ما يعادلها في الصف الثاني عشر في (مادة الرياضيات).'''),
      getBulletText('''الحصول على قبول جامعي من إحدى الجامعات والتخصصات المعتمدة لدى المكتب، وتعطى الأولوية للطلبة الحاصلين على علامات متميزة.''',squareBullet: true),
      GestureDetector(
        onTap: () {
          Navigator.push(
            context,
            MaterialPageRoute(
              builder: (_) => const FullScreenImagePage(
                imagePath: 'https://sco.ae/documents/20126/51507/UGRDEXT25.png/a1446b96-9c14-e524-f88a-50ad1407a626?t=1735876079409',
              ),
            ),
          );
        },
        child: Image.network(
          'https://sco.ae/documents/20126/51507/UGRDEXT25.png/a1446b96-9c14-e524-f88a-50ad1407a626?t=1735876079409',
          fit: BoxFit.cover,
        ),
      ),
      subTitle('''شروط إضافية لطلبة الجامعات (الراغبين بالتحويل للبعثة):'''),
      getBulletText('''ألاَ يتجاوز الطالب العام الثاني من دراسته الجامعية.''', squareBullet: true),
      getBulletText('''ألاَ يقل معدّل الطالب التراكمي عن (3.5) من (4.0) حسب نظام احتساب الدرجات في الجامعات الأمريكية لبعثة صاحب السمو رئيس الدولة للطلبة المتميزين علميًا.''', squareBullet: true),
      getBulletText('''أن يكون الطالب ملتحقًا أو حاصلاً على قبول جامعي من إحدى الجامعات المتميزة والمعتمدة من مكتب البعثات الدراسية.''', squareBullet: true),
      subTitle('''عملية اختيار الطلبة'''),
      getBulletText('''عدد المقاعد محدودة للطلبة، واستيفاء الطالب للشروط لا يعني القبول، وإنما يخضع لأسس ومعايير التنافس المعتمدة لدى المكتب للطلبة النخبة والمتميزين.''', squareBullet: true),
      getBulletText('''تعتبر الشروط المذكورة الحد الأدنى المطلوب للتأهل لتقديم طلب البعثة الدراسية.''', squareBullet: true),
      getBulletText('''يتم اختيار المتقدمين بناء على عملية تفاضلية تأخذ في الاعتبار مجموعة متنوعة من العوامل، تشمل الأداء الأكاديمي السابق للمتقدم في الصف العاشر والحادي عشر ونسبة الفصل الأول والنهائي للصف الثاني عشر، الاختبارات القياسية والمركزية، القبول الجامعي، واجتياز المقابلة الشخصية.''', squareBullet: true),
    ],
  );
}





