


import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

import '../../../apply_scholarship/form_view_Utils.dart';
import '../../../../resources/widgets/widget.dart';


getBachelorTermsAndConditionsInternal(context){
  return  Column(
      crossAxisAlignment: CrossAxisAlignment.start,
      children: [
      sectionTitle(title: 'شروط ومتطلبات التقديم لبرنامج المنح الدراسية - درجة البكالوريوس'),
        Text(
          '''1. أن يكون المتقدّم للمنحة الدراسية من مواطني دولة الإمارات العربية المتحدة.
2. أن يكون حسن السيرة والسلوك.
3. ألا يكون قد مضى على تخرّج الطالب من الصف الثاني عشر أو ما يعادلها مدة تزيد عن سنتيْن.
4. أن يكون حاصلاً على نسبة مئوية، لا تقلّ عن (90%) في شهادة الصف الثاني عشر أو ما يعادلها، علمًا بأن هذه النسبة قابلة للتغيير من سنة إلى أخرى، تبعًا لمعطيات الميدان التربوي، مثل: معدلات نجاح طلبة الصف الثاني عشر، ودرجاتهم، ومؤشرات نتائج الصف الثاني عشر، وقد كان شرط الحصول على المنحة الدراسية لخريجي الصف الثاني عشر بالأعوام السابقة، هو تحقيق نسبة (98%) فأعلى.
5. أن يكون حاصلاً على القبول من إحدى الجامعات المُعترف بها من المكتب، والواردة في قائمة الجامعات في الموقع الإلكتروني للمكتب.
6. أن يجتاز الطالب المقابلة الشخصية مع مجلس الإدارة بنجاح.
7. أن يتعهّد الطالب بالالتزام باللوائح والأنظمة والتعليمات الصادرة عن السلطة المُختصة، طبقًا لأحكام المنحة.
8. أن يلتزم الطالب بالتخصّص والدراسة في الجامعة وفق المنحة الدراسية التي حصل عليها، وألّا يُغيّر تخصّصه أو جامعته إلّا بموافقة خطية من المكتب.
9. ألا يكون حاصلاً على منحة أو مساعدة دراسية من أيّ جهة أخرى.
10. ألا يكون موظفًا.
11. بالنسبة للطالب الملتحق في الدرجة الجامعية الأولى (البكالوريوس)، أن يكون حاصلاً على معدّل تراكمي لا يقلّ عن (2.80) من أصل (4.00)، أو ما يعادله حسب نُظم الجامعات، ممن أنهى الفصل الدراسي الأول من إحدى الجامعات المعتمدة في المكتب.
12. الحصول على الدرجات والشروط العامة المطلوبة كما هو موضح في الجدول أدناه.''',
        ),

        getBulletText('الحصول على الدرجة المطلوبة في إحدى الاختبارات المعيارية للغة الإنجليزية (الآيلتس او التوفل).', squareBullet: true),
        getBulletText('الحصول على الدرجة المطلوبة للاختبار المعياري الرياضيات (سات SAT) أو ما يعادله للطلبة الملتحقين في الدراسة بالمنهاج (الخاص الأجنبي).', squareBullet: true),
        getBulletText('الحصول على الدرجة المطلوبة في المواد الدراسية العلمية للصف الثاني عشر، وذلك حسب التخصص المراد دراسته المرتبط مباشرة بالتخصص كالأتي:', squareBullet: true),
        getBulletText('''بالنسبة للطلبة المتقدمين لتخصص (الطب والعلوم الصحية): الحصول على النسبة المطلوبة أو ما يعادلها في الصف الثاني عشر في مادتين من المواد العلمية (الأحياء أو الكيمياء أو الفيزياء).''', squareBullet: true),
        getBulletText('''بالنسبة للطلبة المتقدمين لتخصص (الهندسة): الحصول على النسبة المطلوبة أو ما يعادلها في الصف الثاني عشر في المواد العلمية (الفيزياء) ومادة واحدة من المواد العلمية (الاحياء أو الكيمياء أو الكمبيوتر).''', squareBullet: true),
        getBulletText('''بالنسبة للطلبة المتقدمين لتخصص (علوم الحاسوب): الحصول على النسبة المطلوبة أو ما يعادلها في الصف الثاني عشر في المواد العلمية (الفيزياء والكمبيوتر).''', squareBullet: true),
        getBulletText('''بالنسبة للطلبة المتقدمين لتخصص (العلوم): الحصول على النسبة المطلوبة أو ما يعادلها في الصف الثاني عشر في مادة واحدة من المواد العلمية المرتبطة بالتخصص (الأحياء أو الكيمياء أو الفيزياء).''', squareBullet: true),
        getBulletText('''بالنسبة للطلبة المتقدمين لتخصص (العلوم الاجتماعية والإدارية والقانون والعلوم الإنسانية والرياضيات والاحصاء والعلوم الاكتوارية): الحصول على النسبة المطلوبة أو ما يعادلها في الصف الثاني عشر في (مادة الرياضيات).''', squareBullet: true),
        getBulletText('''الحصول على قبول جامعي من إحدى الجامعات والتخصصات المعتمدة لدى المكتب، وتعطى الأولوية للطلبة الحاصلين على علامات متميزة.''', squareBullet: true),

        GestureDetector(
          onTap: () {
            Navigator.push(
              context,
              MaterialPageRoute(
                builder: (_) => const FullScreenImagePage(
                  imageUrl: 'https://sco.ae/documents/20126/51507/UGRDINT25.png/407cde8e-a99e-a202-c34f-6b57607ebdcb?t=1735876079602',
                ),
              ),
            );
          },
          child: Image.network(
              'https://sco.ae/documents/20126/51507/UGRDINT25.png/407cde8e-a99e-a202-c34f-6b57607ebdcb?t=1735876079602'   ,
            fit: BoxFit.cover,
          ),
        ),

        subTitle('عملية اختيار الطلبة:'),
        getBulletText('''عدد المقاعد محدودة للطلبة، واستيفاء الطالب للشروط لا يعني القبول، وإنما يخضع لأسس ومعايير التنافس المعتمدة لدى المكتب للطلبة النخبة والمتميزين.''', squareBullet: true),
        getBulletText('''تعتبر الشروط المذكورة الحد الأدنى المطلوب للتأهل لتقديم طلب المنحة الدراسية.''', squareBullet: true),
        getBulletText('''يتم اختيار المتقدمين بناء على عملية تفاضلية تأخذ في الاعتبار مجموعة متنوعة من العوامل، تشمل الأداء الأكاديمي السابق للمتقدم في الصف العاشر والحادي عشر ونسبة الفصل الأول والنهائي للصف الثاني عشر، الاختبارات القياسية والمركزية، القبول الجامعي، واجتياز المقابلة الشخصية.''', squareBullet: true),










      ]);
}