



import 'package:flutter/material.dart';
import 'package:sco_v1/resources/widgets/bullet_text_widget.dart';
import 'package:sco_v1/resources/widgets/subtitle_widget.dart';
import 'package:sco_v1/view/apply_scholarship/form_view_Utils.dart';
import 'package:sco_v1/view/main_view/scholarship_in_uae/bachelor_inside_uae/bachelor_inside_uae.dart';

import '../../../../resources/app_colors.dart';

getGraduateTermsAndConditionsInternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      sectionTitle(title: "شروط ومتطلبات التقديم لبرنامج المنح الدراسية (داخل الدولة) - الدراسات العليا"),
      const Text('''
1. أن يكون مواطنًا، أو من أبناء المواطنات.
2. الحصول على الدرجات الآتية:'''),
      const Text(
        '''
(الشهادة / نوع البعثة): برنامج المنح الدراسية
- الماجستير
- البكالوريوس: المعدل 3.4 من أصل 4.0
- الدكتوراه
- الماجستير: المعدل 3.7 من أصل 4.0''',),
      kMinorSpace,
      const CustomRichText(spans: [

        TextSpan(
          text: "3. إجتياز اختبار اللغة الإنجليزية: الأيلتس:"
        ),
        TextSpan(
          text: ' 6.5 ',
          style: TextStyle(color: Colors.red)
        )
      ]),
      const Text(
          '''
4. أن يكون حاصلاً على القبول من إحدى الجامعات المُعترف بها من المكتب، والواردة في قائمة الجامعات على الموقع الإلكتروني للمكتب.
5. أن تكون الدراسة داخل الدولة.
6. ألّا يكون موظفًا.
7. أن يجتاز الطالب المُقابلة الشخصية.
8. ألّا يكون حاصلاً على منحة دراسية أو مساعدة دراسية من أيّ جهة أخرى.
'''
      ),
      kMinorSpace,
      subTitle("بالنسبة للطلبة الملتحقين بالدراسة، أن يكون المتقدم ملتحقاً بالدراسة في السنة الجامعية الأولى."),
    ],
  );
}
getGraduateUniversityAndMajorsInternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      sectionTitle(title: "قائمة الجامعات والتخصصات المعتمدة"),
    ],
  );
}
getGraduateUniversityAndSpecializationsInternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      sectionTitle(title: "قائمة الجامعات المعتمدة لدى المكتب - دراسات عليا - داخل الدولة"),
    ],
  );
}
getGraduateApprovedSpecializationInternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      sectionTitle(title: "قائمة التخصّصات المعتمدة لدى المكتب - دراسات عليا - داخل الدولة"),
    ],
  );
}
getGraduateScholarshipPrivilegesInternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      sectionTitle(title: "امتيازات برنامج المنح الدراسية (داخل الدولة) - الدراسات العليا"),
      kSmallSpace,
      subTitle("النفقات الدراسية التي يتحمّلها مكتب البعثات الدراسية:"),
      kMinorSpace,
      const Text('''
1. الرسوم الدراسية السنوية.
2. رسوم الكتب الدراسية.
3. كُلفة السكن المُشترك.
4. رسوم المواصلات (في حال توفير الجامعة للمواصلات).
5. المكافأة الشهرية.
6. لا تُغطّي المنحة رسوم الأنشطة الطلابية والحاسب الآلي المحمول.'''),
      kSmallSpace,
      subTitle("الحوافز التشجيعية:"),
      kMinorSpace,
     const  CustomRichText(spans: [
        TextSpan(
          text: "1. يحصل الطالب المُتميّز في نهاية كلّ فصل دراسي على رسالة تقدير في حال حصوله على مُعدّل تراكمي "
        ),
        TextSpan(text: " (3.50) ",style: TextStyle(color: AppColors.scoThemeColor)),
        TextSpan(text: " فأعلى.")
      ]),
      const  CustomRichText(spans: [
        TextSpan(
            text: "2. يحصل الطالب المتميّز في نهاية السنة الأكاديمية على رسالة تقدير ومكافأة تشجيعية في حال حصوله على مُعدّل تراكمي"
        ),
        TextSpan(text: " (3.80) ",style: TextStyle(color: AppColors.scoThemeColor)),
        TextSpan(text: " فأعلى.")
      ]),
    ],
  );
}
getGraduateStudentObligationsInternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      sectionTitle(title: "التزامات الطالب لبرنامج المنح الدراسية (داخل الدولة) - الدراسات العليا"),
      kSmallSpace,
      subTitle("التزامات الطالب:"),
      kMinorSpace,
      const Text(
          '''
1. الالتزام بالقيم ومبادئ الأخلاق الفاضلة، وأن يكون حسن السيرة والسلوك، والابتعاد عن أيّ تصرّف يخلّ باعتبارات الشرف والأمانة وسُمعة المكتب.
2. عدم تغيير الجامعة التي يدرس فيها أو التخصّص العلمي المُحدّد له، إلّا بعد الحصول على إذن كتابي مُسبق من المكتب.
3. التقيّد بأنظمة الإشراف العلمي والإداري والمُتابعة الأكاديمية، وجميع التوجيهات الصادرة إليه فيما يتعلّق بمساره الدراسي من الجانب الأكاديمي، حتى الحصول على الدرجة العلمية المطلوبة.
4. اجتياز اختبارات القبول المطلوبة كافّة في الجامعات.
5. الانتظام في الدراسة والجدّية، والحرص على تحصيل العلم، وبذل أقصى جهد في دراسته وأبحاثه للحصول على الدرجة العلمية المُقرّرة في المدّة المُحدّدة.
6. الإيعاز للجامعة أو الكلية بموافاة المكتب بنسخة من سجلّ العلامات الدراسية والمُعدّل التراكمي، موضَحة فيها الدرجات التي حصل عليها في كلّ مساق أو مادة، والمُعدّل العام، وأيّ تقرير علمي أو دراسي آخر يطلبه المكتب.
7. ألّا تقل عدد الساعات المُسجّلة في الفصل الدراسي الواحد عن (3) مواد في الفصل الدراسي الواحد بالنسبة لطلبة الدراسات العليا، أو وفق النظام المعمول به في الجامعة.
8. الالتزام بمّدة الدراسة المُحدّدة، وهي سنتان (2) لدرجة الماجستير و(4) سنوات لدرجة الدكتوراة، ما لم تكن مدّة الدراسة المُحدّدة من الجامعة تزيد على ذلك.
9. ألّا يقل المعدل التراكمي عن (3.00) من (4.00) في كلّ فصل دراسي لطلبة الدراسات العليا، أو ما يُعادله حسب نظم الجامعات.
10. الالتزام بنظام الحضور والغياب في الجامعة/الكلية، ما لم يكن لديه عذر طارئ أو قهري، يقبله المكتب.
11. إخطار المكتب بأيّ عائق أو مشكلة أو ظروف قد تحول بينه وبين مُتابعة الدراسة على النحو المطلوب، سواءً كانت خاضعةً لإرادته أو خارجةً عنها.
12. التعهّد بالالتزام باللوائح والأنظمة والتعليمات كافّة.
13. الالتزام بسداد قيمة الفصل الدراسي الذي يقوم بالانسحاب منه دون موافقة المكتب.
14. للمكتب الحقّ في إلغاء المنحة الدراسية المُقدّمة للطالب دون أن يكون له حقّ المطالبة بأيّ تعويض.
15. يلتزم الطالب بسداد قيمة المادة الدراسية المُسجّلة في الفصل الدراسي في الحالات الآتية:
    ‌أ- سحب هذه المادة الدراسية بعد انتهاء فترة السحب والإضافة المُحدّدة من المكتب.
    ‌ب- إعادة دراسة المادة بالرغم من النجاح فيها، بهدف تحسين المُعدّل.
    ‌ج- الرسوب في المادة.
    ‌د- تسجيل المادة وعدم الالتحاق بها.'''),
      kSmallSpace,
      subTitle("الجزاءات في المنحة الدراسية:"),
      kMinorSpace,
      const Text("عند مُخالفة الطالب لأحد أحكام المنحة الدراسية أو الالتزامات المُترتبة عليها؛ يحقّ للمكتب أن يوقِّع عليه واحدًا أو أكثر من الجزاءات الآتية:"),
      kMinorSpace,
      getBulletText("إنذار أكاديمي أول."),
      getBulletText("إنذار أكاديمي ثانٍ ونهائي."),
      getBulletText("إيقاف المنحة."),
      getBulletText("أيّ جزاء آخر مُناسب يراه المكتب."),
    ],
  );
}
getGraduateApplyingProcedureInternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      sectionTitle(title: "إجراءات التقديم لبرنامج المنح الدراسية (داخل الدولة) - الدراسات العليا"),
      kSmallSpace,
      subTitle("أولاً:"),
      kMinorSpace,
      const Text("يجب على الطالب الراغب بالتقديم للمنحة والمستوفي للشروط كافة اتباع الإجراءات الآتية:"),
      const Text("تجهيز جميع الوثائق المطلوبة وعمل نسخة رقمية بالمسح الضوئي (Scan) للمستندات والوثائق الآتية:"),
      kMinorSpace,
      getBulletText("صور شخصية حديثة للطالب بالزي الوطني، وخلفية بيضاء، بصيغة (JPG) أو (PNG) (أبعاد الصورة 4.5 / 3.5)."),
      getBulletText("صورة عن جواز سفر الطالب متضمّنة صفحة الرقم الموحّد."),
      getBulletText("صورة من بطاقة الهوية (من الجهتيْن)."),
      getBulletText("إفادة لا يعمل من الجهة المختصة للمتقدمين لبرنامج المنح الدراسية داخل الدولة."),
      getBulletText("السجل الدراسي للطلبة المنتظمين بالدراسة في الجامعة."),
      getBulletText("صورة مصدّقة عن شهادة البكالوريوس مع كشف الدرجات (في حال التقديم للماجستير)."),
      getBulletText("صورة مصدّقة عن شهادة الماجستير مع كشف الدرجات (في حال التقديم للدكتوراه)."),
      getBulletText("صورة عن شهادة المعادلة من وزارة التعليم العالي للطلبة الدارسين بجامعات خارج الدولة."),
      getBulletText("صورة عن رسالة القبول الجامعي (القبول النهائي) من الجامعات والتخصصات المعتمدة لدى المكتب."),
      getBulletText("صورة عن نتائج الاختبارات المطلوبة للالتحاق بالدراسات العليا (إن وجدت)."),
      kSmallSpace,
      subTitle("ثانياً:"),
      kMinorSpace,
      const Text("تعبئة طلب التقديم عن طريق التسجيل في الموقع الإلكتروني."),
    ],
  );
}