

import 'package:flutter/cupertino.dart';
import 'package:sco_v1/resources/widgets/subtitle_widget.dart';
import 'package:sco_v1/view/apply_scholarship/form_view_Utils.dart';
import 'package:sco_v1/view/main_view/scholarship_in_uae/bachelor_inside_uae/bachelor_inside_uae.dart';

import '../../../../resources/widgets/bullet_text_widget.dart';

getGraduateTermsAndConditionsExternal(context){
  return Column(
    children: [
      sectionTitle(title: "شروط ومتطلبات التقديم لبعثة صاحب السمو رئيس الدولة للطلبة المتميزين علميًا (خارج الدولة) - الدراسات العليا"),
      kSmallSpace,
      const Text(
          '''
1. أن يكون المتقدّم من مواطني دولة الإمارات العربية المتحدة.
2. الحصول على الدرجات الآتية:'''
      ),
      const Text(
        '''
(الشهادة / نوع البعثة): بعثة صاحب السمو رئيس الدولة للطلبة المتميزين علميًا
- الماجستير
- البكالوريوس: المعدل 3.4 من أصل 4.0
- الدكتوراه
- الماجستير: المعدل 3.75 من أصل 4.0
''',
      ),
      const Text(
        '''
3. اجتياز اختبار اللغة الإنجليزية الأيلتس: 7
4. أن يكون لديه قبول جامعي نهائي غير مشروط من إحدى الجامعات المتميزة والمعتمدة من قبل مكتب البعثات الدراسية على أن يكون ضمن مجال تخصّصه وحاصل على موافقة وزارة التربية والتعليم على البرنامج الدراسي.
5. أن يجتاز المقابلة الشخصية بنجاح.
6. إذا كان الطالب موظفًا، تقديم ما يثبت موافقة جهة عمله على التحاقه بالدراسة وحصوله على إجازة دراسية (إجازة تفرّغ للدراسة).
''',
      ),
    ],
  );
}
getGraduateApprovedUniversitiesExternal(context){
  return Column(
    children: [
      sectionTitle(title: "قائمة الجامعات المعتمدة لدى المكتب - الدراسات العليا - خارج الدولة"),

    ],
  );
}
getGraduateApprovedMajorsExternal(context){
  return Column(
    children: [
      sectionTitle(title: "قائمة التخصّصات المعتمدة لدى المكتب - الدراسات العليا - خارج الدولة")
    ],
  );
}
getGraduateScholarshipPrivilegesExternal(context){
  return Column(
    children: [
      sectionTitle(title: "امتيازات بعثة صاحب السمو رئيس الدولة للطلبة المتميزين علميًا (خارج الدولة) - الدراسات العليا"),
      kSmallSpace,
      subTitle("النفقات الدراسية التي يتحملها مكتب البعثات الدراسية:"),
      kMinorSpace,
      const Text(
        '''
1. راتب شهري مجزي لطلبة بعثة صاحب السمو رئيس الدولة للطلبة المتميزين علميًا.
2. تغطية الرسوم الدراسية الجامعية كافة.
3. بدل نقدي الاستعداد للسفر لأول مرة.
4. بدل تذكرة سفر بالطائرة ذهابًاً وإيابًا مرتين سنويًا من دولة الإمارات العربية المتحدة إلى بلد الإيفاد.
5. توفير التأمين الصحي للطالب الموفد.
6. إذا كان الطالب متزوجاً، فسيمنح الامتيازات الآتية بالإضافة إلى ما تقدّم، بشرط اصطحاب الزوجة أو الزوج إلى بلد الإيفاد:
''',
      ),
      getBulletText('علاوة زواج إضافية على الراتب الشهري.'),
      getBulletText('بدل تذاكر سفر سنوية بالدرجة السياحية ذهابًا وإيابًا مرتيْن في السنة للزوجة أو الزوج والأبناء المعالين على أن تتراوح أعمارهم بين 4 إلى 18 سنة.'),
      getBulletText('رسوم نفقات دراسة الأبناء في بلد الإيفاد على أن تتراوح أعمارهم بين 4 إلى 18 سنة.'),
      getBulletText('التأمين الصحي ونفقات العلاج للزوجة أو الزوج والأبناء المُعالين.'),
      kMinorSpace,
      const Text('''
7. إذا كان الطالب موظفًا ويحصل على راتب شهري من جهة عمله خلال فترة إيفاده، فيستحق فقط 50% كمكافأة شهرية من الراتب الشهري المخصّص للطالب في البعثة.
8. يمنح الطالب الموفد عند تخرّجه من الجامعة الموفد إليها مكافأة مالية قدرها 15% من إجمالي الرواتب التي تقاضاها خلال فترة دراسته.
9. تقديم مكافآت تشجيعية للطلبة الذين يظهرون تميّزًا أكاديميًا.'''),
      subTitle("ملاحظة: لا تنطبق بعض الامتيازات أعلاه على الموظفين، وعلى الطلبة غير الملتحقين بنظام الدراسة الكلي."),
    ],
  );
}
getGraduateStudentObligationsExternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      sectionTitle(title: "التزامات الطالب لبعثة صاحب السمو رئيس الدولة للطلبة المتميزين علميًا (خارج الدولة) - الدراسات العليا"),
      kSmallSpace,
      subTitle("التزامات الطالب الموفد:"),
      kMinorSpace,
      const Text('''
1. الحصول على معدّل لا يقلّ عن (3.6) أو ما يعادلها في كلّ فصل دراسي.
2. تسجيل (12) ساعة دراسية كحدّ أدنى في كلّ فصل دراسي.
3. الالتزام التام بعدم الغياب عن الحصص الدراسية في الجامعة ما لم تقضِ الحاجة الضرورية ذلك.
4. أن يكون الطالب خير ممثّل لدولة الإمارات العربية المتحدة وأن ينقل صورة مشرّفة عن دولته.
5. التواصل الدائم مع المكتب، والردّ على أيّ أسئلة او استفسارات أو طلبات ترد للطالب من المرشد الأكاديمي.
6. اتباع القوانين والنظم واللوائح المعمول بها كافة في الجامعة التي سيدرس بها الطالب.
7. التقيّد التام بجميع التوجيهات الصادرة من قبل المكتب، والالتزام بقواعد وشروط الإيفاد، وعدم مخالفتها، واتباع التعليمات التي تشمل اختيار الجامعات والتخصّصات العلمية التي سيدرسها الطالب.''')
    ],
  );
}
getGraduateApplyingProcedureExternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      sectionTitle(title: "إجراءات التقديم لبعثة صاحب السمو رئيس الدولة للطلبة المتميزين علميًا (خارج الدولة) - الدراسات العليا"),
      kSmallSpace,
      subTitle("أولاً:"),
      kMinorSpace,
      const Text(
        '''
يجب على الطالب الراغب بالتقديم للبعثة والمستوفي للشروط كافة اتباع الإجراءات الآتية:

تجهيز جميع الوثائق المطلوبة وعمل نسخة رقمية بالمسح الضوئي (Scan) للمستندات والوثائق الآتية:'''),
      kMinorSpace,
      getBulletText('صور شخصية حديثة للطالب بالزي الوطني، وخلفية بيضاء، بصيغة (JPG) أو (PNG) (أبعاد الصورة 4.5 / 3.5).'),
      getBulletText('صورة عن جواز سفر الطالب متضمّنة صفحة الرقم الموحّد.'),
      getBulletText('صورة من بطاقة الهوية (من الجهتيْن).'),
      getBulletText('خطاب موافقة مبدئية على الإيفاد من جهة العمل للمتقدمين للبعثات الخارجية فقط إذا كان المتقدّم للبعثة موظفًا على أن يتضمّن الخطاب البيانات الوظيفية للموظف (الاسم، الوظيفة، ....).'),
      getBulletText('إفادة لا يعمل من الجهة المختصة للمتقدمين لبرنامج المنح الدراسية داخل الدولة.'),
      getBulletText('السجل الدراسي للطلبة المنتظمين بالدراسة في الجامعة.'),
      getBulletText('صورة مصدّقة عن شهادة البكالوريوس مع كشف الدرجات (في حال التقديم للماجستير).'),
      getBulletText('صورة مصدّقة عن شهادة الماجستير مع كشف الدرجات (في حال التقديم للدكتوراه).'),
      getBulletText('صورة عن شهادة المعادلة من وزارة التعليم العالي للطلبة الدارسين بجامعات خارج الدولة.'),
      getBulletText('صورة من إفادة وزارة التربية والتعليم بالموافقة على البرنامج الدراسي حسب القبول الجامعي للطلبة المتقدمين للبعثات الخارجية.'),
      getBulletText('صورة عن رسالة القبول الجامعي (القبول النهائي) من الجامعات والتخصصات المعتمدة لدى المكتب.'),
      getBulletText('صورة عن نتائج الاختبارات المطلوبة للالتحاق بالدراسات العليا (إن وجدت).'),
      kSmallSpace,
      subTitle("ثانياً:"),
      kMinorSpace,
      const Text("تعبئة طلب التقديم عن طريق التسجيل في الموقع الإلكتروني."),
    ],
  );
}