import 'package:flutter/material.dart';
import 'package:sco_v1/resources/widgets/bullet_text_widget.dart';
import 'package:sco_v1/resources/widgets/full_screen_image_widget.dart';
import 'package:sco_v1/resources/widgets/subtitle_widget.dart';
import 'package:sco_v1/view/apply_scholarship/form_view_Utils.dart';
import 'package:sco_v1/view/main_view/scholarship_in_uae/bachelor_inside_uae/bachelor_inside_uae.dart';

import '../../../../resources/app_colors.dart';

getMeteorologicalTermsAndConditionsInternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      sectionTitle(title: "شروط ومتطلبات التقديم لبعثة العلوم الإكتوارية - درجة البكالوريوس"),
      kSmallSpace,
      const CustomRichText(spans: [
        TextSpan(text: '1. أن يكون المتقدّم للبعثة من مواطني دولة الإمارات العربية المتحدة.\n'),
        TextSpan(text: '2. أن يكون حسن السيرة والسلوك.\n'),
        TextSpan(text: '3. ألاً يكون قد مضى على تخرّج الطالب من الصف الثاني عشر أو ما يعادلها مدة تزيد عن '),
        TextSpan(text: 'سنتيْن', style: TextStyle(color: Colors.red)),
        TextSpan(text: '.\n'),
        TextSpan(text: '4. أن يكون حاصلاً على نسبة مئوية، لا تقلّ عن ('),
        TextSpan(text: '90', style: TextStyle(color: Colors.red)),
        TextSpan(text: '%) في شهادة الصف الثاني عشر أو ما يعادلها، علمًا بأن هذه النسبة قابلة للتغيير من سنة إلى أخرى، تبعًا لمعطيات الميدان التربوي، مثل: معدلات نجاح طلبة الصف الثاني عشر، ودرجاتهم، ومؤشرات نتائج الثاني عشر، وقد كان شرط الحصول على البعثة الدراسية لخريجي الصف الثاني عشر بالأعوام السابقة، هو تحقيق نسبة ('),
        TextSpan(text: '98', style: TextStyle(color: Colors.red)),
        TextSpan(text: '%) فأعلى.\n'),
        TextSpan(text: '5. ألاَ يكون قد سبق إيفاده على بعثة دراسية أخرى أو انتهت بعثته بالإلغاء.\n'),
        TextSpan(text: '6. أن يكون حاصلاً على القبول من إحدى الجامعات المُعترف بها من المكتب، والواردة في قائمة الجامعات في الموقع الإلكتروني للمكتب.\n'),
        TextSpan(text: '7. أن يجتاز الطالب المقابلة الشخصية مع مجلس الإدارة بنجاح.\n'),
        TextSpan(text: '8. أن يتعهّد الطالب بالالتزام باللوائح والأنظمة والتعليمات الصادرة عن السلطة المُختصة، طبقًا لأحكام البعثة.\n'),
        TextSpan(text: '9. أن يلتزم الطالب بالتخصّص والدراسة في الجامعة وفق البعثة الدراسية التي حصل عليها، وألّا يُغيّر تخصّصه أو جامعته إلّا بموافقة خطية من المكتب.\n'),
        TextSpan(text: '10. ألا يكون حاصلاً على بعثة دراسية من جهة أخرى.\n'),
        TextSpan(text: '11. الحصول على الدرجات والشروط العامة المطلوبة'),
        TextSpan(text: "كما هو موضح في الجدول أدناه:",style: TextStyle(color: AppColors.scoThemeColor))
      ]),
      getBulletText("الحصول على الدرجة المطلوبة في إحدى الاختبارات المعيارية للغة الإنجليزية (الآيلتس او التوفل).", squareBullet: true),
      getBulletText("الحصول على الدرجة المطلوبة للاختبار المعياري الرياضيات (سات SAT ) أو ما يعادله للطلبة الملتحقين في الدراسة بالمنهاج (الخاص الأجنبي).", squareBullet: true),
      getBulletText("الحصول على الدرجة المطلوبة في مادة (الرياضيات) في الصف العاشر والحادي عشر والثاني عشر.", squareBullet: true),
      getBulletText("الحصول على قبول جامعي من إحدى الجامعات والتخصصات المعتمدة لدى المكتب، وتعطى الأولوية للطلبة الحاصلين على علامات متميزة.", squareBullet: true),
      kMinorSpace,
      const TappableImage(imagePath: "https://5.195.193.184/documents/20126/78378/UGRDACT25.png/e3d4fedc-fb8b-c3bc-e24c-42f8ab7d7805?t=1735806454150",isNetwork: true,),
      kSmallSpace,
      subTitle("شروط إضافية لطلبة الجامعات (الراغبين بالتحويل للبعثة):"),
      kMinorSpace,
      getBulletText("ألاَ يتجاوز الطالب العام الثاني من دراسته الجامعية.", squareBullet: true),
      getBulletText("ألاَ يقل معدّل الطالب التراكمي عن (3.5) من (4.0) حسب نظام احتساب الدرجات في الجامعات الأمريكية لبعثة صاحب السمو رئيس الدولة للطلبة المتميزين علميًا.", squareBullet: true),
      getBulletText("أن يكون الطالب ملتحقًا أو حاصلاً على قبول جامعي من إحدى الجامعات المتميزة والمعتمدة من مكتب البعثات الدراسية.", squareBullet: true),
      kSmallSpace,
      subTitle("عملية اختيار الطلبة:"),
      kMinorSpace,
      getBulletText("عدد المقاعد محدودة للطلبة، واستيفاء الطالب للشروط لا يعني القبول، وإنما يخضع لأسس ومعايير التنافس المعتمدة لدى المكتب للطلبة النخبة والمتميزين.", squareBullet: true),
      getBulletText("تعتبر الشروط المذكورة الحد الأدنى المطلوب للتأهل لتقديم طلب البعثة الدراسية.", squareBullet: true),
      getBulletText("يتم اختيار المتقدمين بناء على عملية تفاضلية تأخذ في الاعتبار مجموعة متنوعة من العوامل، تشمل الأداء الأكاديمي السابق للمتقدم في الصف العاشر والحادي عشر ونسبة الفصل الأول والنهائي للصف الثاني عشر، الاختبارات القياسية والمركزية، القبول الجامعي، واجتياز المقابلة الشخصية.", squareBullet: true),



    ],
  );
}

getMeteorologicalUniversityAndSpecializationsInternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      sectionTitle(title: "قائمة الجامعات والتخصصات المعتمدة للمنح لدى المكتب"),
      kSmallSpace,
      subTitle("الجامعات المعتمدة للسنة الدراسية 2021-2022"),
      kMinorSpace,
      const Text("بوليتيكينك - أبوظبي (منحة الأرصاد الجوية)"),
      kSmallSpace,
      subTitle("التخصصات المعتمدة للسنة الدراسية 2021-2022"),
      kMinorSpace,
      const Text("بكالوريوس الأرصاد الجوية")
    ],
  );
}

getMeteorologicalScholarshipPrivilegesInternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [

      sectionTitle(title: "امتيازات منحة الأرصاد الجوية"),
      kSmallSpace,
      subTitle("النفقات الدراسية التي يتحملها مكتب البعثات الدراسية:"),
      kMinorSpace,
      const Text(
          '''
1. الرسوم الدراسية السنوية.
2. رسوم الكتب الدراسية.
3. كلفة السكن المشترك.
4. رسوم المواصالت في حال توفير الجامعة للمواصالات.
5. المكافأة الشهرية.
6. رسوم اختبار التوفل أو اآليلتس في الجامعة لثالث مرات خلال السنة الاولى من الدراسة.
7. لا ّتغطي المنحة رسوم األنشطة الطلابية والحاسب الالي المحمول.'''),
      kSmallSpace,
      subTitle("الحوافز التشجيعية:",AppColors.scoButtonColor),
      kMinorSpace,
      const Text(
          '''
1. يحصل الطالب ّ المتميز في نهاية ّكل فصل دراسي على رسالة تقدير في حال حصوله على معدل تراكمي (3.50) فأعلى.
2. يحصل الطالب ّ المتميز في نهاية السنة الأكاديمية على رسالة تقدير ومكافأة تشجيعية في حال حصوله على معدل تراكمي (3.80) فأعلى.''')
    ],
  );
}

getMeteorologicalStudentObligationsInternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
       sectionTitle(title: "التزامات الطالب لمنحة الأرصاد الجوية"),
      kSmallSpace,
       subTitle("التزامات الطالب:"),
      kMinorSpace,
     const Text(
          '''
1. الالتـزام بالقيـم ومبـادئ الأخـلاق الفاضلـة، وأن يكون حسـن السـيرة والسـلوك، والابتعاد عـن أيّ تصرّف يخلّ باعتبارات الشـرف والأمانـة وسـمعة الوزارة.
2. عـدم تغييـر الجامعـة التـي يـدرس فيهـا أو التخصّـص العلمـي المحـدّد لـه، إلاّ بعـد الحصـول علـى إذن كتابـي مسـبق مـن المكتب.
3. التقيّد بأنظمة الإشـراف العلمي والإداري والمتابعة الأكاديمية، وجميع التوجيهات الصادرة إليه فيما يتعلّق بمسـاره الدراسـي مـن الجانـب الأكاديمـي، حتـى الحصـول علـى الدرجـة العلميـة المطلوبـة.
4. اجتياز اختبارات القبول المطلوبة كافة في الجامعات.
5. الانتظام في الدراسـة، والجدّية، والحرص على تحصيل العلم، وبذل أقصى جهد في دراسـته وأبحاثه للحصول على الدرجة العلميـة المقرّرة في المـدة المحدّدة.
6. الإيعاز للجامعة أو الكلية بموافاة المكتب بنسخة من سجل العلامات الدراسية والمعدل التراكمي، موضَحة فيها الدرجات التـي حصـل عليهـا فـي كلّ مسـاق أو مـادة، والمعـدل العـام، وبـأيّ تقريـر علمـي أو دراسـي آخـر يطلبـه المكتـب.
7. ألاّ تقـل عـدد السـاعات المسـجَّلة فـي الفصـل الدراسـي الواحـد عـن (51) سـاعة معتمـدة فـي درجـة البكالوريـوس، وعـن (3) مــواد فــي الفصــل الدراســي الواحــد بالنســبة إلــى طلبــة الماجســتير، أو حســب برنامــج الماجســتير فــي الجامعــة.
8. الالتـزام بمـدة الدراسـة المحـدّدة، وهـي (5) سـنوات لدرجـة البكالوريـوس بحـدّ أقصـى، وسـنتان (2) لدرجة الماجسـتير، شـاملة الدراسـة التأسيسـية وسـنوات التخصّـص، مـا لـم تكـن مـدة الدراسـة المحـدّدة مـن الجامعـة تزيـد علـى ذلـك.
9. ألاّ يقـل المعـدل التراكمـي عـن (2.80) مـن (4.00) فـي كلّ فصـل دراسـي لطلبـة البكالوريـوس، أو مـا يعادلـه حسـب نظـم الجامعـات.
10. ألاّ يقـل المعـدل التراكمـي عـن (3.00) مـن (4.00) فـي كلّ فصـل دراسـي لطلبـة الماجسـتير، أو مـا يعادلـه حسـب نظـم الجامعــات.
11. الالتزام بنظام الحضور والغياب في الجامعة/الكلية، ما لم يكن لديه عذر طارئ أو قهري، يقبله المكتب.
12. إخطـار المكتـب بـأيّ عائـق أو مشـكلة أو ظـروف قـد تحـول بينـه وبيـن متابعـة الدراسـة علـى النحـو المطلـوب، سـواء كانـت خاضعـة لإرادتـه أو خارجـة عنها.
13. التعهّد بالالتزام باللوائح والأنظمة والتعليمات كافة.
14. الالتزام بإنهاء برنامج اللغة الإنجليزية في الفترة المحدّدة من الجامعة.
15. الالتزام بسداد قيمة الفصل الدراسي الذي يقوم بالانسحاب منه من دون موافقة المكتب.
16. للمكتب الحقّ في إلغاء المنحة الدراسية المقدمة للطالب من دون أن يكون له حقّ المطالبة بأيّ تعويض.
17. يلتزم الطالب بسداد قيمة المادة الدراسية المسجّلة في الفصل الدراسي في الحالات الآتية'''),
      getBulletText("سحب هذه المادة الدراسية بعد انتهاء فترة السحب والإضافة المحدّدة من المكتب."),
      getBulletText("إعادة دراسة المادة رغم النجاح فيها، بهدف تحسين المعدل."),
      getBulletText("الرسوب في المادة."),
      getBulletText("تسجيل المادة وعدم الالتحاق بها."),
      getBulletText("رسوم أيّ اختبار في (التوفل أو الآيلتس) جديد؛ إن لم يجتز ثلاثة اختبارات قبل ذلك، فالمكتب يسدّد رسوم هذه الاختبارات ثلاث مرات فقط؛ خلال السنة الأولى من الدراسة."),

      kSmallSpace,
      subTitle("الجزاءات في المنحة الدراسية:"),
      kMinorSpace,
      const Text("عنـد مخالفـة الطالـب ألحـد أحـكام المنحـة الدراسـية أو الالتزامـات المترتبـة عليهـا، يحـق ِ للمكتـب أن يوقـع عليـه أحـد الجـزاءات التاليـة أو أكثـر:"),
      getBulletText("إنذار أكاديمي أول."),
      getBulletText("إنذار أكاديمي ثان ونهائي."),
      getBulletText("إيقاف المنحة."),
      getBulletText("أي جزاء مناسب آخر يراه المكتب."),



    ],
  );
}

getMeteorologicalApplyingProcedureInternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: <Widget>[
      sectionTitle(title: "إجراءات التقديم لمنحة الأرصاد الجوية"),
      kSmallSpace,
      const Text("يجب على الطالب الراغب بالتقديم للمنحةوالمستوفي لكافة الشروط اتباع الإجراءات التالية:"),
      kSmallSpace,
      subTitle("أولاً:"),
      kMinorSpace,
      const Text('تجهيز جميع الوثائق المطلوبة وعمل نسخة رقمية بالمسح الضوئي (Scan) للمستندات والوثائق كالتالي:'),
      const Text('''
1. صورة عن جواز السفر ساري المفعول، متضمّنة الرقم الموحّد.
2. صورة عن خلاصة القيد كاملة.
3. صورة ملوّنة عن بطاقة الهوية بوجهيْها.
4. شهادة الصفيْن العاشر والحادي عشر.
5. شهادة الثانوية العامة مصدّقة من وزارة التربية والتعليم.
6. شـهادة حديثـة لاجتيـاز اختبـار اللغـة الإنجليزيـة، بمعـدل (054) فأعلـى فـي امتحـان التوفـل (TOEFL) ، أو (5) فأعلـى فـي امتحــان الآيلتــس (IELTS) ، او مــا يعادلهــا فــي اختبــار (EMSAT).
7. ورقة القبول من الجامعة التي سيلتحق بها.
8. السجل الدراسي للطلبة المنتظمين بالدراسة في الجامعة.
9. صورة شخصية حديثة.
10. رقم الحساب البنكي للطالب (IBAN)''')
    ],
  );
}