import 'package:flutter/cupertino.dart';
import 'package:sco_v1/resources/widgets/subtitle_widget.dart';
import 'package:sco_v1/utils/utils.dart';
import 'package:sco_v1/view/apply_scholarship/form_view_Utils.dart';

import '../../../../resources/widgets/bullet_text_widget.dart';

getAhcpDetails(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      
      sectionTitle(title: "برنامج التدريب للمهن الصحية"),
      kSmallSpace,
      Text(''' 
      يسعى "مكتب البعثات الدراسية" إلى إتاحة الفرصة أمام الكوادر الإماراتية في مجال المهن الصحية، لاستكمال التدريب السريري خارج الدولة، والحصول على شهادات في مختلف التخصّصات الصحية.

      '''),
      kSmallSpace,
      subTitle("أهداف البرنامج:"),
      getBulletText('تلبية الاحتياجات المتزايدة للرعاية الصحية في المجتمع، عبر تخريج كوادر إماراتية مؤهلة وقادرة على تقديم الرعاية للمرضى بصورة مهنية وفعّالة.'),
      getBulletText('تنمية القدرات والمهارات التقنية والمهنية للكوادر الإماراتية لمواكبة التطورات الحديثة في مجال الرعاية الصحية.'),
      kSmallSpace,
      subTitle("مدة البرنامج:"),
      getBulletText('التمريض: سنتان كاملتان.'),
      getBulletText('المهن المساندة: سنة كاملة.'),


      kSmallSpace,
      subTitle("شروط الالتحاق بالبرنامج:"),
      getBulletText('أن يكون المتقدم من مواطني دولة الإمارات العربية المتحدة.'),
      getBulletText('اجتياز اختبارات اللغة واختبارات التراخيص في بلد الابتعاث بالمعدلات المطلوبة.'),
      getBulletText('الحصول على معدل لا يقل عن 2.5 للبكالوريوس و3.0 للماجستير.'),
      getBulletText('الحصول على درجة لا تقل عن 6 في اختبار .(IELTS)'),
      getBulletText('الحصول على قبول في برنامج تدريب إكلينيكي من إحدى الجامعات أو المستشفيات الدولية المعتمدة، يؤهله لنيل شهادة تخصصية.'),
      getBulletText('الحصول على موافقة جهة العمل إذا كان موظفًا.'),
      getBulletText('الحصول على تقييم أداء وظيفي لا يقلّ عن جيد.'),
      getBulletText('اجتياز المقابلة الشخصية.'),
      getBulletText('توقيع تعهد بالالتزام بجميع شروط ومعايير البرنامج.'),
      getBulletText('تزويد المكتب بالمستندات المطلوبة.'),


      kSmallSpace,
      subTitle("امتيازات البرنامج (خلال مدة التدريب):"),
      getBulletText('تقديم الدعم والإرشاد الأكاديمي.'),
      getBulletText('تخصيص مكافأة مالية شهرية.'),
      getBulletText('تغطية جميع الرسوم.'),
      getBulletText('تقديم الإرشاد للالتحاق بدورات تحضيرية لـ"اختبار الترخيص الطبي الأمريكي".'),
      getBulletText('صرف بدل الكتب والمراجع.'),
      getBulletText('صرف بدل تذاكر السفر مرة واحدة خلال السنة.'),
      getBulletText('صرف بدل ما قبل السفر.'),
      getBulletText('توفير التأمين الصحي.'),


      kSmallSpace,
      subTitle("التزامات المبتعث:"),
      getBulletText('الانتظام في الدراسة والالتزام بالتدريب.'),
      getBulletText('التواجد في بلد الابتعاث خلال مدة البرنامج.'),
      getBulletText('تمثيل الدولة بصورة مشرفة.'),
      getBulletText('التواصل مع المكتب، والالتزام بتعليمات المرشد الأكاديمي.'),
      getBulletText('اتّباع القوانين والنُظم واللوائح المعمول بها في مقرّ التدريب.'),
      getBulletText('الالتزام بتوجيهات المكتب وشروط الابتعاث، وتتضمّن اختيار المستشفيات والتخصّص.'),
      getBulletText('المحافظة على مستوى أداء متميّز.'),
      getBulletText('بعد استكمال التدريب؛ استئناف المهام الوظيفية في جهة العمل مدة زمنية تُماثل مدة الابتعاث.'),
      getBulletText('تقديم جميع المستندات المطلوبة للمكتب بعد إتمام التدريب.'),
      getBulletText('موافاة المكتب بنسخة عن تقارير التقييم السنوية.'),

      kSmallSpace,
      subTitle("إرشادات القبول في البرنامج:"),
      getBulletText('اختيار أحد التخصّصات المعتمدة لدى المكتب.'),
      getBulletText('التسجيل في اختبار الترخيص الطبي مبكرًا.'),
      getBulletText('تقديم طلب التدريب في المستشفيات وفق المواعيد المحددة.'),
      getBulletText('الاهتمام بكتابة السيرة الذاتية وخطابات التوصية.'),
      getBulletText('المشاركة في الدراسات والبحوث.'),
      getBulletText('استكمال المستندات قبل تقديم الطلب.'),
      getBulletText('التحضير للمقابلة الشخصية في المنشأة المراد التدريب فيها.'),
      getBulletText('التواصل مع المكتب بعد تقديم الطلب لتوفير الدعم والإرشاد.'),

      kSmallSpace,
      subTitle("الوثائق والمستندات المطلوبة:"),
      getBulletText('صورة شخصية حديثة بالزي الوطني.'),
      getBulletText('نسخة إلكترونية عن جواز السفر.'),
      getBulletText('نسخة إلكترونية عن بطاقة الهوية.'),
      getBulletText('نسخة إلكترونية عن بيانات أفراد الأسرة.'),
      getBulletText('نسخة عن الشهادة الجامعية مع السجل الدراسي.'),
      getBulletText('شهادة حسن السيرة والسلوك.'),
      getBulletText('توقيع تعهد بالالتزام بشروط ومعايير الابتعاث.'),

      kSmallSpace,
      subTitle("إجراءات التقديم على البرنامج:"),
      getBulletText('تقديم طلب عن طريق الموقع الإلكتروني لـ"مكتب البعثات الدراسية".'),
      getBulletText('تحميل المستندات والوثائق المطلوبة.'),
      getBulletText('تحديد التخصص المطلوب.'),

      kSmallSpace,
      subTitle("* يخضع التقديم على البعثة للشروط والأحكام، وتوفر المقاعد التدريبية."),

      kSmallSpace,
      subTitle("أسماء الجامعات والمستشفيات:"),
    ],
  );
}