

import 'package:flutter/material.dart';
import 'package:sco_v1/resources/app_colors.dart';
import 'package:sco_v1/resources/widgets/subtitle_widget.dart';

import '../../../../resources/widgets/bullet_text_widget.dart';
import '../../../../utils/utils.dart';
import '../../../apply_scholarship/form_view_Utils.dart';
import '../../scholarship_in_uae/bachelor_inside_uae/bachelor_inside_uae.dart' hide kSmallSpace;

getActuarialTermsAndConditionsExternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      sectionTitle(title: "شروط ومتطلبات التقديم لبعثة العلوم الإكتوارية - درجة البكالوريوس"),
      kSmallSpace,
      const Text(
          '''
1. أن يكون المتقدّم للبعثة من مواطني دولة الإمارات العربية المتحدة.  
2. أن يكون حسن السيرة والسلوك.  
3. ألاً يكون قد مضى على تخرّج الطالب من الصف الثاني عشر أو ما يعادلها مدة تزيد عن سنتيْن.  
4. أن يكون حاصلاً على نسبة مئوية، لا تقلّ عن (90%) في شهادة الصف الثاني عشر أو ما يعادلها، علمًا بأن هذه النسبة قابلة للتغيير من سنة إلى أخرى، تبعًا لمعطيات الميدان التربوي، مثل: معدلات نجاح طلبة الصف الثاني عشر، ودرجاتهم، ومؤشرات نتائج الثاني عشر، وقد كان شرط الحصول على البعثة الدراسية لخريجي الصف الثاني عشر بالأعوام السابقة، هو تحقيق نسبة (98%) فأعلى.  
5. ألاَ يكون قد سبق إيفاده على بعثة دراسية أخرى أو انتهت بعثته بالإلغاء.  
6. أن يكون حاصلاً على القبول من إحدى الجامعات المُعترف بها من المكتب، والواردة في قائمة الجامعات في الموقع الإلكتروني للمكتب.  
7. أن يجتاز الطالب المقابلة الشخصية مع مجلس الإدارة بنجاح.  
8. أن يتعهّد الطالب بالالتزام باللوائح والأنظمة والتعليمات الصادرة عن السلطة المُختصة، طبقًا لأحكام البعثة.  
9. أن يلتزم الطالب بالتخصّص والدراسة في الجامعة وفق البعثة الدراسية التي حصل عليها، وألّا يُغيّر تخصّصه أو جامعته إلّا بموافقة خطية من المكتب.  
10. ألا يكون حاصلاً على بعثة دراسية من جهة أخرى.  
11. الحصول على الدرجات والشروط العامة المطلوبة كما هو موضح في الجدول أدناه:  

'''

      ),
      getBulletText('الحصول على الدرجة المطلوبة في إحدى الاختبارات المعيارية للغة الإنجليزية (الآيلتس او التوفل).',squareBullet: true),
      getBulletText('الحصول على الدرجة المطلوبة للاختبار المعياري الرياضيات (سات SAT ) أو ما يعادله للطلبة الملتحقين في الدراسة بالمنهاج (الخاص الأجنبي).',squareBullet: true),
      getBulletText('الحصول على الدرجة المطلوبة في مادة (الرياضيات) في الصف العاشر والحادي عشر والثاني عشر.',squareBullet: true),
      getBulletText('الحصول على قبول جامعي من إحدى الجامعات والتخصصات المعتمدة لدى المكتب، وتعطى الأولوية للطلبة الحاصلين على علامات متميزة.',squareBullet: true),
      kSmallSpace,
      const TappableImage(imagePath: "https://www.sco.ae/documents/20126/51507/UGRDACT25.png/a72aab8c-2979-70b7-c259-ecadd4725baa?t=1735876079760"),
      kSmallSpace,
      subTitle("شروط إضافية لطلبة الجامعات (الراغبين بالتحويل للبعثة):",),
      getBulletText('ألاَ يتجاوز الطالب العام الثاني من دراسته الجامعية.',squareBullet: true),
      getBulletText('ألاَ يقل معدّل الطالب التراكمي عن (3.5) من (4.0) حسب نظام احتساب الدرجات في الجامعات الأمريكية لبعثة صاحب السمو رئيس الدولة للطلبة المتميزين علميًا.',squareBullet: true),
      getBulletText('أن يكون الطالب ملتحقًا أو حاصلاً على قبول جامعي من إحدى الجامعات المتميزة والمعتمدة من مكتب البعثات الدراسية.',squareBullet: true),
      kSmallSpace,
      subTitle('عملية اختيار الطلبة:'),
      getBulletText('عدد المقاعد محدودة للطلبة، واستيفاء الطالب للشروط لا يعني القبول، وإنما يخضع لأسس ومعايير التنافس المعتمدة لدى المكتب للطلبة النخبة والمتميزين.', squareBullet: true),
      getBulletText('تعتبر الشروط المذكورة الحد الأدنى المطلوب للتأهل لتقديم طلب البعثة الدراسية.', squareBullet: true),
      getBulletText('يتم اختيار المتقدمين بناء على عملية تفاضلية تأخذ في الاعتبار مجموعة متنوعة من العوامل، تشمل الأداء الأكاديمي السابق للمتقدم في الصف العاشر والحادي عشر ونسبة الفصل الأول والنهائي للصف الثاني عشر، الاختبارات القياسية والمركزية، القبول الجامعي، واجتياز المقابلة الشخصية.', squareBullet: true),





    ],
  );
}

getActuarialApprovedUniversitiesExternal(context){
  return Column(
      crossAxisAlignment: CrossAxisAlignment.start,
      children: [
        sectionTitle(title: "قائمة الجامعات والتخصصات المعتمدة لبعثة العلوم الإكتوارية"),
        kSmallSpace,
      ]
  );}


getActuarialScholarshipPrivilegesExternal(context){
  return Column(
      crossAxisAlignment: CrossAxisAlignment.start,
      children: [
        sectionTitle(title: "امتيازات بعثة العلوم الإكتوارية - درجة البكالوريوس"),
        kSmallSpace,
        subTitle("النفقات الدراسية التي يتحمّلها مكتب البعثات الدراسية:"),
        Text(
            '''
1. راتب شهري مجزي للطالب.
2. الرسوم الدراسية السنوية.
3. رسوم الكتب الدراسية.
4. بدل تذكرة سفر بالطائرة ذهاباً وإياباً مرتين سنوياً، من دولة الإمارات العربية المتحدة إلى بلد الإيفاد.
5. توفير التأمين الصحي للطالب الموفد.
6. تقديم مكافآت تشجيعية للطلبة الذين يظهرون تميزًا أكاديميًا.
7. بدل نقدي للاستعداد للسفر.
8. بدل تذكرة سفر وبدل نقدي لمدة 45 يوما لمرافق الطالبة وذوي الهمم.
9. يحصل الطالب على مكافأة التخرج وتساوي (15%) من إجمالي المخصصات الشهرية التي يحصل عليها طوال فترة الدراسة.

إذا كان الطالب متزوجاً:
'''),
        kSmallSpace,
        subTitle("إذا كان الطالب متزوجاً:"),
        Text('يمنح الامتيازات الآتية بالإضافة إلى ما تقدّم، بشرط اصطحاب الزوجة أو الزوج والأبناء المُعالين مرتين سنوياً.'),
        Text('''
1. بدل تذكرة سفر سنوية بالدرجة السياحية ذهابًا وإيابًا للزوجة أو الزوج والأبناء المُعالين مرتين سنوياً.
2. رسوم نفقات دراسة الأبناء في بلد الإيفاء على أن تتراوح أعمارهم بين 4 إلى 18 سنة.
3. نفقة التأمين الصحي ونفقات العلاج للزوجة أو الزوج والأبناء.
4. صرف علاوة المتزوج للطالب على الراتب الشهري.
'''
        )
        
      ]
  );}

getActuarialStudentObligationsExternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      sectionTitle(title: "التزامات الطالب لبعثة العلوم الإكتوارية - درجة البكالوريوس"),
      kSmallSpace,
      subTitle("التزامات الطالب الموفد:"),
      getBulletText('التقيّد بأنظمة الإشراف العلمي والإداري والمتابعة الأكاديمية، وجميع التوجيهات الصادرة إليه، فيما يتعلّق بمسار البرنامج الدراسي من الجانب الأكاديمي، وحتى انتهاء دراسته.'),
      getBulletText('الالتزام بضوابط قرار التحاقه بالبرنامج الدراسي ومن أهمّها (الجامعة، البلد، التخصّص، المدة الدراسية، إلخ).'),
      getBulletText('الانتظام في الدراسة والاهتمام بمتابعة الدروس، وعدم التغيب عن الحصص الدراسية حسب نظام الحضور والانصراف المعمول به في الجامعة.'),
      getBulletText('موافاة المكتب بنسخة من السجل الدراسي وأي تقرير علمي أو دراسي يطلبه المكتب بشكل دوري.'),
      getBulletText('الالتزام بالتسجيل بالعدد المقرر من الساعات الدراسية لكلّ فصل دراسي.'),
      getBulletText('التعهّد بعدم المطالبة بأيّ تعويضات ونحوها أيا كانت صفتها أو نوعها، في حال صدور قرار التحاقه بالبرنامج الدراسي الذي سبقت الموافقة عليه، أيًّا كان سبب الإلغاء وفي أيّ حال كان عليه.'),
      getBulletText('الالتزام بقيم ومبادئ الأخلاق الفاضلة، وأن يكون حسن السيرة والسلوك، وأن يحترم قوانين الدولة الموفد إليها، كما يتجنّب إتيان بأيّ سلوك يخلّ باعتبارات الشرف والأمانة ويسيء إليه أو إلى سمعة الدولة.'),
      getBulletText('عدم الزواج من أجنبية/أجنبي طيلة فترة الدراسة وحتى تخرّجه من الجامعة.'),
      getBulletText('يجب على الطالب تزويد وتحديث بياناته الشخصية (أرقام الهواتف، البريد الإلكتروني، عنوان السكن في بلد الإيفاد، رقم وليّ الأمر، جواز السفر، تأشيرة السفر وبطاقة الهوية) وبشكل دوري.'),
      getBulletText('يجب على الطالب التواصل الدائم مع المرشد الأكاديمي والمرشد الاجتماعي بالمكتب.'),
      getBulletText('عدم مغادرة مقر الجامعة في أيّ حال من الأحوال إلا في الأوقات المحدّدة لذلك، وبموافقة مسبقة من المكتب.'),
    ],
  );
}


getActuarialApplyingProcedureExternal(context){
  return Column(
    crossAxisAlignment: CrossAxisAlignment.start,
    children: [
      sectionTitle(title: "إجراءات التقديم لبعثة العلوم الإكتوارية - درجة البكالوريوس"),
      kSmallSpace,
      subTitle("يجب على الطالب الراغب بالتقديم للبعثة والمستوفي للشروط كافة اتباع الإجراءات الآتية:",AppColors.scoButtonColor),
      subTitle("أولاً:"),
      Text(
          '''
1. تجهيز جميع الوثائق المطلوبة وعمل نسخة رقمية للمستندات والوثائق الآتية:
2. صورة شخصية حديثة للطالب بالزيّ الوطني، وخلفية بيضاء، بصيغة JPG أو PNG (أبعاد الصورة 4.5 / 3.5).
3. صورة عن جواز سفر الطالب متضمّنة صفحة الرقم الموحّد.
4. صورة عن جواز سفر وليّ أمر الطالب متضمّنة صفحة الرقم الموحّد.
5. صورة عن بطاقة الهوية من الجهتيْن.
6. صورة عن خلاصة القيد كاملة.
7. صورة مصدّقة عن الشهادة النهائية للصف العاشر.
8. صورة مصدّقة عن الشهادة النهائية للصف الحادي عشر.
9. صورة مصدّقة عن شهادة الفصل الدراسي الأول للصف الثاني عشر (في حال التقديم للبعثة بعد ظهور درجات الفصل الدراسي الأول).
10. صورة مصدّقة عن شهادة الفصل الدراسي الثاني للصف الثاني عشر (في حال التقديم للبعثة بعد ظهور درجات الفصل الدراسي الثاني).
11. صورة مصدّقة عن الشهادة النهائية للصف الثاني عشر (في حال التقديم بعد ظهور الدرجات النهائية).
12. تقرير درجات اختبار الإمسات أو التوفل أو الآيلتس والقبول الجامعي إن وجد.
13. تقرير درجات إمتحان السات 1.
14. السجل الدراسي للطلبة المُنتظمين بالدراسة في الجامعة.
'''
      ),
      kSmallSpace,
      subTitle("ثانياً:"),
      getBulletText("تعبئة طلب التقديم عن طريق الدخول إلى الموقع الإلكتروني."),
      kSmallSpace,
      subTitle("ثالثاُ:"),
      getBulletText("تحميل المستندات والوثائق بعد تعبئة الطلب واتباع الإرشادات الخاصة بتحميل المرفقات."),
      kSmallSpace,
      subTitle("ملاحظات:"),
      getBulletText('لا تقبل الطلبات التي ترسل عن طريق الفاكس أو تسلم باليد.'),
      getBulletText('يرجى الاتصال بمكتب البعثات الدراسية لطلب المساعدة في حال واجهتكم أيّ صعوبات خلال عملية التقديم عن طريق الموقع (اتصل بنا).'),
      getBulletText('يتم استقبال الطلبات خلال فترات التقديم المعتمدة، والتي تظهر في صفحة التقديم الإلكتروني على الموقع الإلكتروني للمكتب.'),

    ],
  );
}


