Repository: abhay-kumar-LogiclyInfotech/SCO_v1
Catalog: lib/l10n/app_*.arb
Languages: ar

# emailAddress
source: Student email address
ar: البريد الالكتروني للطالب

# idEmailOrMobile
source: ID Number, Email or Mobile Number
ar: رقم الهوية أو البريد الإلكتروني أو رقم الهاتف

source: LOGIN
ar: دخول

source: or
ar: أو

source: Sign in with UAE PASS
ar: تسجيل الدخول باستخدام UAE PASS

source: Read More
ar: اقرأ المزيد

source: Scholarships
ar: المنح الدراسية

# scholarshipsInTheUAE
source: Scholarships in the United Arab Emirates
ar: المنح الدراسية في دولة الإمارات العربية المتحدة

source: Scholarship Office
ar: مكتب المنح الدراسية

source: About the Organization
ar: عن المنظمة

source: About SCO
ar: عن SCO

source: Certificates
ar: الشهادات

source: FAQ's
ar: الأسئلة الشائعة

# visionAndMission
source: Vision & Mission
ar: الرؤية والرسالة

# newsAndEvents
source: News & Events
ar: الأخبار والفعاليات

source: Personal Information
ar: المعلومات الشخصية

source: Location
ar: الموقع

source: Contact Number
ar: رقم الاتصال

source: Email ID
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: General Information
ar: المعلومات العامة

source: Scholarship
ar: المنحة

source: Country
ar: الدولة

source: State
ar: الولاية

source: Address
ar: العنوان

source: Account
ar: الحساب

source: Message
ar: الرسالة

source: Information
ar: المعلومات

source: Home
ar: الرئيسية

source: Arabic
ar: العربية

source: SIGN UP
ar: التسجيل

source: Don't have account?
ar: لا تملك حسابـًا بعد؟

source: Reset New Password
ar: إعادة تعيين كلمة المرور الجديدة

source: New Password
ar: كلمة المرور الجديدة

source: Confirm Password
ar: تأكيد كلمة المرور

source: Submit
ar: تقديم الطلب

source: Already have account?
ar: هل لديك حساب؟

source: SIGN IN
ar: تسجيل الدخول

source: First Name
ar: الاسم الأول

source: Second Name
ar: الاسم الثاني

source: Third/Fourth Name
ar: الاسم الثالث/الرابع

source: Family Name
ar: اسم العائلة

# dob
source: Date Of Birth
ar: تاريخ الميلاد

source: Gender
ar: النوع

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Transgender
ar: ترنسجندر

source: Confirm Email Address
ar: تأكيد البريد الإلكتروني

source: Emirates Id
ar: رقم الهوية الاماراتية

source: Student Mobile Number
ar: رقم الهاتف المحمول للطالب

source: User Name
ar: اسم المستخدم

source: User Type
ar: نوع المستخدم

source: About Us
ar: معلومات عنا

source: A Brief About SCO
ar: موجز عن SCO

# visionMission
source: Vision, Mission, Value and Goal
ar: الرؤية والرسالة والقيم والأهداف

source: FAQ
ar: الأسئلة الشائعة

source: SCO Programs
ar: برامج SCO

source: News
ar: الأخبار

source: Contact
ar: اتصل بنا

source: Language
ar: اللغة

# forgotPasswordTitle
source: Forgot Password
ar: نسيت كلمة المرور

source: Please enter your Email Address!
ar: يرجى إدخال بريدك الإلكتروني!

source: Field can't be empty
ar: الحقل لا يمكن أن يكون فارغاً

# invalidName
source: Invalid name. Only English and Arabic characters allowed. No special characters, digits, or extra spaces.
ar: اسم غير صحيح. يسمح فقط بالحروف الإنجليزية والعربية. لا يُسمح بالرموز الخاصة أو الأرقام أو المسافات الزائدة.

source: Email can't be empty
ar: البريد الإلكتروني لا يمكن أن يكون فارغًا

source: Invalid email address.
ar: البريد الإلكتروني غير صحيح.

source: Password can't be empty
ar: كلمة المرور لا يمكن أن تكون فارغة

# passwordTooShort
source: Password must be at least 8 characters long
ar: يجب أن تكون كلمة المرور مكونة من 8 أحرف على الأقل

# passwordUppercase
source: Password must include at least one uppercase letter
ar: يجب أن تتضمن كلمة المرور على الأقل حرفًا واحدًا كبيرًا

# passwordLowercase
source: Password must include at least one lowercase letter
ar: يجب أن تتضمن كلمة المرور على الأقل حرفًا صغيرًا واحدًا

# passwordDigit
source: Password must include at least one digit
ar: يجب أن تتضمن كلمة المرور على الأقل رقمًا واحدًا

# passwordSpecialCharacter
source: Password must include at least one special character
ar: يجب أن تتضمن كلمة المرور على الأقل رمزًا خاصًا واحدًا

source: Emirate ID can't be empty
ar: رقم الهوية الإماراتية لا يمكن أن يكون فارغًا

source: Invalid Emirate ID
ar: رقم الهوية الإماراتية غير صحيح

source: Phone number can't be empty
ar: رقم الهاتف لا يمكن أن يكون فارغًا

# invalidPhoneNumber
source: Invalid phone number. It must contain only digits and can optionally start with a + sign.
ar: رقم الهاتف غير مستمر

# enterFirstName
source: Enter your first name
ar: أدخل اسمك الأول

# enterSecondName
source: Enter your second name
ar: أدخل اسمك الثاني

# enterThirdFourthName
source: Enter your third/fourth name
ar: أدخل اسمك الثالث/الرابع

# enterFamilyName
source: Enter your family name or last name
ar: أدخل اسم العائلة أو الاسم الأخير

# enterDateOfBirth
source: Enter your date of birth
ar: أدخل تاريخ ميلادك

# enterValidDay
source: Enter a valid day
ar: أدخل يومًا صحيحًا

# enterValidMonth
source: Enter a valid month
ar: أدخل شهرًا صحيحًا

# enterValidYear
source: Enter a valid year
ar: أدخل سنة صحيحة

# enterGender
source: Enter your gender
ar: أدخل جنسك

# enterValidEmail
source: Enter a valid email
ar: أدخل بريدًا إلكترونيًا صحيحًا

source: Emails do not match
ar: البريد الإلكتروني غير متطابق

# enterCountry
source: Enter your country
ar: أدخل بلدك

source: Enter valid Emirates ID
ar: أدخل رقم الهوية الإماراتية الصحيح

# enterValidPhoneNumber
source: Enter a valid phone number
ar: أدخل رقم هاتف صحيح

# enterValidPassword
source: Enter a valid password (at least 8 characters)
ar: أدخل كلمة مرور صحيحة (لا تقل عن 8 أحرف)

source: Passwords do not match
ar: كلمات المرور غير متطابقة

# answerCantBeEmpty
source: Answer cannot be empty
ar: الإجابة لا يمكن أن تكون فارغة

source: Invalid security answer
ar: إجابة الأمان غير صحيحة

source: Security Question Setup
ar: إعداد سؤال الأمان

source: Security Question
ar: سؤال الأمان

source: Security Answer
ar: إجابة الأمان

# writeAnswer
source: Write an answer
ar: اكتب إجابة

source: Select Security Question
ar: اختر سؤال الأمان

source: Something went wrong
ar: حدث خطأ ما

source: Write Security Answer
ar: اكتب إجابة الأمان

source: Terms and Conditions
ar: الشروط والأحكام

source: OTP Verification
ar: التحقق من OTP

# otp_verification_message
source: We sent a verification code to your email. Enter the OTP code here!
ar: أرسلنا رمز التحقق إلى بريدك الإلكتروني. أدخل رمز OTP هنا!

# time_limit
source: Time Limit 5 Minutes
ar: الوقت المحدد 5 دقائق

source: Resend Code
ar: إعادة إرسال الرمز

# error_complete_profile
source: Something went wrong. Please complete your profile through www.sco.ae
ar: حدث خطأ ما. يرجى إكمال ملفك الشخصي عبر www.sco.ae

# acceptance_of_terms_through_use_heading
source: Acceptance of Terms Through Use
ar: قبول الشروط من خلال الاستخدام

# acceptance_of_terms_through_use_points_p1
source: The use of this site is considered acceptance of the terms and conditions contained therein.
ar: يعتبر استخدام هذا الموقع قبولاً للشروط والأحكام الواردة فيه.

# acceptance_of_terms_through_use_points_p2
source: The Office of Study Missions reserves the right to amend the conditions of use mentioned at any time.
ar: يحتفظ مكتب البعثات الدراسية بالحق في تعديل شروط الاستخدام في أي وقت.

# acceptance_of_terms_through_use_points_p3
source: Any amendments to these conditions will be announced on the site.
ar: سيتم الإعلان عن أي تعديلات على هذه الشروط على الموقع.

# acceptance_of_terms_through_use_points_p4
source: The responsibility for knowing the modifications rests with the user.
ar: تتحمل مسؤولية معرفة التعديلات المستخدم.

# acceptance_of_terms_through_use_points_p5
source: Continued use of the site after amendments is considered implicit acceptance of these changes.
ar: يعتبر الاستمرار في استخدام الموقع بعد التعديلات قبولاً ضمنياً لهذه التعديلات.

# copyright_heading
source: Copyright
ar: حقوق الطبع

# copyright_points_p1
source: All copyrights on the website of the Office of Study Missions are subject to legal protection.
ar: جميع حقوق الطبع على موقع مكتب البعثات الدراسية تخضع للحماية القانونية.

# copyright_points_p2
source: These rights are owned or licensed by the Office of Study Missions.
ar: تملكها أو ترخص بها مكتب البعثات الدراسية.

# intellectual_property_rights_heading
source: Intellectual Property Rights
ar: حقوق الملكية الفكرية

# intellectual_property_rights_points_p1
source: All site contents are protected under intellectual property legislation, including copyrights, trademarks, service marks, and other rights.
ar: تخضع جميع محتويات الموقع للحماية بموجب تشريعات الملكية الفكرية، بما في ذلك حقوق الطبع، والعلامات التجارية، وعلامات الخدمة، وغيرها من الحقوق.

# intellectual_property_rights_points_p2
source: The user agrees not to broadcast, display, execute, publish, amend, edit, or create derivative works from the site’s content without explicit permission.
ar: يوافق المستخدم على عدم بث، عرض، تنفيذ، نشر، تعديل، تحرير، أو إنشاء أعمال مشتقة من محتويات الموقع دون الحصول على إذن صريح.

# intellectual_property_rights_points_p3
source: The user may print or download a single copy of the site’s contents for personal, non-commercial use.
ar: يمكن للمستخدم طباعة أو تحميل نسخة واحدة من محتويات الموقع لاستخدامه الشخصي وغير التجاري.

# intellectual_property_rights_points_p4
source: Retrieval of contents to create a database or directory without written permission is prohibited.
ar: يحظر استرجاع المحتويات لإنشاء قاعدة بيانات أو دليل دون إذن كتابي.

# intellectual_property_rights_points_p5
source: Use of site contents for any purpose not expressly permitted is also prohibited.
ar: يحظر استخدام محتويات الموقع لأي غرض غير مصرح به صراحة.

# severability_of_provisions_heading
source: Independence of Texts
ar: استقلالية النصوص

# severability_of_provisions_points_p1
source: If any condition is nullified for any reason, the nullity will apply only to that provision.
ar: إذا تم إبطال أي شرط لأي سبب، فإن البطلان سيطبق فقط على ذلك الشرط.

# severability_of_provisions_points_p2
source: Other conditions on the site will remain in effect.
ar: تظل الشروط الأخرى على الموقع سارية.

# severability_of_provisions_points_p3
source: In case of conflict, special texts will override general texts.
ar: في حالة وجود تعارض، تكون النصوص الخاصة هي السارية.

# applicable_law_heading
source: Applicable Law
ar: القانون المطبق

# applicable_law_points_p1
source: The conditions are governed by the laws of the United Arab Emirates.
ar: تخضع الشروط لأحكام قوانين دولة الإمارات العربية المتحدة.

# applicable_law_points_p2
source: In case of a breach, the Office of Study Missions reserves the right to seek legal recourse.
ar: في حالة حدوث انتهاك، يحتفظ مكتب البعثات الدراسية بالحق في اللجوء إلى القانون.

# applicable_law_points_p3
source: Abu Dhabi courts have jurisdiction over any disputes.
ar: تختص محاكم أبوظبي بالنظر في أي نزاعات.

# governing_law_and_jurisdiction_heading
source: Governing Law and Jurisdiction
ar: القانون واجب التطبيق والمحكمة المختصة

# governing_law_and_jurisdiction_points_p1
source: The legislation of the United Arab Emirates applies to the use of the site and any disputes.
ar: تطبق تشريعات دولة الإمارات العربية المتحدة على استخدام الموقع وأي نزاعات تنشأ.

# governing_law_and_jurisdiction_points_p2
source: The courts of Abu Dhabi are responsible for resolving disputes related to the site.
ar: تكون محاكم أبوظبي مسؤولة عن حل النزاعات المتعلقة بالموقع.

# disclaimer_heading
source: Disclaimer
ar: إخلاء المسؤولية

# disclaimer_description
source: The user acknowledges that the Scholarship Office does not bear any liability arising from direct or indirect damage, in accordance with the rules of contractual or tort liability, whether the damage is caused by the use of the site or the inability to use it.
ar: يقر المستخدم بأن مكتب البعثات الدراسية لا يتحمل أي مسؤولية تنشأ عن الأضرار المباشرة أو غير المباشرة، وفقًا لقواعد المسؤولية التعاقدية أو التقصيرية، سواء كانت الأضرار ناجمة عن استخدام الموقع أو عدم القدرة على استخدامه.

# privacy_policy_heading
source: Privacy Policy
ar: سياسة الخصوصية

# privacy_policy_heading_consent_to_use_of_information
source: Consent to Use of Information
ar: الموافقة على استخدام المعلومات

# privacy_policy_description_consent_to_use_of_information
source: By using the Scholarship Office's website, each user (browser) agrees to this Privacy Policy upon accessing the site and consents to the Scholarship Office collecting, using, or processing the information available to it.
ar: باستخدام موقع مكتب البعثات الدراسية، يوافق كل مستخدم (متصفح) على سياسة الخصوصية هذه عند قيامه بدخول الموقع، كما يوافق على قيام مكتب البعثات الدراسية بجمع المعلومات التي تتوفر لديه، واستخدامها، أو التصرّف فيها.

# privacy_policy_heading_information_collection_and_disclosure_policies
source: Information Collection and Disclosure Policies
ar: السياسات المرتبطة بجمع المعلومات والكشف عنها

# privacy_policy_description_information_collection_and_disclosure_policies
source: The Scholarship Office collects personal information such as name, address, and email when provided voluntarily by the user. The office may also collect additional information such as address, date of birth, and other personal details when users create an account or request services online. Additionally, the Scholarship Office's web service programs automatically collect statistical information about user visits, such as pages visited and browsers used, without linking this information to individual users (see information on 'cookies' – the pages visited by the user).
ar: يجمع مكتب البعثات الدراسية المعلومات الشخصية – مثل: الاسم والعنوان والبريد الإلكتروني – عندما يوفرها المستخدم بإرادته لها، كما يجوز لمكتب البعثات الدراسية أن يجمع معلومات أخرى يقدّمها المستخدمون، مثل: العنوان وتاريخ الميلاد، وغيرها من المعلومات الشخصية، التي يمكنها تحديد الهوية عندما ينشئ المستخدم حسابا أو يطلب الخدمة على الإنترنت. ويجمع كذلك برامج 'مزوّد الويب' الخاصة بمكتب البعثات الدراسية على نحو تلقائي المعلومات الإحصائية حول زيارات المستخدمين، مثل: الصفحات التي يزورونها، وبرامج المستعرض المستخدمة لزيارة موقعنا، ولا يرتبط أيّ من هذه المعلومات بالمستخدم باعتباره فردا (راجع المعلومات حول 'الكوكيز' – ملف الصفحات التي زارها المستخدم).

# privacy_policy_heading_information_usage_and_disclosure_policies
source: Information Usage and Disclosure Policies
ar: السياسات المتعلقة باستخدام المعلومات والكشف عنها

# privacy_policy_description_information_usage_and_disclosure_policies
source: The Scholarship Office may use or disclose user information and other personal data collected from the office and its affiliates for functions such as user account services, report preparation, and other user activities.
ar: يحقّ لمكتب البعثات الدراسية أن يستخدم معلومات المستخدمين أو يكشف عنها، وعن غيرها من المعلومات الشخصية التي جمعها من مكتب البعثات الدراسية والجهات التابعة له، التي تؤدي وظائف، مثل: خدمة حسابات المستخدمين، وتحضير التقارير، وغير ذلك من أنشطة المستخدمين.

# privacy_policy_heading_cookies
source: Cookies
ar: الكوكيز

# privacy_policy_description_cookies
source: A small data string written by the Scholarship Office's provider on the user's hard drive. This technology allows the office to enhance the website for more efficient use.
ar: سلسلة صغيرة من البيانات، يكتبها المزوّد الخاص بمكتب البعثات الدراسية على محرّك القرص الثابت الخاص بالمستخدم، وتسمح هذه التكنولوجيا لمكتب البعثات الدراسية بتطوير موقعه لتحقيق كفاءة أكبر لاستخدام الموقع.

# privacy_policy_heading_links
source: Links
ar: الروابط

# privacy_policy_description_links
source: This website contains links to other sites, and the Scholarship Office is not responsible for those links. Users are advised to review the privacy policies of those sites.
ar: يتضمّن هذا الموقع الإلكتروني روابط لمواقع أخرى، ولا تعدّ مكتب البعثات الدراسية مسؤول عن تلك الروابط، كما ينصح مكتب البعثات الدراسية مستخدميه بالاطّلاع على سياسات الخصوصية الواردة فيه.

# privacy_policy_heading_surveys
source: Surveys
ar: الدراسات الاستقصائية

# privacy_policy_description_surveys
source: The Scholarship Office may occasionally obtain information from users through surveys conducted by the office. Participation in these surveys is voluntary, and users can choose whether or not to disclose this information. Requested information may include contact details used for notifying results and may be used for monitoring or improving the site’s usage.
ar: يحصل مكتب البعثات الدراسية – بين الحين والآخر – على معلومات من المستخدمين عبر دراسات استقصائية يقوم بها، وتكون المشاركة في هذه الدراسات طوعية، ولهذا فإن للمستخدم الخيار في الكشف أو عدم الكشف عن هذه المعلومات، ويجوز أن تشمل المعلومات المطلوبة معلومات الاتصال التي تستخدم في الإخطار عن النتائج، وقد تستخدم بعض المعلومات لأغراض المراقبة أو تحسين استخدام الموقع.

# privacy_policy_heading_security
source: Security
ar: الأمن

# privacy_policy_description_security
source: The Scholarship Office takes necessary precautions to protect user information collected from the website. This information is protected whether online or offline, using encryption for sensitive online information and ensuring confidentiality in all cases.
ar: يتخذ مكتب البعثات الدراسية الاحتياطات اللازمة لحماية المعلومات المُقدّمة من المستخدمين، التي جُمعت من الموقع الإلكتروني، وهذه المعلومات محمية سواء عند الاتصال بالإنترنت أو الخروج منه، ويستخدم مكتب البعثات الدراسية نظام 'التكويد' لحماية أيّ معلومات حسّاسة على الإنترنت، كما يبذل العناية اللازمة لحماية معلومات المستخدم في حالة عدم الاتصال بالإنترنت، وفي جميع الأحوال تُحفظ هذه المعلومات بسرّية، ولا يُمنح حقّ الاطّلاع عليها إلاّ في إطار أداء المهام الوظيفية.

# privacy_policy_heading_notification_of_changes
source: Notification of Changes
ar: الإخطار عن التغييرات

# privacy_policy_description_notification_of_changes
source: If we decide to change our Privacy Policy, we will post those changes on our main page, ensuring users are always aware of the information we collect, how we use it, and under what circumstances.
ar: إذا قرّرنا تغيير سياسة الخصوصية الخاصة بنا، فإننا سننشر تلك التغييرات على صفحتنا الرئيسة، وبهذا يكون المستخدمون على وعي دائم بماهية المعلومات التي نجمعها، وكيف نستخدمها، وتحت أيّ ظروف.

# privacy_policy_heading_updates_to_privacy_policy
source: Updates to Privacy Policy
ar: التحديثات على سياسة الخصوصية

# privacy_policy_description_updates_to_privacy_policy
source: If the Scholarship Office updates the Privacy Policy, the updates will be made available on the main page of the Scholarship Office website for users to review.
ar: في حال حدّث مكتب البعثات الدراسية سياسة الخصوصية، فإن ذلك سوف يتمّ عبر صفحة مكتب البعثات الدراسية الرئيسة، بحيث تكون تلك التحديثات في متناول المستخدمين.

source: Logout
ar: تسجيل خروج

source: Logout success
ar: نجاح تسجيل الخروج

source: Answer Security Question
ar: الإجابة على سؤال الأمان

source: Forgot Security Question
ar: نسيت سؤال الأمان

source: Reset Password
ar: إعادة تعيين كلمة المرور

source: Enter Correct Security Answer
ar: أدخل الإجابة الصحيحة للأمان

source: Select Security Question
ar: اختر سؤال الأمان

source: Write Security Answer
ar: اكتب إجابة الأمان

source: Security Question
ar: سؤال الأمان

source: Write Answer
ar: اكتب الإجابة

# confirmation_title
source: Confirmation
ar: تأكيد

source: Correct
ar: صحيح

# correct_message
source: Password reset completed successfully. Please check your registered email for the new password.
ar: تم إعادة تعيين كلمة المرور بنجاح. يرجى التحقق من بريدك الإلكتروني المسجل للحصول على كلمة مرور جديدة.

source: Wrong
ar: خطأ

# wrong_message
source: Password reset unsuccessful. Please try again.
ar: فشل في إعادة تعيين كلمة المرور. يرجى المحاولة مرة أخرى.

source: CLICK HERE TO LOGIN
ar: انقر هنا لتسجيل الدخول

source: Enter captcha
ar: أدخل الكود

source: Please Enter Captcha
ar: يرجى إدخال كود التحقق

source: Incorrect Captcha
ar: الكود غير صحيح

source: Answer Security Question
ar: أجب على سؤال الأمان

# pleaseEnterCode
source: Please enter the 7 digit code sent to you on your email or mobile to verify your account.
ar: يرجى إدخال الرمز المكون من 7 أرقام الذي تم إرساله إلى بريدك الإلكتروني أو هاتفك المحمول للتحقق من حسابك.

source: Verify
ar: تأكيد

source: Resend verification code
ar: إعادة إرسال رمز تأكيد الحساب

source: Accept Terms and Conditions
ar: قبول الشروط والأحكام

# acceptAndContinue
source: Accept & Continue
ar: قبول ومتابعة

# acceptTermsError
source: Accept Terms and Conditions First
ar: يرجى قبول الشروط والأحكام أولاً

source: Vision, Mission, Values
ar: الرؤية، الرسالة، القيم

# error_fetching_data
source: An error occurred while fetching data.
ar: حدث خطأ أثناء جلب البيانات.

# something_went_wrong
source: Something went wrong with your account. Please try again later or contact the administrator.
ar: حدث خطأ في حسابك. يرجى المحاولة مرة أخرى لاحقًا أو الاتصال بالمسؤول.

source: Password sent successfully
ar: تم إرسال كلمة المرور بنجاح

source: OTP sent successfully
ar: تم إرسال رمز التحقق بنجاح

# error_occurred
source: An error occurred while processing your request.
ar: حدث خطأ أثناء معالجة طلبك.

source: Name can't be empty
ar: الاسم لا يمكن أن يكون فارغاً

# mobileCantBeEmpty
source: Mobile number can't be empty
ar: رقم الهاتف لا يمكن أن يكون فارغاً

source: Inquiry type can't be empty
ar: نوع الاستفسار لا يمكن أن يكون فارغاً

source: Subject can't be empty
ar: الموضوع لا يمكن أن يكون فارغاً

source: Message can't be empty
ar: الرسالة لا يمكن أن تكون فارغة

source: Captcha can't be empty
ar: الرمز المرئي لا يمكن أن يكون فارغاً

source: Captcha does not match
ar: الرمز المرئي لا يتطابق

source: Full Name
ar: الاسم الكامل

source: Mobile
ar: رقم الهاتف

source: Select Inquiry Type
ar: اختر نوع الاستفسار

source: Subject
ar: الموضوع

source: Contact Us
ar: اتصل بنا

source: SEND
ar: إرسال

source: Write To Us-
ar: اكتب لنا-

source: PO Box
ar: صندوق البريد

source: Phone No:
ar: رقم الهاتف:

source: Website:
ar: الموقع الإلكتروني:

# unitedArabEmirates
source: United Arab Emirates - Abu Dhabi
ar: الإمارات العربية المتحدة - أبوظبي

# poBoxTapMessage
source: PO Box tapped:
ar: تم النقر على صندوق البريد:

source: Phone No 1
ar: رقم الهاتف 1

source: Phone No 2
ar: رقم الهاتف 2

source: Phone call permission denied
ar: تم رفض إذن إجراء المكالمات الهاتفية

# invalidArabicName
source: Invalid Arabic name. Please use only Arabic letters.
ar: الاسم العربي غير صالح. يُرجى استخدام الحروف العربية فقط.

# invalidEnglishName
source: Please enter a valid English name
ar: يرجى إدخال اسم إنجليزي صالح

# apply_for_scholarship
source: Apply for a Scholarship
ar: التقديم للحصول على منحة دراسية

source: My Scholarship
ar: منحتي الدراسية

source: Request
ar: طلب

source: Academic Advisor
ar: المستشار الأكاديمي

source: Work Status
ar: حالة العمل

source: Finance
ar: المالية

source: Guidance Notes
ar: ملاحظات التوجيه

source: Step
ar: خطوة

# englishNameAsPassport
source: English name as per Passport
ar: الاسم الانجليزي في جواز السفر

# arabicNameAsPassport
source: Arabic name as per Passport
ar: الاسم العربي في جواز السفر

source: Student Details
ar: بيانات الطالب

source: Family Information
ar: بيانات خلاصة القيد

source: Education Details
ar: البيانات الدراسية

source: Employment History
ar: البيانات الوظيفية

# universityWishList
source: Majors and Universities
ar: التخصصات المرغوبة – التقديم والقبول الجامعي

source: Required Examination
ar: الاختبارات المطلوبة

source: Attachments
ar: المرفقات والمستندات

source: Student Information
ar: معلومات الطالب

source: Name As Passport
ar: الاسم في جواز السفر

# studentNameEnglish
source: Name
ar: الاسم الأول

# studentNameEnglishRequired
source: Name is required
ar: حقل الاسم الأولجباري

# studentNameEnglishWatermark
source: Enter name
ar: ادخل الاسم الأول

# studentNameEnglishValidate
source: Please enter valid name
ar: برجاء ادخال الاسم الأولبشكل صحيح

# fatherNameEnglish
source: Father's name
ar: الاسم الثاني

# fatherNameEnglishRequired
source: Father's name is required
ar: حقل الاسم الثاني اجباري

# fatherNameEnglishWatermark
source: Enter father's name
ar: ادخل الاسم الثاني

# fatherNameEnglishValidate
source: Please enter valid father's name
ar: برجاء ادخالا لاسم الثاني بشكل صحيح

# grandfatherNameEnglish
source: Grandfather's name
ar: الاسم الثالث والرابع
