Repository: abhay-kumar-LogiclyInfotech/SCO_v1
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Next
ar: التالي

source: Previous
ar: السابق

source: Save Draft
ar: حفظ كمسودة

source: Select
ar: اختر

source: Yes
ar: نعم

source: No
ar: لا

# registrationForm
source: Sign Up
ar: إنشاء حساب جديد

source: Other
ar: اخرى

source: Review
ar: مراجعة

source: Print
ar: طباعة

# invalidMilitaryDateSelection
source: Invalid Start date/End date combination. Must be 16 month gap.
ar: تاريخ البداية والنهااية غير متوافقين . يجب الا تقل الفترة الزمنية بينهما عن 16 شهراً.

# contactInformation
source: Phone Details
ar: بيانات الاتصال

# registrationEmailAddress
source: Email address
ar: البريد الالكتروني

# registrationEmailAddressRequired
source: Email address is required
ar: حقل البريد الالكتروني اجباري

# registrationEmailAddressWatermark
source: Enter email address
ar: ادخل البريد الالكتروني

# registrationEmailAddressValidate
source: Please enter valid email address
ar: برجاء ادخال البريد الالكتروني بشكل صحيح

# mobileHint
source: Enter a valid phone number such as 971###-####
ar: ادخل رقم هاتف صحيح مثل \#\#\#\#\#\#\#\#\#971

# registrationPassword
source: Password
ar: كلمة المرور

# registrationPasswordRequired
source: Password is required
ar: حقل كلمة المرور اجباري

# registrationPasswordWatermark
source: Enter password
ar: أدخل كلمة المرور

# registrationPasswordValidate
source: Please enter valid password
ar: برجاء ادخال كلمة المرور بشكل صحيح

# emiratesIdExists
source: User account with this emirates id is already exists.
ar: يوجد لدينا حساب مسجل برقم الهوية الإماراتية الذى ادخلته.

# emailAddressExists
source: User account with this email address already exists.
ar: يوجد لدينا حساب مسجل بالبريد الإلكتروني الذى ادخلته.

# phonenumberExists
source: User account with this mobile number already exists.
ar: يوجد لدينا حساب مسجل برقم الهاتف المتحرك الذى ادخلته.

# registrationFailed
source: Unable to register user, Please try again later.
ar: لم يتم تسجيل المستخدم . برجاء المحاولة مرة اخرى

# submissionPhoneType
source: Phone Type
ar: نوع الهاتف

# submissionPhoneTypeRequired
source: Phone Type is required
ar: حقل نوع الهاتف اجباري

# submissionCountryCode
source: Country Code
ar: كود الدولة

# submissionCountryCodeRequired
source: Country Code is required
ar: حقل كود الدولة اجباري

# submissionPreferred
source: Preferred
ar: الهاتف المفضل

# submissionPhoneNumber
source: Phone Number
ar: رقم الهاتف

# submissionConfirmationMsg
source: Are you sure? You want to submit this Application
ar: هل انت متأكد من الرغبة في تقديم هذا الطلب؟

# submissionConfirmation
source: Confirmation
ar: تأكيد

# submissionYes
source: Yes
ar: نعم

# submissionNo
source: No
ar: لا

# submissionSuccessMessage
source: Your application is submitted successfully, Your application is :
ar: لقد تم تقديم الطلب بنجاح، رقم الطلب هو:

# submissionErrorMessage
source: Unable to submit the application, Please try again later.
ar: لا يمكن تقديم الطلب حالياً، برجاء المحاولة لاحقاً

source: Choose File
ar: اختر الملف

source: Application Submission
ar: طلب البعثة الدراسية

# loginUsername
source: Emirates Id or Email or Mobile
ar: رقم الهوية، البريد الالكتروني أو رقم الهاتف المتحرك

# loginUsernameRequired
source: Enter emirates id or email or Mobile
ar: ادخل رقم الهوية، البريد الالكتروني أو رقم الهاتف المتحرك

# loginUsernameWatermark
source: Enter emirates id or email or Mobile
ar: أدخل البريد الإلكتروني أو رقم الهوية أو رقم الهاتف

# loginUserNotExists
source: The email or phone number or emirates id you’ve entered doesn’t match any account.
ar: رقم الهوية، البريد الالكتروني أو رقم الهاتف المتحرك المدخل لا يطاابق أياً من الحسابات المسجلة

# loginFailed
source: Login failed, Invalid login details.
ar: فشل تسجيل الدخول! بيانات الحساب غير صحيحة

# highschoolSubjects
source: Subject Details
ar: بيانات المواد الدراسية

source: Nationality
ar: الجنسية

# nationalityRequired
source: Please select the nationality
ar: برجاء اختيار الجنسية

# nationalityWatermark
source: Select nationality
ar: اختر الجنسية

source: National Id
ar: الرقم القومي

# nationalIdRequired
source: Please enter national id
ar: برجاء ادخال الرقم القومي

# nationalIdWatermark
source: Enter national id
ar: ادخل الرقم القومي

# userRegister
source: Register
ar: إنشاء حساب

# passwordTooltip
source: The password must consist of at least eight characters, and must contain as a minimum a number, a lowercase letter, an uppercase letter, and a special character such as ($#&@)
ar: كلمة المرور يجب ان تتكون على الأقل من ثمانية خانات، على أن تحتوي كحد أدنى على رقم وحرف صغير وحرف كبير وحرف خاص مثال ($\#&@)

# userAccountVerified
source: You have successfully verified your account.
ar: لقد تم تأكيد الحساب بنجاح.

# proceedForLogin
source: Please proceed for login as using below link
ar: للدخول لحسابك يرجي المتابعة بالضغط على الرابط أدناه

# clickHereToLogin
source: click here for login
ar: اضغط هنا لتسجيل الدخول

# askForVerificationCode
source: Please enter the 7 digit code sent to you on your email or mobile to verify your account.
ar: الرجاء إدخال رمز تأكيد الحساب المكون من 7 أرقام والذي تمّ إرساله إلي بريدكم الإلكتروني أو عبر رسالة نصية إلي رقم هاتفكم المتحرك.

# registrationSuccess
source: Your account is successfully registered.
ar: لقد تمّ التسجيل بنجاح

# pageNotFound
source: The page you trying to access is unavailable.
ar: الصفحة التي تحاول الوصول إليها غير متاحة حالياً.

# invalidCode
source: The verification code you entered is invalid, Please enter correct the code.
ar: كود تأكيد الحساب الذي أدخلته غير صحيح، برجاء ادخال الكود بشكل صحيح.

# codeExpired
source: The verification code you entered is expired, Please generate new code.
ar: كود تأكيد الحساب الذي أدخلته منتهي الصلاحية، برجاء اصدار كود جديد.

# codeStillValid
source: New verification code is generate and sent to you, Please check the verification code on email or mobile.
ar: لقد تم اصدار وارسال كود جديد لتأكيد الحساب، برجاء مراجعة البريد الإلكتروني أو الهاتف المتحرك.

# unableToVerify
source: Unable to verify user, Please try again after some time.
ar: غير قادر على تأكيد بيانات المستخدم، برجاء المحاولة مجدداً بعد قليل.

# alreadyVerified
source: Your account is already verified, Please login to access the system.
ar: لقد تم تأكيد الحساب بنجاح، برجاء تسجيل الدخول للوصول الى النظام.

source: Verification code
ar: كود تأكيد الحساب

# verificationCodeRequired
source: Please enter verification code
ar: حقل كود تأكيد الحساب مفضول

# submissionConfigTitle
source: Submission Configuration
ar: إعدادات التقديم

# submissionConfigurationKey
source: Configuration Key
ar: رمز الإعدادات

# submissionConfigurationKeyRequired
source: Please enter configuration key
ar: برجاء إدخال رمز الإعدادات

# submissionConfigurationKeyWatermark
source: Enter Configuration Key
ar: إدخل رمز الإعدادت

# submissionConfigurationKeyValidator
source: Please enter valid Configuration Key
ar: برجاء إدخال رمز إعدادت صحيح

# submissionSelect
source: Select
ar: إختر

# submissionAcadmicCareer
source: Academic career
ar: المسار الإكاديمية

# submissionAcadmicCareerRequired
source: Please select Academic career
ar: برجاء إختيار المسار الأكاديمي

# submissionInstitution
source: Institution
ar: المعهد

# submissionInstitutionRequired
source: Please select institution
ar: برجاء إختيار المعهد

# submissionAcademinProgram
source: Academic program
ar: البرنامج الإكاديمي

# submissionAcademinProgramRequired
source: Please select academic program
ar: برجاء إختيار برنامج أكاديمي

# submissionProgramStatus
source: Program status
ar: حالة البرنامج

# submissionProgramStatusRequired
source: Please select program status
ar: برجاء إختيار حالة البرنامج

source: Submission Start Date
ar: تاريخ بدء التقديم

# submissionStartDateRequired
source: Please select start date
ar: برحاء إختيار تاريخ بدء التقديم

# submissionStartDateWatermark
source: Select start date
ar: إختر تاريخ بدء التقديم

# submissionStartDateValidate
source: Please enter valid start date
ar: برجاء إدخال تاريخ بدء تقديم صحيح

source: Submission End Date
ar: تاريخ إنتهاء التقدم

# submissionEndDateRequired
source: Please select end date
ar: برجاء إختيار تاريخ الإنتهاء

# submissionEndDateWatermark
source: Select end date
ar: إختر تاريخ الإنتهاء

# submissionEndDateValidate
source: Please enter valid end date
ar: برجاء إختيار إنتهاء صحيح

# submissionCampus
source: Campus
ar: الحرم الجامعي

# submissionCampusRequired
source: Please select campus.
ar: برجاء إختيار الحرم الجامعي.

# submissionConfigSuccess
source: Configuration successfully saved.
ar: تم حفظ الإعدادات بنجاح.

# submissionConfigFailed
source: Failed to save the configuration. Please check the data and submit again
ar: حدث خطأ فى حفظ الإعدادات. برجاء التحقق من البيانات المدخله و المحاولة مرة أخرى

# submissionPlan
source: Academic Plan
ar: الخطة الأكاديمية

# submissionPlanRequired
source: Please select academic plan.
ar: برحاء إختيار الخطة الأكاديمية.

# profilePhoneNumber
source: Phone number
ar: رقم الهاتف

source: Country Code
ar: رمز البلد

source: Application Number
ar: رقم الطلب

source: View Details
ar: عرض التفاصيل

# myApplications
source: My Application
ar: طلباتي

source: My Account
ar: حسابي

# profilePicsMaxSize
source: Files larger than 5MB cannot be attached
ar: لا يمكن إرفاق ملفات يتخطى حجمها 5 ميغابايت

source: My Finance
ar: معلوماتي المالية

source: Back
ar: رجوع

# myRequests
source: Requests
ar: الطلبات

# unsupportedProfileImage
source: Unsupported files, only jpeg,jpg are allowed
ar: يمكن قبول صور ملف صورة بيريت

source: Update Profile
ar: تحديث ملف المستخدم

source: Update
ar: تحديث

# personaldetailSuccess
source: User personal details updated successfully.
ar: تم تحديث البيانات الشخصية بنجاح.

# personaldetailFailed
source: Failed to updated user personal details.
ar: فشل في تحديث البيانات الشخصية.

source: Edit
ar: تعديل

# hsnameOther
source: Other high school name
ar: اسم مدرسة ثانوية اخرى

# hsnameOtherRequired
source: Other high school name is required
ar: حصقل اسم مدرسة ثانوية اخرى اجباري

# hsnameOtherWatermark
source: Enter other high school name
ar: ادخل اسم مدرسة ثانوية اخرى

# hsnameOtherValidate
source: Enter valid other high school name
ar: برجاء ادخال اسم مدرسة ثانوية اخرى

# duplicateHsnameOtherMessage
source: This school level is already selected, Please select any other school level
ar: مستوو9 المدرسة الثانوية تم ادخاله مسبقاً، برجاء اختيار مستوى آخر

# duplicateHsSubjectMessage
source: This subject is already selected, Please select any other subject
ar: هذا الموضوع تم ادخاله مسبقاً، برجاء ادخال موضوع آخر

# duplicateExaminationMessage
source: Combination of examination name and examination type already entered, Please select any other combination.
ar: تركيبة اسم الاختبار ونوعه تم ادخالها مسبقاً، برجاء اختيار تركيبة اخرى

source: Curriculum average
ar: المعدل أو النسبة

# curriculumAverageRequired
source: Please enter the curriculum average
ar: حقل المعدل أو النسبة اجباري

# curriculumAverageWatermark
source: Enter the curriculum average
ar: ادخل المعدل أو النسبة

# curriculumAverageValidate
source: Please enter the valid curriculum average. Combination of alphabets and numbers
ar: برجاء ادخال المعدل أو النسبة بشكل صحيح

source: Curriculum scale
ar: المقياس- الدرجة النهائية

# curriculumScaleRequired
source: Please enter curriculum scale
ar: حقل المقياس- الدرجة النهائية اجباري

# curriculumScaleWatermark
source: Enter curriculum scale
ar: ادخل المقياس- الدرجة النهائية

# curriculumScaleValidate
source: Please enter the valid curriculum scale. Combination of alphabets and numbers
ar: برجاء ادخال المقياس- الدرجة النهائية بشكل صحيح

source: Other major
ar: تخصص آخر

# otherMajorRequired
source: Please enter other major
ar: حقل تخصص آخر اجباري

# otherMajorWatermark
source: Enter other major
ar: ادخل تخصص آخر

# otherMajorValidate
source: Enter valid other major data
ar: برجاء ادخال تخصص آخر بشكل صحيح

source: Highest Qualification
ar: المؤهل الدراسي الأعلى

# highestQualificationRequired
source: Please select highest qualification
ar: حقل المؤهل الدراسي الأعلى اجباري

source: Employment start date
ar: تاريخ بداية العمل

# employmentStartDateRequired
source: Please select employment start date
ar: حقل تاريخ بداية العمل اجباري

# employmentStartDateWatermark
source: Select start date
ar: اختر تاريخ بداية العمل

source: Employment end date
ar: تاريخ نهاية العمل

# employmentEndDateRequired
source: Please select employment end date
ar: حقل تاريخ نهاية العمل اجباري

# employmentEndDateWatermark
source: Select end date
ar: اختر تاريخ نهاية العمل

# cohortTag
source: Batch
ar: الدفعة

# cohortTagRequired
source: Please select batch
ar: حقل الدفعة اجباري

source: Scholarship type
ar: نوع البعثة الدراسية

# draftApplicationFound
source: We found the draft version for your application, Do you want to proceed further with it?
ar: لقد تم العثور على مسودة طلب محفوزة مسبقاً. هل ترغب في استئناف تعبئة نموزج الطلب من هزه المسودة؟

# draftSaveConfirmation
source: Draft saved successfully
ar: تم حفظ مسودة الطلب بنجاح

# draftSaveError
source: Error in saving data as draft, Please try again later.
ar: لم يتم حفظ مسودة الطلب بنجاح، برجاء المحاولة مجدداً لاحقاً.

source: Add Row
ar: اضافة سجل

source: Delete Row
ar: حذف سجل

source: Comments
ar: الملاحظات

# commentsWatermark
source: Enter comments
ar: برجاء ادخال الملاحظات

source: Currently Studying
ar: تدرس في الجامعة حالياً

# currentlyStudyingRequired
source: Please select currently studying
ar: حقل تدرس في الجامعة حالياً اجباري

source: Last term
ar: الفصل الدراسي الأخير

# lastTermRequired
source: Please select last term
ar: حقل الفصل الدراسي الأخير اجباري

# duplicateWishUniversity
source: Selected university is already selected, Please select other university.
ar: لقد تم اختيار الجامعة مسبقاً، برجاء اختيار أخرى.

# noDraftAvailable
source: There is no draft available
ar: لا توجد مسودات طلب محفوظة مسبقاً

# savedApplication
source: Previously saved scholarship application
ar: مسودة طلب بعثة دراسية محفوض مسبقاً

# submitDraftScholarship
source: Edit Draft
ar: تعديل المسودة

# deleteDraftApplication
source: Delete Draft
ar: حذف المسودة

source: My Scholarship
ar: بعثتي الدراسية

source: Scholarship Details
ar: تفاصيل البعثة الدراسية

# nameOfScholarship
source: Scholarship Name
ar: اسم البعثة الدراسية

source: Scholarship Start Date
ar: تاريخ بداية البعثة الدراسية

source: Scholarship End Date
ar: تاريخ نهاية البعثة الدراسية

# scholarshipApprovedDate
source: Approved Date
ar: تاريخ القبول في البعثة

source: Program Duration
ar: مدة البرنامج الدراسي

source: Ok
ar: موافق

# duplicatePhoneType
source: Selected phone type is already entered, Please select other phone type.
ar: تم إختيار نوع الهاتف المحدد مسبقاً، يرجى إختيار نوع هاتف أخر

source: Draft Application
ar: إستكمال الطلب

# submissionAgree
source: I agree, All information is correct and filled properly
ar: أقر وأتعهد بأن كافة البيانات المذكورة صحيحة، وكزلك أقر بعلمي أن طلب التقديم للبعثة سوف يخضع للتقييم من قبل المكتب، ولا يعني بالضرورة ضمان الحصول عليها

# submissionAgreeRequired
source: Please select the agree
ar: برجاء الاقرار بصحة البيانات

# addRowPhone
source: Add Phone
ar: اضافة رقم هاتف

# addRowAddress
source: Add Address
ar: اضافة عنوان

# addRowHighschool
source: Add High School
ar: اضافة صف دراسي (يرجى إضافة شهادة الصف الثاني عشر النهائية في حال توفرها)

# addRowGraduation
source: Add Degree
ar: إضافة مؤهل جامعي

# addRowMajor
source: Add Major
ar: اضافة تخصص

# addRowUniversity
source: Add University
ar: إضافة قبول جامعي

# addRowExamination
source: Add Examination
ar: اضافة تخجيم جامعي

# duplicateMajorFound
source: Selected major already added to wish list, Please add any other major
ar: هذا التخصص تم اضافته من قبل. يرجي اختيار تخصص اخر.

# loginHints
source: Enter emirate id like 78419852341234... Phone number like 971####### or email id
ar: برجاء ادخال البريد الإلكتروني او رقم الهاتف المتحرك مثال\: #########971 او رقم الهوية مثال\: 784123412345671

# internalBachelor
source: Bachelor scholarship in UAE
ar: برنامج المنح الدراسية - درجة البكالوريوس

# internalPostgraduate
source: Post graduation scholarship in UAE
ar: برنامج المنح الدراسية - الدراسات العليا

# internalMeterological
source: Meterological scholarship in UAE
ar: منحة الأرصاد الجوية

# externalBachelor
source: Bachelor scholarship outside UAE
ar: بعثة صاحب السمو رئيس الدولة للطلبة المتميزين علميًا - درجة البكالوريوس

# universityAndMajor
source: Universities and Majors
ar: التخصصات والقبول الجامعي

# externalPostgraduate
source: Post graduation scholarship outside UAE
ar: بعثة صاحب السمو رئيس الدولة للطلبة المتميزين علميًا - الدراسات العليا

# externalDoctors
source: Doctorate Graduation outside UAE
ar: بعثة صاحب السمو رئيس الدولة للأطباء المتميّزين

# allowedFileTypePdf
source: Select only pdf file
ar: pdf : أنواع الملفات المسموح بها

# allowedFileTypeImage
source: Select only image file with following jpeg,jpg extension
ar: jpeg,jpg : أنواع الملفات المسموح بها

# allowedFileTypeBoth
source: Allowed file extensions are jpeg,jpg,png,pdf
ar: jpeg,jpg,png,pdf : أنواع الملفات المسموح بها

# invalidGrade
source: Please enter grade as A+, A, A-, or number between 1 to 100
ar: ادخل درجات المعدل المناسبة مثل حروف التقييم او الأرقام من 1 الى100

source: Draft
ar: مسودة

# scholarshipInternal
source: Internal Scholarship
ar: منح داخل الدولة

# scholarshipExternal
source: External Scholarship
ar: بعثات خارج الدولة

# draftApplicationTitle
source: Draft Application
ar: مسودة الطلب

# addRowRelativeInfo
source: Add relative info
ar: اضافة قريب مبتعث

# deleteRowRelativeInfo
source: Delete relative info
ar: حذف قريب مبتعث

source: Major Wish list
ar: التخصصات المطلوبة

source: University Wish List
ar: التقديم والقبول الجامعي

# militaryReason
source: Reason
ar: السبب

# militaryReasonRequired
source: Please enter military reason
ar: حقل السبب اجباري

# militaryReasonWatermark
source: Enter military reason
ar: ادخل السبب يرجى ارفاق شهادة التأجيل أو الاعفاء في صفحة المرفقات

# militaryReasonValidate
source: Enter valid military reason
ar: برجاء ادخال السبب بشكل صحيح

# hsYearOfGraduation
source: Year of passing
ar: عام التخرج

# hsYearOfGraduationRequired
source: Please select year of passing
ar: حقل عام التخرج اجباري

# hsYearOfGraduationWatermark
source: Select year of passing
ar: اختر عام التخرج

# hsYearOfGraduationValidate
source: Please enter valid year of passing
ar: برجاء اختيار عام التخرج بشكل صحيح

# postpond
source: Postponed
ar: تأجيل

# relief
source: Relief or Exemption
ar: إعفاء

source: Other Subject
ar: مادة أخرى

# otherSubjectRequired
source: Please select other subject type
ar: حقل نوع مادة أخرى اجباري

# otherSubjectNameRequired
source: Please enter other subject name
ar: حقل اسم مادة أخرى اجباي

# otherSubjectNameValidate
source: Enter valid other subject name, Max length is 25 char
ar: يجب ألا يتجاوز عدد الأحرف 25 حرفاً ولايسمح بإستخدام الرموز

source: Other subject name
ar: اسم مادة أخرى

source: Add other subject
ar: اضافة مادة أخرى

# removeOtherSubject
source: Delete other subject
ar: حزف مادة أخرى

# familyEmirates
source: Emirates
ar: الإمارة

# familyEmiratesRequired
source: Emirates is required
ar: الإمارة اجباري

# familyEmiratesWatermark
source: Select emirates
ar: ادخل رقم الهوية الإمارة

# familyEmiratesValidate
source: Please select valid emirates
ar: ادخال الإمارة بشكل صحيح

# onlyChar
source: Entered data is not valid, Please enter data without space, number or special character.
ar: برجاء عدم ادخال مسافات او ارقام او علامات خاصة

# charWithSpace
source: Entered data is not valid, Please enter data without number or special character.
ar: برجاء عدم ادخال او ارقام او علامات خاصة

source: Academic career
ar: المسار الإكاديمية

# onlyArabicOrEnglishChar
source: Enter only English or Arabic character without number or special char. Space is not allowed at end.
ar: برجاء ادخال الحروف العربية او الإنجليزية فقط بدون الأرقام أو العلامات الخاصة. كذلك لا يمكن إدخال مسافات في النهاية.

# englishOrArabicWithNumber
source: Enter only English or Arabic character with number. Space is not allowed at end.
ar: برجاء إدخال الحروف العربية أو الإنجليزية أو الأرقام فقط بدون العلامات الخاصة . كذلك لا يمكن إدخال مسافات في النهاية.

# onlyArabicChar
source: Only Arabic character allowed and space is allowed. No digit, No special character and space is not allowed at end
ar: برجاء إدخال الحروف العربية والمسافات فقط بدون الأرقام أو العلامات الخاصة. كذلك لا يمكن إدخال مسافات في النهاية.

# onlyEnglishChar
source: Only English character allowed and space is allowed. No digit, No special character and space is not allowed at end
ar: برجاء إدخال الحروف الإنجليزية والمسافات فقط بدون الأرقام أو العلامات الخاصة. كذلك لا يمكن إدخال مسافات في النهاية.

# numberWithDecimal
source: Only number with one decimal point is allowed. Space is not allowed at end
ar: برجاء إدخال الأرقام مع العلامات العشرية فقط. كذلك لا يمكن إدخال مسافات في النهاية.

# numberOnly
source: Only number is allowed. No special character, no alphabets, no decimal point. Space is not allowed at end
ar: برجاء إدخال الأرقام مع العلامة العشرية فقط بدون الحروف أو العلامات العشرية. كذلك لا يمكن إدخال مسافات في النهاية.

# phoneNumberOnly
source: Please enter valid phone number, Phone number must not start with 0.
ar: يرجي إدخال رقم الهاتف بشكل صحيح بدون صفر ويبدأ برقم خمسة.

# internationalUndergraduateInternal
source: Undergraduate International Scholarship Internal
ar: الطلاب الدوليين داخل الدولة - بكالوريوس

# internationalPostgraduateInternal
source: Postgraduation International Scholarship Internal
ar: الطلاب الدوليين داخل الدولة - دراسات عليا

# internationalUndergraduateExternal
source: Undergraduate International scholarship External
ar: الطلاب الدوليين خارج الدولة - بكالوريوس

# internationalPostgraduateExternal
source: Postgraduation International Scholarship External
ar: الطلاب الدوليين خارج الدولة - دراسات عليا

# mopaEmployeeUndergraduate
source: Under graduation Scholarship for MOPA Employees
ar: برنامج المنح الدراسية - درجة البكالوريوس - موظفي وزارة شؤون الرئاسة

# mopaEmployeePostgraduate
source: Postgraduation Scholarship for MOPA Employees
ar: برنامج المنح الدراسية - الدراسات العليا - موظفي وزارة شؤون الرئاسة

# mopaSubEmployeeUndergraduate
source: User Graduation Scholarship for MOPA Subsidiary Organization Employees
ar: برنامج المنح الدراسية - درجة البكالوريوس - موظفي الجهات التابعة

# mopaSubEmployeePostgraduate
source: Post Graduation Scholarship for MOPA Subsidiary Organization Employee
ar: برنامج المنح الدراسية - الدراسات العليا - موظفي الجهات التابعة

# ddsUniversity
source: Hospital/University
ar: اسم الجامعة / المستشفى

# ddsUniversityRequired
source: Please Enter Hospital name
ar: حقل اسم الجامعة / المستشفى اجباري

# ddsUniversityWatermark
source: Enter Hospital name
ar: ادخل اسم الجامعة / المستشفى

# ddsMajor
source: Medical Specialists
ar: التخصص

# ddsMajorRequired
source: Please enter Medical Specialists
ar: حقل التخصص الطبي اجباري

# ddsMajorWatermark
source: Enter Medical Specialists
ar: ادخل التخصص الطبي

# ddsMajorValidate
source: Please enter valid Medical Specialists
ar: برجاء ادخال التخصص الطبي بشكل صحيح

# ddsExamination
source: Medical Licensing Exams
ar: اختبارات التراخيص الطبية

# ddsExaminationRequired
source: Please select Medical Licensing Exams
ar: حقل امتحان التراخيص الطبية اجباري

# uploadAttachmentFailed
source: Failed to upload attachments
ar: لم يتم تحميل المرفقات بنجاح

# uploadInvalidFile
source: Attach file is invalid, Please upload it again.
ar: ملف المرفقات غير صحيح، برجاء اعادة التحميل مجدداً

source: Student Id
ar: رقم الطالب

source: Application Type
ar: نوع الطلب

# addAttachment
source: Add file
ar: إضافة مرفق

source: Email Details
ar: تفاصيل البريد الالكتروني

source: Email Type
ar: نوع البريد الالكتروني

# emailTypeRequired
source: Email Type is required
ar: برجاء إختيار نوع البريد الالكتروني

# fileUploadSuccessfully
source: File uploaded successfully
ar: فشل في رفع الملفات

# fileUploadFailed
source: Failed to upload files
ar: فشل في رفع الملفات

# employmentStatusSuccess
source: Employment status updated successfully
ar: تم تحديث الوظيفة بنجاح
