Repository: abhay-kumar-LogiclyInfotech/SCO_v1
Catalog: lib/l10n/app_*.arb
Languages: ar

# employmentStatusFailed
source: Employment status updated failed
ar: فشل في تحديث بيانات الوزيفة

source: Employment Status Details
ar: تفاصيل حالة التوظيف

source: Employment Status
ar: الحالة الوزيفيه

# employmentStatusRequired
source: Employment Status
ar: برجاء إختيار نوع الحالة الوزيفيه

source: Add email
ar: إضافة عنوان بريد إلكتروني

source: No record found
ar: لا يوجد سجلات

# examinationForDds
source: Medical licensing examination
ar: اختبارات التراخيص الطبية

# languageRequired
source: Please select default interface language
ar: حقل لغة لغة الواجهة الالفتراضية

# alreadyApplied
source: You have already submitted application for this year. Visit the link below to check updated application status.
ar: لا يمكن تقديم طلب اخر بنفس السنة حيث انك قد قمت بتقديم طلب مسبقاً. قم بالضغط علي الرابط أدناه للتحقق من حالة طلبك.

source: Click Here
ar: انقر هنا

source: Upload Picture
ar: تحميل الصورة

# countryAndUniversity
source: Country - University
ar: الدولة - الجامعة

# subscriberRequired
source: Please select the subscriber to send message
ar: برجاء إختيار مشترك واحد أو أكثر

# inviteExpired
source: We are sorry to inform you scholarships invites sent to you is expired.
ar: نأسف لإبلاغك بأن دعوة تسجيل البعثة الدراسية الخاصة بك إنتهت صلاحيتها.

# deleteDraftConfirmation
source: Are you sure you want to delete Draft?
ar: هل أنت متأكد أنك تريد حزف المسودة؟

# emailNotMatch
source: Registered email address is not matching with invitation. Please try updating the registered email address.
ar: البريد الالكتروني الذي تم تسجيل الدخول به غير مطاابق للبريد الالكتروني المرسل إليه الدعوة. يرجي تحديث بريدك الالكتروني.

# applicationUpdateSuccess
source: Application Updated Successfully
ar: تم تحديث الطلب بنجاح

# applicationUpdateFailed
source: Failed to Updated Application
ar: فشل في تحديث التطبيق

# applicationUpdateConfirm
source: Are you sure, You want to submit this request?
ar: هل أنت متأكد أنك تريد تقديم الطلب؟

# failedToUpdateNewRecord
source: Unable to add new, Please contact system admin
ar: لا يمكن إضافة البيانات. برجاء الاتصال بالدعم الفني

# uaeMother
source: Is Mother UAE National?
ar: أبناء مواطنات

# examinationTitle2
source: (IELTS/TOEFL/EMSAT/SAT/AP/etc)
ar: برجاء إدخال درجات جميع الإختبارات التى تم إجتيازها

# filenameSizeError
source: Filename should not greater than 50 char, Please rename file and try again later.
ar: الحد الاقصى لإسم الملف يجب أن لا يتعدى 50 حرف. يرجي تعديل اسم الملف و المحاولة مرة أخرى.

# ddsOtherUniversityRequired
source: Medical Specialists is required
ar: يجب ادخال التخصص

# ddsOtherMajorRequired
source: Hospital/University is required
ar: يجب ادخال اسم المستشفى او الجامعة

# titleStep
source: Student undertaking
ar: إقرار وتعهد الطالب

# studentUndertakingRequired
source: You cannot proceed with the application without the acknowledgement and undertaking.
ar: .لايمكن تقديم الطلب بدون الموافقة الاقرار و التعهد

# studentUndertaking
source: .أقر بموافقتي والتعليق علي ما ورد اعلاه
ar: .أقر بموافقتي واطلاعي علي ما ورد اعلاه

source: Document Uploaded
ar: تم تحميل المستند

# scholarshipTypeInternal
source: Scholarship In UAE
ar: منح داخل الدولة

# scholarshipTypeExternal
source: Scholarship Abroad
ar: بعثات خارج الدولة

# scholarshipTypeInternalBachelor
source: Bachelor's degree scholarship
ar: درجة البكالوريوس

# scholarshipTypeInternalMaster
source: Graduate Studies Scholarship
ar: الدراسات العليا

# scholarshipTypeInternalMeteorological
source: Meteorological
ar: الأرصاد الجوية

# scholarshipTypeExternalBachelor
source: Bachelor's degree scholarship
ar: درجة البكالوريوس

# scholarshipTypeExternalMaster
source: Graduate Studies Scholarship
ar: الدراسات العليا

# scholarshipTypeExternalDds
source: Distinguished Doctors Scholarship
ar: بعثة الأطباء المتميزين

# scholarshipApply
source: Apply
ar: تقديم طلب

# scholarshipTypeTitle
source: Type
ar: نوع الطلب

# scholarshipSubTypeTitle
source: Academic Career
ar: المؤهل المطلوب

# schoolCountry
source: Country
ar: مكان المدرسة

# majorsWish1
source: First Desire Major
ar: الاختيار الأول

# majorsWish2
source: Second Desire Major
ar: الاختيار الثاني

# majorsWish3
source: Third Desire Major
ar: الاختيار الثالث

source: Manager Email
ar: البريد الالكتروني للمسؤول المباشر

# ddsGraduationTitle
source: Current academic year or university qualification
ar: السنة الدراسية الحالية او المؤهل الجامعي

# ddsGraduationTitle2
source: Current academic year or university qualification
ar: السنة الدراسية/المؤهل الجامعي

# ddsGradQuestion
source: Are you currently receiving a scholarship or grant from another party?
ar: هل تتلقى حاليا بعثة و منحة من جهة أخري؟

# ddsMajor1
source: Program and specialization required
ar: البرنامج والتخصص المطلوب

# ddsAcadProgram
source: Program
ar: البرنامج

# ddsUniversityWishlist
source: University application and admission (for graduate doctors only)
ar: التقديم والقبول الجامعي (للأطباء الخريجين فقط)

# ddsExams
source: To medical licensing exams (only for medical students or graduate doctors who have passed the first or second part of the licensing exam)
ar: اختبارات التراخيص الطبية (فقط لطلبة الطب أو الأطباء الخريجين الذين اجتازوا الجزء الأول او الثاني من امتحان التراخيص)

# ddsMajor1Required
source: Please select the program
ar: برجاء ادخال البرنامج

# ddsGradQuestionRequired
source: Please answer the above question.
ar: برجاء الاجابة

# ddsWishlist
source: Doctor Wishlist
ar: التقديم والقبول الجامعي (للأطباء الخريجين فقط)

# studentGuidelineInternational
source: أقرّ وأتعهّد أنا المتقدّم بطلب (بعثة/ منحة) دراسية إلى "مكتب البعثات الدراسية" بالعلم والالتزام بال آتي: 1-صحّة ودقّة البيانات المقدّمة في هذا الطلب. 2-تعبئة الحقول الإلزامية كافة، والحقول غير الإلزامية في حال توفّر البيانات والدرجات. 3-إرفاق المستندات المطلوبة كافة على أن تكون سارية المفعول. 4-سيتم رفض الطلب تلقائيًا في حال نقص (المستندات، البيانات، الدرجات)، وعدم دقّة الدرجات المُدخلة. 5-اعتبار الطلب مُكتملًا بعد استلامي رسالة بنجاح تقديم الطلب وحصولي علي رقم الطلب. 6-الإدلاء بالمعلومات المتعلّقة بالبعثات والمنح الدراسية كافة التي حصلت عليها من جهات أخرى.
ar: أقرّ وأتعهّد أنا المتقدّم بطلب (بعثة/ منحة) دراسية إلى "مكتب البعثات الدراسية" بالعلم والالتزام بالآتي\: 1-إنجيونجياة وودقّة البيانات المقدّمة في هذا الطلب. 2-تعبئة الحقول الإلزامية كافة، والحقول غير الإلزامية في حال توفّر البيانات والدرجات. 3-إرفاق المستندات المطلوبة كافة على أن تكون سارية المفعول. 4-سيتم رفض الطلب تلقائيًا في حال نقص (المستندات). 5-في حال نقص بيانات، جيفيني مرجوعها، ويكون التقديم شبه منفدق.

# pgrdAdacProgram
source: Academic Program
ar: المؤهل المطلوب

# pgrdMajorWishlist
source: Major Wishlist
ar: المؤهل والتخصصات المطلوبة

# pgrdAdacProgramRequired
source: Academic Program Required
ar: يرجى اختيار المؤهل المطلوب

# studentGuidelineHchl
source: أقرّ وأتعهّد أنا المتقدّم بطلب الالتحاق ببرنامج التحضير الجامعي لطلبة الصف العاشر والحادي عشر بالعلم والالتزام بالآتي: 1- صحّة ودقّة البيانات وتعبئة الحقول الإلزامية كافة، والحقول غير الإلزامية في حال توفّر البيانات والدرجات، وارفاق مستندات سارية المفعول. 2- سيتم رفض الطلب تلقائيًا في حال نقص (المستندات، البيانات، الدرجات)، وعدم دقّة الدرجات المُدخلة. <span style="color:red">3- سيتم رفض الطلب تلقائيا في حال التقديم لبرنامج آخر يختلف عن برنامج التحضير الجامعي المخصص لطلبة الصف العاشر والحادي عشر.</span> 4- اعتبار الطلب مُكتملًا بعد استلامي رسالة بنجاح تقديم الطلب وحصولي علي رقم الطلب. 5- عدم النظر في أيّ طلب حُفظ كمسوّدة بعد فترة التقديم. 6- الإدلاء بالمعلومات المتعلّقة بالبعثات والمنح الدراسية وبرامج التحضير كافة التي حصلت عليها من جهات أخرى. 7- عدم ضمان الموافقة عليهي الجاميه
ar: أقرّ وأتعهّد أنا المتقدّم بطلب الالتحاق ببرنامج التحضير الجامعي لطلبة الصف العاشر والحادي عشر بالعلم والالتزام بالآتي\: 1- صحّة ودقّة البيانات وتعبئة الحقول الإلزامية كافة، والحقول غير الإلزامية في حال توفّر البيانات والدرجات، وارفاق مستندات سارية المفعول. 2- سيتم رفض الطلب تلقائيًا في حال نقص (المستندات، البيانات، الدرجات)، وعدم دقّة الدرجات المُدخلة. <span style\="color\:red">3- سيتم رفض الطلب تلقائيا في حال التقديم لبرنامج آخر يختلف عن برنامج التحضير الجامعي المخصص لطلبة الصف العاشر والحادي عشر.</span> 4- اعتبار الطلب مُكتملًا بعد استلامي رسالة بنجاح تقديم الطلب وحصولي على رقم الطلب. 5- عدم النظر في أيّ طلب حُفظ كمسوّدة بعد فترة التقديم. 6- الإدلاء بالمعلومات المتعلّقة بالبعثات والمنح الدراسية

# submissionformApplicaClosed
source: Applications for the academic year is currently closed, and the registration date for the next batch will be announced on the website
ar: تم إغلاق التقديم للسنة الدراسية الحالية، وسيتم الإعلان عن موعد التسجيل للدفعة القادمة على الموقع الإلكتروني

source: Mother Name
ar: اسم الأم

# motherNameWatermMark
source: Enter Mother Name
ar: أدخل اسم الأم

# motherNameValidate
source: Mother name is Required
ar: اسم الأم مطلوب

source: Action
ar: الإجراء
