Repository: abhay-kumar-LogiclyInfotech/SCO_v1
Catalog: lib/l10n/app_*.arb
Languages: ar

# grandfatherNameEnglishRequired
source: Grandfather's name is required
ar: حقل الاسم الثالث والرابع اجباري

# grandfatherNameEnglishWatermark
source: Enter grandfather's name
ar: ادخل الاسم الثالث والرابع

# grandfatherNameEnglishValidate
source: Please enter valid grandfather's name
ar: برجاء ادخال الاسم الثالث والرابع بشكل صحيح

# familyNameEnglish
source: Family name
ar: اسم العائلة او القبيلة

# familyNameEnglishRequired
source: Family name is required
ar: حقل اسم اسم العائلة او القبيلة

# familyNameEnglishWatermark
source: Enter family name
ar: ادخل اسم العائلة او القبيلة

# familyNameEnglishValidate
source: Please enter valid family name
ar: برجاء ادخال اسم العاȫلة او القبيلة بشكل صحيح

# studentNameArabic
source: Name
ar: الاسم الأول

# studentNameArabicRequired
source: Name is required
ar: حقل الاسم الأول

# studentNameArabicWatermark
source: Enter name
ar: ادخل الاسم الأول

# studentNameArabicValidate
source: Please enter valid name
ar: برجاء ادخال الاسم الأول بشكل صحيح

# fatherNameArabic
source: Father's name
ar: الاسم الثاني

# fatherNameArabicRequired
source: Father's name is required
ar: حقل الاسم الثاني اجباري

# fatherNameArabicWatermark
source: Enter father's name
ar: ادخل الاسم الثاني

# fatherNameArabicValidate
source: Please enter valid father's name
ar: برجاء ادخال الاسم الثاني بشكل صحيح

# grandfatherNameArabic
source: Grandfather's name
ar: الاسم الثالث والرابع

# grandfatherNameArabicRequired
source: Grandfather's name is required
ar: حقل الاسم الثالث والرابع اجباري

# grandfatherNameArabicWatermark
source: Enter grandfather's name
ar: ادخل الاسم الثالث والرابع

# grandfatherNameArabicValidate
source: Please enter valid grandfather's name
ar: برجاء ادخال الاسم الثالث والرابع بشكل صحيح

# familyNameArabic
source: Family name
ar: اسم العائلة او القبيلة

# familyNameArabicRequired
source: Family name is required
ar: حقل سم العائلة او القبيلة اجباري

# familyNameArabicWatermark
source: Enter family name
ar: ادخل رقم الهوية الاماراتية

# familyNameArabicValidate
source: Please enter valid family name
ar: برجاء ادخال اسم العائلة او القبيلة بشكل صحيح

source: Personal Details
ar: بيانات الهوية

# emiratesIdRequired
source: Emirates Id is required
ar: حقل رقم الهوية الاماراتية اجباري

# emiratesIdWatermark
source: Select emirates id
ar: ادخل رقم الهوية الاماراتية

# emiratesIdValidate
source: Please select valid emirates id
ar: برجاء ادخال رقم الهوية الاماراتية بشكل صحيح

# birthPlace
source: Place of birth
ar: مكان الميلاد

# birthPlaceRequired
source: Place of birth is required
ar: حقل مكان الميلاد اجباري

# birthPlaceWatermark
source: Enter place of birth
ar: ادخل مكان الميلاد

# birthPlaceValidate
source: Please enter valid place of birth
ar: برجاء ادخال مكان الميلاد بشكل صحيح

# genderRequired
source: Gender is required
ar: حقل النوع اجباري

# genderWatermark
source: Select gender
ar: اختر النوع

# genderValidate
source: Please select valid gender
ar: برجاء اختيار النوع بشكل صحيح

source: Marital status
ar: الحالة الاجتماعية

# maritalStatusRequired
source: Marital status is required
ar: حقل الحالة الاجتماعية اجباري

# maritalStatusWatermark
source: Select marital status
ar: اختر الحالة الاجتماعية

# maritalStatusValidate
source: Please select valid marital status
ar: برجاء اختيار الحالة الاجتماعية بشكل صحيح

# mobileNumberStudent
source: Student mobile number
ar: رقم الهاتف المحمول للطالب

# mobileNumberStudentRequired
source: Student mobile number is required
ar: حقل رقم الهاتف المحمول للطالب اجباري

# mobileNumberStudentWatermark
source: Enter student mobile number
ar: ادخل رقم الهاتف المحمول للطالب

# mobileNumberStudentValidate
source: Please enter valid student mobile number
ar: برجاء ادخال رقم الهاتف المحمول للطالب بشكل صحيح

# emailAddressRequired
source: Student email address is required
ar: حقل البريد الالكتروني للطالب اجباري

# emailAddressWatermark
source: Enter student email address
ar: ادخل البريد الالكتروني للطالب

# emailAddressValidate
source: Please enter valid student email address
ar: برجاء ادخال البريد الالكتروني للطالب بشكل صحيح

source: Passport Information
ar: بيانات جواز السفر

source: Passport number
ar: رقم جواز السفر

# passportNumberRequired
source: Passport number is required
ar: حقل رقم جواز السفر اجباري

# passportNumberWatermark
source: Enter passport number
ar: ادخل رقم جواز السفر

# passportNumberValidate
source: Please enter valid passport number
ar: برجاء ادخال رقم جواز السفر بشكل صحيح

# passportIssueDate
source: Issue date
ar: تاريخ الاصدار

# passportIssueDateRequired
source: Issue date is required
ar: حقل تاريخ الاصدار اجباري

# passportIssueDateWatermark
source: Select issue date
ar: اختر تاريخ الاصدار

# passportIssueDateValidate
source: Please select valid issue date
ar: برجاء اختيار تاريخ الاصدار بشكل صحيح

# passportExpireDate
source: Expiry date
ar: تاريخ الانتهاء

# passportExpireDateRequired
source: Expiry date is required
ar: حقل تاريخ الانتهاء اجباري

# passportExpireDateWatermark
source: Select expiry date
ar: اختر تاريخ الانتهاء

# passportExpireDateValidate
source: Please enter valid expiry date
ar: برجاء اختيار تاريخ الانتهاء بشكل صحيح

# unifiedNumber
source: Passport unified no
ar: الرقم الموحد

# unifiedNumberRequired
source: Passport unified no is required
ar: حقل الرقم الموحد اجباري

# unifiedNumberWatermark
source: Unified no on last page of passport
ar: الصفحة الاخيرة بجواز السفر

# unifiedNumberValidate
source: Please enter valid passport unified no
ar: برجاء ادخال الرقم الموحد بشكل صحيح

source: Address Details
ar: بيانات العنوان

source: Address type
ar: نوع العنوان

# addressTypeRequired
source: Address type is required
ar: حقل نوع العنوان اجباري

# addressTypeWatermark
source: Select address type
ar: ادخل نوع العنوان

# addressTypeValidate
source: Please select valid address type
ar: برجاء ادخال نوع العنوان بشكل صحيح

source: Address line 1
ar: حقل العنوان اجباري

# addressLine1Required
source: Address line 1 is required
ar: حقل العنوان اجباري

# addressLine1Watermark
source: Enter address line 1
ar: إدخل العنوان

# addressLine1Validate
source: Please enter valid address line 1
ar: ادخل العنوان بشكل صحيح

source: Address line 2
ar: رقم الفيلا أو اسم البناية

# addressLine2Required
source: Address line 2 is required
ar: حقل رقم الفيلا أو اسم البناية اجباري

# addressLine2Watermark
source: Enter address line 2
ar: ادخل رقم الفيلا أو اسم البناية

# addressLine2Validate
source: Please enter valid address line 2
ar: برجاء ادخال رقم الفيلا أو اسم البناية بشكل صحيح

# countryRequired
source: Country is required
ar: حقل الدولة اجباري

# countryWatermark
source: Select country
ar: اختر الدولة

# countryValidate
source: Please select valid country
ar: برجاء اختيار الدولة بشكل صحيح

# emirates
source: Emirates/States
ar: الإمارة / المنطقة

# emiratesRequired
source: Emirates/States is required
ar: حقل الإمارة / المنطقة اجباري

# emiratesWatermark
source: Select emirates/states
ar: اختر الإمارة / المنطقة

# emiratesValidate
source: Please select valid emirates/states
ar: برجاء اختيار الإمارة / المنطقة بشكل صحيح

source: City
ar: المدينة

# cityRequired
source: City is required
ar: حقل المدينة اجباري

# cityWatermark
source: Enter city
ar: ادخل المدينة

# cityValidate
source: Please enter valid city
ar: برجاء ادخال المدينة بشكل صحيح

# familyNumber
source: Family book number
ar: رقم الأسرة

# familyNumberRequired
source: Family book number is required
ar: حقل رقم الأسرة اجباري

# familyNumberWatermark
source: Enter family book number
ar: ادخل رقم الأسرة

# familyNumberValidate
source: Please enter valid family book number
ar: برجاء ادخال رقم الأسرة بشكل صحيح

# numberOfTown
source: Town's/Village's no
ar: رقم البلدة

# numberOfTownRequired
source: Town's/Village's no is required
ar: حقل رقم البلدة اجباري

# numberOfTownWatermark
source: Enter town's/village's no
ar: ادخل رقم البلدة

# numberOfTownValidate
source: Please enter valid town's/village's no
ar: برجاء ادخال رقم البلدة بشكل صحيح

# mobileNumberParent
source: Parent/Guardian mobile number
ar: رقم الهاتف المتحرك لولي الأمر

# mobileNumberParentRequired
source: Parent/Guardian mobile number is required
ar: حقل رقم الهاتف المتحرك لولي الأمر اجباري

# mobileNumberParentWatermark
source: Enter parent/Guardian mobile number
ar: ادخل رقم الهاتف المتحرك لولي الأمر

# mobileNumberParentValidate
source: Please enter valid parent/Guardian mobile number
ar: برجاء ادخال رقم الهاتف المتحرك لولي الأمر بشكل صحيح

# homeNumber
source: Phone number
ar: رقم هاتف

# homeNumberRequired
source: Phone number is required
ar: حقل رقم هاتف ا اجباري

# homeNumberWatermark
source: Enter phone number
ar: ادخل رقم هاتف

# homeNumberValidate
source: Please enter valid phone number
ar: برجاء ادخال رقم هاتف بشكل صحيح

# otherNumber
source: Other phone number
ar: رقم هاتف آخر

# otherNumberRequired
source: Other phone number is required
ar: حقل رقم هاتف آخر اجباري

# otherNumberWatermark
source: Enter other phone number
ar: ادخل رقم هاتف آخر

# otherNumberValidate
source: Please enter valid other phone number
ar: برجاء ادخال رقم هاتف آخر بشكل صحيح

# parentName
source: Parent/Guardian name
ar: اسم ولي الأمر

# parentNameRequired
source: Parent/Guardian name is required
ar: حقل اسم ولي الأمر اجباري

# parentNameWatermark
source: Enter parent/Guardian name
ar: ادخل اسم ولي الأمر

# parentNameValidate
source: Please enter valid parent/Guardian name
ar: برجاء ادخال اسم ولي الأمر بشكل صحيح

source: Relation type
ar: صلة القرابة

# relationTypeRequired
source: Relation type is required
ar: حقل صلة القرابة اجباري

# relationTypeWatermark
source: Select relation type
ar: اختر صلة القرا بة

# relationTypeValidate
source: Please select valid relation type
ar: برجاء ادخال صلة القرابة بشكل صحيح

# relativesInfo
source: Relatives Information
ar: إضافة قريب مبتعث

# relativesStudyingScholarship
source: Do you have relatives studying in scholarship
ar: هل لديك أقارب مبتعثين حالياً ضمن بعثات المكتب؟

# relativesStudyingScholarshipRequired
source: Do you have relatives studying in scholarship is required
ar: حقل هل لديك أقارب مبتعثين حالياً؟ اجباري

# relativesStudyingScholarshipWatermark
source: Select do you have relatives studying in scholarship
ar: اختر هل لديك أقارب مبتعثين حالياً؟

# relativesStudyingScholarshipValidate
source: Please select valid do you have relatives studying in scholarship
ar: برجاء اختيار هل لديك أقارب مبتعثين حالياً؟ بشكل صحيح

source: Relative Name
ar: اسم القريب المبتعث

# relativeNameRequired
source: Relative name is required
ar: حقل اسم القريب المبتعث اجباري

# relativeNameWatermark
source: Enter relative name
ar: ادخل اسم القريب المبتعث

# relativeNameValidate
source: Please enter valid relative name
ar: برجاء ادخال اسم القريب المبتعث بشكل صحيح

source: University
ar: الجامعة

# universityRequired
source: University is required
ar: حقل الجامعة اجباري

# universityWatermark
source: Select university
ar: ادخل الجامعة

# universityValidate
source: Please select valid university
ar: برجاء ادخالالجامعة بشكل صحيح

# scholarshipTypeRequired
source: Please select scholarship type
ar: حقل نوع البعثة الدراسية اجباري

# scholarshipTypeWatermark
source: Select scholarship type
ar: ادخل نوع البعثة الدراسية

# scholarshipTypeValidate
source: Please select valid scholarship type
ar: برجاء ادخال نوع البعثة الدراسية بشكل صحيح

# internal
source: Within UAE
ar: داخل الدولة

# external
source: Abroad
ar: خارج الدولة

# hsLevel
source: High School Level
ar: السنة أو الفصل الدراسي

# hsLevelRequired
source: High School Level is required
ar: حقل السنة أو الفصل الدراسي اجباري

# hsLevelWatermark
source: Select high school level
ar: اختر السنة أو الفصل الدراسي العامة

# hsLevelValidate
source: Please select valid high school level
ar: برجاء اختيار السنة أو الفصل الدراسي بشكل صحيح

# hsName
source: School name
ar: اسم المدرسة

# hsNameRequired
source: School name is required
ar: حقل اسم المدرسة اجباري

# hsNameWatermark
source: Enter school name
ar: ادخل اسم المدرسة

# hsNameValidate
source: Please enter valid school name
ar: برجاء ادخال اسم المدرسة بشكل صحيح

# hsYearOfPassing
source: Year of passing
ar: تاريخ التخرج

# hsYearOfPassingRequired
source: Year of passing is required
ar: حقل تاريخ التخرج اجباري

# hsYearOfPassingWatermark
source: Select year of passing
ar: اختر تاريخ التخرج

# hsYearOfPassingValidate
source: Please select valid year of passing
ar: برجاء ادخال تاريخ التخرج بشكل صحيح

# hsType
source: School type
ar: نوع المدرسة

# hsTypeRequired
source: School type is required
ar: حقل نوع المدرسة اجباري

# hsTypeWatermark
source: Select school type
ar: اختر نوع المدرسة

# hsTypeValidate
source: Please select valid school type
ar: برجاء اختيار نوع المدرسة بشكل صحيح

# curriculumTypes
source: Curriculum type
ar: نوع المنهاج الدراسي

# curriculumTypesRequired
source: Curriculum type is required
ar: حقل نوع المنهاج الدراسي اجباري

# curriculumTypesWatermark
source: Select curriculum type
ar: اختر نوع المنهاج الدراسي

# curriculumTypesValidate
source: Please select valid curriculum type
ar: برجاء اختيار نوع المنهاج الدراسي بشكل صحيح

# subjectTypes
source: Subject type
ar: نوع المادة الدراسية

# subjectTypesRequired
source: Subject type is required
ar: حقل نوع المادة الدراسية اجباري

# subjectTypesWatermark
source: Select subject type
ar: اختر نوع المادة الدراسية

# subjectTypesValidate
source: Please select valid subject type
ar: برجاء اختيار نوع المادة الدراسية بشكل صحيح

# grade
source: Grade/Percentage
ar: المعدل أو النسبة

# gradeRequired
source: Grade/Percentage is required
ar: حقل المعدل أو النسبة اجباري

# gradeWatermark
source: Enter grade/percentage
ar: ادخل المعدل أو النسبة

# gradeValidate
source: Please enter valid grade/percentage
ar: برجاء ادخال المعدل أو النسبة بشكل صحيح

source: Scale
ar: المقياس

# scaleRequired
source: Scale is required
ar: حقل المقياس اجباري

# scaleWatermark
source: Enter scale
ar: ادخل المقياس

# scaleValidate
source: Please enter valid scale
ar: برجاء ادخال المقياس بشكل صحيح

# militaryServicePanel
source: Military Services
ar: الخدمة الوطنية / العسكرية

# militaryService
source: Did you serve in military?
ar: (للإناث يكتفي باختيار لا) هل اديت الخدمة الوطنية / العسكرية ؟

# militaryServiceRequired
source: Did you serve in military is required
ar: حقل هل اديت الخدمة الوطنية / العسكرية ؟ اجباري

# militaryServiceWatermark
source: Select did you serve in military
ar: (للإناث يكتفي باختيار لا)اختر هل اديت الخدمة الوطنية / العسكرية ؟

# militaryServiceValidate
source: Please select valid did you serve in military
ar: برجاء اختيار هل اديت الخدمة الوطنية / العسكرية ؟ بشكل صحيح

# militaryServiceStartDate
source: Start date
ar: تاريخ البداية

# militaryServiceStartDateRequired
source: Start date is required
ar: حقل تاريخ البداية اجباري

# militaryServiceStartDateWatermark
source: Select start date
ar: اختر تاريخ البداية

# militaryServiceStartDateValidate
source: Please select valid start date
ar: برجاء اختيار تاريخ البداية بشكل صحيح

# militaryServiceEndDate
source: End date
ar: تاريخ النهاية

# militaryServiceEndDateRequired
source: End date is required
ar: حقل تاريخ النهاية اجباري

# militaryServiceEndDateWatermark
source: Select end date
ar: اختر تاريخ النهاية

# militaryServiceEndDateValidate
source: Please select valid end date
ar: برجاء اختيار تاريخ النهاية بشكل صحيح

source: Graduation Details
ar: بيانات المؤهل الجامعي

# hsGraduationLevel
source: Graduation Level
ar: المؤهل الجامعي

# hsGraduationLevelRequired
source: Graduation Level is required
ar: حقل المؤهل الجامعي اجباري

# hsGraduationLevelWatermark
source: Select graduation level
ar: اختر المؤهل الجامعي

# hsGraduationLevelValidate
source: Please select valid graduation level
ar: برجاء اختيار المؤهل الجامعي بشكل صحيح

# hsUniversity
source: University
ar: الجامعة

# hsUniversityRequired
source: University is required
ar: حقل الجامعة اجباري

# hsUniversityWatermark
source: Select university
ar: اختر الجامعة

# hsUniversityValidate
source: Please select valid university
ar: برجاء اختيار الجامعة بشكل صحيح

# hsOtherUniversity
source: Other University
ar: جامعة اخرى

# hsOtherUniversityRequired
source: Other University is required
ar: حقل جامعة اخرى اجباري

# hsOtherUniversityWatermark
source: Enter other university
ar: ادخل جامعة اخرى

# hsOtherUniversityValidate
source: Please enter valid other university
ar: برجاء ادخال جامعة اخرى بشكل صحيح

# hsMajor
source: Major
ar: التخصص

# hsMajorRequired
source: Major is required
ar: حقل التخصص اجباري

# hsMajorWatermark
source: Enter major
ar: اختر التخصص

# hsMajorWatermark1
source: Select major
ar: ادخل اسم الجامعة

# hsMajorValidate
source: Please select valid major
ar: برجاء اختيار التخصص بشكل صحيح

source: CGPA
ar: المعدل التراكمي

# cgpaRequired
source: CGPA is required
ar: حقل المعدل التراكمي اجباري

# cgpaWatermark
source: Enter CGPA
ar: ادخل المعدل التراكمي

# cgpaValidate
source: Please enter valid CGPA
ar: برجاء ادخال المعدل التراكمي بشكل صحيح

# hsDateOfGraduation
source: Year of Graduation
ar: عام التخرج

# hsDateOfGraduationRequired
source: Year of Graduation is required
ar: حقل عام التخرج اجباري

# hsDateOfGraduationWatermark
source: Select year of Graduation
ar: اختر عام التخرج

# hsDateOfGraduationValidate
source: Please select valid year of Graduation
ar: برجاء اختيار عام التخرج بشكل صحيح

# hsSponsorship
source: Sponsorship
ar: الجهة المانحة

# hsSponsorshipRequired
source: Sponsorship is required
ar: ادخل الجهة المانحة

# hsSponsorshipWatermark
source: Enter sponsorship
ar: ادخل اسم الجهة المانحة

# hsSponsorshipValidate
source: Please enter valid sponsorship
ar: برجاء ادخال المانحة بشكل صحيح

source: Case Study
ar: دراسات - ابحاث

# caseStudyTitle
source: Title
ar: موضوع البحث

# caseStudyTitleRequired
source: Title is required
ar: حقل موضوع البحث اجباري

# caseStudyTitleWatermark
source: Enter title
ar: ادخل موضوع البحث

# caseStudyTitleValidate
source: Please enter valid title
ar: برجاء ادخال موضوع البحث بشكل صحيح

# caseStudyStartYear
source: Start year
ar: عام البداية

# caseStudyStartYearRequired
source: Start year is required
ar: حقل عام البداية اجباري

# caseStudyStartYearWatermark
source: Select start year
ar: اختر عام البداية

# caseStudyStartYearValidate
source: Please select valid start year
ar: برجاء اختيار عام البداية بشكل صحيح

# caseStudyDescription
source: Case study details
ar: وصف البحث

# caseStudyDescriptionRequired
source: Case study details is required
ar: حقل وصف البحث اجباري

# caseStudyDescriptionWatermark
source: Enter case study details
ar: ادخل وصف البحث

# caseStudyDescriptionValidate
source: Please enter valid case study details
ar: برجاء ادخال وصف البحث بشكل صحيح

source: Previously employed
ar: الحالة الوظيفية

# previouslyEmployedRequired
source: Previously employed is required
ar: حقل الحالة الوظيفية اجباري

# previouslyEmployedWatermark
source: Select previously employed
ar: اختر الحالة الوظيفية

# previouslyEmployedValidate
source: Please select valid previously employed
ar: برجاء اختيار الحالة الوزيفية بشكل صحيح

source: Employment Details
ar: بيانات الوظيفة

# emphistEmployerName
source: Employer name
ar: جهة العمل

# emphistEmployerNameRequired
source: Employer name is required
ar: حقل جهة العمل اجباري

# emphistEmployerNameWatermark
source: Enter employer name
ar: ادخل جهة العمل

# emphistEmployerNameValidate
source: Please enter valid employer name
ar: برجاء ادخال جهة العمل بشكل صحيح

# emphistTitleName
source: Designation
ar: الوزيفة / المنصب

# emphistTitleNameRequired
source: Designation is required
ar: حقل الوزيفة / المنصب اجباري

# emphistTitleNameWatermark
source: Enter designation
ar: ادخل الوزيفة / المنصب

# emphistTitleNameValidate
source: Please enter valid designation
ar: برجاء ادخال الوزيفة / المنصب بشكل صحيح

# emphistOccupationName
source: Occupation
ar: المهنة

# emphistOccupationNameRequired
source: Occupation is required
ar: حقل المهنة اجباري

# emphistOccupationNameWatermark
source: Enter occupation
ar: ادخل المهنة

# emphistOccupationNameValidate
source: Please enter valid occupation
ar: برجاء إدخل المهنة بشكل صحيح

# emphistPlace
source: Work place
ar: مكان العمل

# emphistPlaceRequired
source: Work place is required
ar: حقل مكان العمل إجباري

# emphistPlaceWatermark
source: Enter work place
ar: ادخل مكان العمل

# emphistPlaceValidate
source: Please enter valid work place
ar: برجاء إدخل مكان العمل بشكل صحيح

# emphistReportingManager
source: Reporting manager
ar: المسؤول المباشر

# emphistReportingManagerRequired
source: Reporting manager is required
ar: حقل المسؤول المباشر إجباري

# emphistReportingManagerWatermark
source: Enter reporting manager
ar: ادخل المسؤول المباشر

# emphistReportingManagerValidate
source: Please enter valid reporting manager
ar: برجاء إدخل المسؤول المباشر بشكل صحيح

# emphistMgrContactNo
source: Contact number
ar: رقم هاتف المسؤول المباشر

# emphistMgrContactNoRequired
source: Contact number is required
ar: حقل رقم هاتف المسؤول المباشر إجباري

# emphistMgrContactNoWatermark
source: Enter contact number
ar: ادخل رقم المسؤول المباشر

# emphistMgrContactNoValidate
source: Please enter valid contact number
ar: برجاء إدخل رقم هاتف المسؤول المباشر بشكل صحيح

# majorsYouWishToStudy
source: The majors you wish to study at the university sorted according to priority
ar: التخصصات المرغوب بدراستها بالجامعة مرتبة حسب الأولوية

# sr
source: Sr. No
ar: مسلسل

source: Majors
ar: التخصصات

# majorsRequired
source: Majors is required
ar: حقل التخصصات إجباري

# majorsWatermark
source: Select majors
ar: اختر التخصص

# majorsValidate
source: Please select valid majors
ar: برجاء إختيار التخصص بشكل صحيح

# universityNameIfOther
source: Other University
ar: جامعة اخرى

# universityNameIfOtherRequired
source: Other University is required
ar: حقل جامعة اخرى إجباري

# universityNameIfOtherWatermark
source: Enter other university
ar: ادخل جامعة اخرى

# universityNameIfOtherValidate
source: Please enter valid other university
ar: برجاء ادخال جامعة اخرى بشكل صحيح

# universityStatus
source: Status
ar: الحالة

# universityStatusRequired
source: Status is required
ar: حقل الحالة اجباري

# universityStatusWatermark
source: Select status
ar: اختر الحالة

# universityStatusValidate
source: Please select valid status
ar: برجاء اختيار الحالة بشكل صحيح

# examinationForUniversities
source: Examination for universities - (IELTS, TOEFL, EMSAT, SAT, AP, etc)
ar: اختبارات الجامعات - يرجي إدخال درجات جميع الاختبارات التي تم تقديمها

source: Examination
ar: نوع الإختبار

# examinationRequired
source: Examination is required
ar: حقل نوع الإختبار اجباري

# examinationWatermark
source: Select examination
ar: اختر نوع الإختبار

# examinationValidate
source: Please select valid examination
ar: برجاء اختيار نوع الإختبار بشكل صحيح

source: Examination type
ar: مواد الاختبار

# examinationTypeRequired
source: Examination type is required
ar: حقل مواد الاختبار اجباري

# examinationTypeWatermark
source: Select examination type
ar: اختر مواد الاختبار

# examinationTypeValidate
source: Please select valid examination type
ar: برجاء اختيار مواد الاختبار بشكل صحيح

# examinationGrade
source: Grade/Percentage
ar: درجة الاختبار

# examinationGradeRequired
source: Grade/Percentage is required
ar: حقل درجة الاختبار اجباري

# examinationGradeWatermark
source: Enter grade/percentage
ar: ادخل درجة الاختبار

# examinationGradeValidate
source: Please enter valid grade/percentage
ar: برجاء ادخال درجة الاختبار بشكل صحيح

# examinationDdsGrade
source: Grade
ar: الدرجة

# examinationDdsGradeRequired
source: Grade
ar: حقل الدرجة اجباري

# examinationDdsGradeWatermark
source: Enter grade
ar: ادخل الدرجة

# examinationDdsGradeValidate
source: Please enter valid grade
ar: برجاء ادخال الدرجة بشكل صحيح

# dateExam
source: Date of examination
ar: تاريخ الاختبار

# dateExamRequired
source: Date of examination is required
ar: حقل تاريخ الاختبار اجباري

# dateExamWatermark
source: Select date of examination
ar: اختر تاريخ الاختبار

# dateExamValidate
source: Please select valid date of examination
ar: برجاء اختيار تاريخ الاختبار بشكل صحيح

source: Add more
ar: اضافة المزيد
